sol4ik/audio-steganography/try/fm4/s6e2cc_i2s_sk-fm4-176l-s6se2cc-v10/common/s6e2cc.h
#elif (PDL_MCU_INT_TYPE == PDL_INT_TYPE_C)
typedef enum IRQn
{
    NMI_IRQn          = -14, /* A<- */
    HardFault_IRQn    = -13, /* A<- */
    MemManage_IRQn    = -12, /* A<- */
    BusFault_IRQn     = -11, /* A<- */
    UsageFault_IRQn   = -10, /* A<- */
    SVC_IRQn          = -5,  /* A<- */
    DebugMonitor_IRQn = -4,  /* A<- */
    PendSV_IRQn       = -2,  /* A<- */
    SysTick_IRQn      = -1,  /* A<- */

    CSV_IRQn          =  0, /* A<- */
    SWDT_IRQn         =  1, /* A<- */
    LVD_IRQn          =  2, /* A<- */
    WFG_IRQn          =  3, /* A<- */
    EXINT0_7_IRQn     =  4, /* A<- */
    EXINT8_31_IRQn    =  5, /* A<- */
    MFS0_8_RX_IRQn    =  6, /* A<- */
    MFS0_8_TX_IRQn    =  7, /* A<- */
    MFS1_9_RX_IRQn    =  8, /* A<- */
    MFS1_9_TX_IRQn    =  9, /* A<- */
    MFS2_10_RX_IRQn   =  10,/* A<- */
    MFS2_10_TX_IRQn   =  11,/* A<- */
    MFS3_11_RX_IRQn   =  12, /* A<- */
    MFS3_11_TX_IRQn   =  13, /* A<- */
    MFS4_12_RX_IRQn   =  14, /* A<- */
    MFS4_12_TX_IRQn   =  15, /* A<- */
    MFS5_13_RX_IRQn   =  16, /* A<- */
    MFS5_13_TX_IRQn   =  17, /* A<- */
    MFS6_14_RX_IRQn   =  18, /* A<- */
    MFS6_14_TX_IRQn   =  19, /* A<- */
    MFS7_15_RX_IRQn   =  20, /* A<- */
    MFS7_15_TX_IRQn   =  21, /* A<- */
    PPG_IRQn          =  22, /* A<- */
    OSC_PLL_WC_RTC_IRQn   = 23, /* A<- */
    ADC0_IRQn         = 24, /* A<- */
    FRTIM_IRQn        = 25, /* A<- */
    INCAP_IRQn        = 26, /* A<- */
    OUTCOMP_IRQn      = 27, /* A<- */
    BTIM0_7_IRQn      = 28, /* A<- */
    ADC2_LCD_IRQn     = 29, /* A<- */
    USB1F_HDMICEC0_IRQn        = 30, /* A<- */
    USB1F_USB1H_HDMICEC1_IRQn  = 31, /* A<- */
} IRQn_Type;
#else
    #error Interrupt Type not found!
#endif // PDL_INT_TYPE

#include "core_cm4.h"
#include "system_s6e2cc.h"
#include <stdint.h>

#define SUCCESS  0
#define ERROR    -1

#ifndef NULL
#define NULL 0
#endif


/******************************************************************************/
/*                Device Specific Peripheral Registers structures             */
/******************************************************************************/

#if defined ( __CC_ARM   )
#pragma anon_unions
#endif

/******************************************************************************
 * INTREQ_MODULE Bit fields and registers depending on device type
 ******************************************************************************/
#if (PDL_MCU_INT_TYPE == PDL_INT_TYPE_A)

/* Interrupt request read registers */
typedef struct
{
    __IO uint32_t DRQSEL;
    uint8_t RESERVED0[12];
    __IO uint32_t EXC02MON;
    __IO uint32_t IRQ00MON;
    __IO uint32_t IRQ01MON;
    __IO uint32_t IRQ02MON;
    __IO uint32_t IRQ03MON;
    __IO uint32_t IRQ04MON;
    __IO uint32_t IRQ05MON;
    __IO uint32_t IRQ06MON;
    __IO uint32_t IRQ07MON;
    __IO uint32_t IRQ08MON;
    __IO uint32_t IRQ09MON;
    __IO uint32_t IRQ10MON;
    __IO uint32_t IRQ11MON;
    __IO uint32_t IRQ12MON;
    __IO uint32_t IRQ13MON;
    __IO uint32_t IRQ14MON;
    __IO uint32_t IRQ15MON;
    __IO uint32_t IRQ16MON;
    __IO uint32_t IRQ17MON;
    __IO uint32_t IRQ18MON;
    __IO uint32_t IRQ19MON;
    __IO uint32_t IRQ20MON;
    __IO uint32_t IRQ21MON;
    __IO uint32_t IRQ22MON;
    __IO uint32_t IRQ23MON;
    __IO uint32_t IRQ24MON;
    __IO uint32_t IRQ25MON;
    __IO uint32_t IRQ26MON;
    __IO uint32_t IRQ27MON;
    __IO uint32_t IRQ28MON;
    __IO uint32_t IRQ29MON;
    __IO uint32_t IRQ30MON;
    __IO uint32_t IRQ31MON;
    __IO uint32_t IRQ32MON;
    __IO uint32_t IRQ33MON;
    __IO uint32_t IRQ34MON;
    __IO uint32_t IRQ35MON;
    __IO uint32_t IRQ36MON;
    __IO uint32_t IRQ37MON;
    __IO uint32_t IRQ38MON;
    __IO uint32_t IRQ39MON;
    __IO uint32_t IRQ40MON;
    __IO uint32_t IRQ41MON;
    __IO uint32_t IRQ42MON;
    __IO uint32_t IRQ43MON;
    __IO uint32_t IRQ44MON;
    __IO uint32_t IRQ45MON;
    __IO uint32_t IRQ46MON;
    __IO uint32_t IRQ47MON;
}PDL_INTREQ_TypeDef;

#define PDL_INTREQ_BASE     (PDL_PERIPH_BASE + 0x31000UL)  // Interrupt request read registers
#define PDL_INTREQ          ((PDL_INTREQ_TypeDef *)PDL_INTREQ_BASE)

#elif (PDL_MCU_INT_TYPE == PDL_INT_TYPE_C)

/* Interrupt request read registers */
typedef struct
{
    uint8_t RESERVED0[16];
    __IO uint32_t EXC02MON;
    __IO uint32_t IRQ00MON;
    __IO uint32_t IRQ01MON;
    __IO uint32_t IRQ02MON;
    __IO uint32_t IRQ03MON;
    __IO uint32_t IRQ04MON;
    __IO uint32_t IRQ05MON;
    __IO uint32_t IRQ06MON;
    __IO uint32_t IRQ07MON;
    __IO uint32_t IRQ08MON;
    __IO uint32_t IRQ09MON;
    __IO uint32_t IRQ10MON;
    __IO uint32_t IRQ11MON;
    __IO uint32_t IRQ12MON;
    __IO uint32_t IRQ13MON;
    __IO uint32_t IRQ14MON;
    __IO uint32_t IRQ15MON;
    __IO uint32_t IRQ16MON;
    __IO uint32_t IRQ17MON;
    __IO uint32_t IRQ18MON;
    __IO uint32_t IRQ19MON;
    __IO uint32_t IRQ20MON;
    __IO uint32_t IRQ21MON;
    __IO uint32_t IRQ22MON;
    __IO uint32_t IRQ23MON;
    __IO uint32_t IRQ24MON;
    __IO uint32_t IRQ25MON;
    __IO uint32_t IRQ26MON;
    __IO uint32_t IRQ27MON;
    __IO uint32_t IRQ28MON;
    __IO uint32_t IRQ29MON;
    __IO uint32_t IRQ30MON;
    __IO uint32_t IRQ31MON;
}PDL_INTREQ_TypeDef;

#define PDL_INTREQ_BASE   (PDL_PERIPH_BASE + 0x31000UL)  // Interrupt request read registers
#define FPDL_INTREQ       ((PDL_INTREQ_TypeDef *)PDL_INTREQ_BASE)

#endif // PDL_INT_TYPE


/******************************************************************************
 * Peripheral register bit fields
 ******************************************************************************/

/******************************************************************************
 * FLASH_IF_MODULE
 ******************************************************************************/
/* FLASH_IF_MODULE register bit fields */
typedef struct stc_flash_if_faszr_field
{
  __IO uint32_t ASZ        : 2;
} stc_flash_if_faszr_field_t;

typedef struct stc_flash_if_frwtr_field
{
  __IO uint32_t RWT        : 2;
} stc_flash_if_frwtr_field_t;

typedef struct stc_flash_if_fstr_field
{
  __IO uint32_t RDY        : 1;
  __IO uint32_t HNG        : 1;
  __IO uint32_t ERR        : 1;
} stc_flash_if_fstr_field_t;

typedef struct stc_flash_if_fsyndn_field
{
  __IO uint32_t SD         : 3;
} stc_flash_if_fsyndn_field_t;

typedef struct stc_flash_if_fbfcr_field
{
  __IO uint32_t BE         : 1;
  __IO uint32_t BS         : 1;
} stc_flash_if_fbfcr_field_t;

