sol4ik/audio-steganography/try/fm4/s6e2cc_i2s_sk-fm4-176l-s6se2cc-v10/common/s6e2cc.h
typedef struct stc_clk_gating_cken2_field
{
  __IO uint32_t USBCK0     : 1;
  __IO uint32_t USBCK1     : 1;
       uint32_t RESERVED1  : 2;
  __IO uint32_t CANCK0     : 1;
  __IO uint32_t CANCK1     : 1;
  __IO uint32_t CANCK2     : 1;
       uint32_t RESERVED2  : 1;
  __IO uint32_t SDCCK      : 1;
       uint32_t RESERVED3  : 7;
  __IO uint32_t I2SCK0     : 1;
  __IO uint32_t I2SCK1     : 1;
       uint32_t RESERVED4  : 2;
  __IO uint32_t PCRCCK     : 1;
       uint32_t RESERVED5  : 3;
  __IO uint32_t CECCK0     : 1;
  __IO uint32_t CECCK1     : 1;
       uint32_t RESERVED6  : 2;
  __IO uint32_t QSPICK     : 1;
} stc_clk_gating_cken2_field_t;

typedef struct stc_clk_gating_mrst2_field
{
  __IO uint32_t USBRST0    : 1;
  __IO uint32_t USBRST1    : 1;
       uint32_t RESERVED1  : 2;
  __IO uint32_t CANRST0    : 1;
  __IO uint32_t CANRST1    : 1;
  __IO uint32_t CANRST2    : 1;
       uint32_t RESERVED2  : 1;
  __IO uint32_t SDCRST     : 1;
       uint32_t RESERVED3  : 7;
  __IO uint32_t I2SRST0    : 1;
  __IO uint32_t I2SRST1    : 1;
       uint32_t RESERVED4  : 2;
  __IO uint32_t PCRCRST    : 1;
       uint32_t RESERVED5  : 3;
  __IO uint32_t CECRST0    : 1;
  __IO uint32_t CECRST1    : 1;
       uint32_t RESERVED6  : 2;
  __IO uint32_t QSPIRST    : 1;
} stc_clk_gating_mrst2_field_t;

/******************************************************************************
 * I2SPRE_MODULE
 ******************************************************************************/
/* I2SPRE_MODULE register bit fields */
typedef struct stc_i2spre_iccr_field
{
  __IO uint32_t ICEN       : 1;
  __IO uint32_t ICSEL      : 1;
} stc_i2spre_iccr_field_t;

typedef struct stc_i2spre_ipcr1_field
{
  __IO uint32_t IPLLEN     : 1;
} stc_i2spre_ipcr1_field_t;

typedef struct stc_i2spre_ipcr2_field
{
  __IO uint32_t IPOWT      : 3;
} stc_i2spre_ipcr2_field_t;

typedef struct stc_i2spre_ipcr3_field
{
  __IO uint32_t IPLLK      : 5;
} stc_i2spre_ipcr3_field_t;

typedef struct stc_i2spre_ipcr4_field
{
  __IO uint32_t IPLLN      : 7;
} stc_i2spre_ipcr4_field_t;

typedef struct stc_i2spre_ip_str_field
{
  __IO uint32_t IPRDY      : 1;
} stc_i2spre_ip_str_field_t;

typedef struct stc_i2spre_ipint_enr_field
{
  __IO uint32_t IPCSE      : 1;
} stc_i2spre_ipint_enr_field_t;

typedef struct stc_i2spre_ipint_clr_field
{
  __IO uint32_t IPCSC      : 1;
} stc_i2spre_ipint_clr_field_t;

typedef struct stc_i2spre_ipint_str_field
{
  __IO uint32_t IPCSI      : 1;
} stc_i2spre_ipint_str_field_t;

typedef struct stc_i2spre_ipcr5_field
{
  __IO uint32_t IPLLM      : 7;
} stc_i2spre_ipcr5_field_t;

/******************************************************************************
 * EXBUS_MODULE
 ******************************************************************************/
/* EXBUS_MODULE register bit fields */
typedef struct stc_exbus_mode_field
{
  __IO uint32_t WDTH       : 2;
  __IO uint32_t RBMON      : 1;
  __IO uint32_t WEOFF      : 1;
  __IO uint32_t NAND       : 1;
  __IO uint32_t PAGE       : 1;
  __IO uint32_t RDY        : 1;
  __IO uint32_t SHRTDOUT   : 1;
  __IO uint32_t MPXMODE    : 1;
  __IO uint32_t ALEINV     : 1;
       uint32_t RESERVED1  : 1;
  __IO uint32_t MPXDOFF    : 1;
  __IO uint32_t MPXCSOF    : 1;
  __IO uint32_t MOEXEUP    : 1;
       uint32_t RESERVED2  : 18;
} stc_exbus_mode_field_t;

typedef struct stc_exbus_tim_field
{
  __IO uint32_t RACC       : 4;
  __IO uint32_t RADC       : 4;
  __IO uint32_t FRADC      : 4;
  __IO uint32_t RIDLC      : 4;
  __IO uint32_t WACC       : 4;
  __IO uint32_t WADC       : 4;
  __IO uint32_t WWEC       : 4;
  __IO uint32_t WIDLC      : 4;
} stc_exbus_tim_field_t;

typedef struct stc_exbus_area_field
{
  __IO uint32_t ADDR       : 8;
       uint32_t RESERVED1  : 8;
  __IO uint32_t MASK       : 7;
       uint32_t RESERVED2  : 9;
} stc_exbus_area_field_t;

typedef struct stc_exbus_atim_field
{
  __IO uint32_t ALC        : 4;
  __IO uint32_t ALES       : 4;
  __IO uint32_t ALEW       : 4;
       uint32_t RESERVED0  : 20;
} stc_exbus_atim_field_t;

typedef struct stc_exbus_sdmode_field
{
  __IO uint32_t SDON       : 1;
  __IO uint32_t PDON       : 1;
  __IO uint32_t ROFF       : 1;
       uint32_t RESERVED1  : 1;
  __IO uint32_t CASEL      : 2;
       uint32_t RESERVED2  : 2;
  __IO uint32_t RASEL      : 4;
  __IO uint32_t BASEL      : 4;
  __IO uint32_t MSDCLKOFF  : 1;
       uint32_t RESERVED3  : 15;
} stc_exbus_sdmode_field_t;

typedef struct stc_exbus_reftim_field
{
  __IO uint32_t REFC       : 16;
  __IO uint32_t NREF       : 8;
  __IO uint32_t PREF       : 1;
       uint32_t RESERVED0  : 7;
} stc_exbus_reftim_field_t;

typedef struct stc_exbus_pwrdwn_field
{
  __IO uint32_t PDC        : 16;
       uint32_t RESERVED0  : 16;
} stc_exbus_pwrdwn_field_t;

typedef struct stc_exbus_sdtim_field
{
  __IO uint32_t CL         : 2;
       uint32_t RESERVED1  : 2;
  __IO uint32_t TRC        : 4;
  __IO uint32_t TRP        : 4;
  __IO uint32_t TRCD       : 4;
  __IO uint32_t TRAS       : 4;
  __IO uint32_t TREFC      : 4;
  __IO uint32_t TDPL       : 2;
       uint32_t RESERVED2  : 5;
  __IO uint32_t BOFF       : 1;
} stc_exbus_sdtim_field_t;

typedef struct stc_exbus_sdcmd_field
{
  __IO uint32_t SDAD       : 16;
  __IO uint32_t SDWE       : 1;
  __IO uint32_t SDCAS      : 1;
  __IO uint32_t SDRAS      : 1;
  __IO uint32_t SDCS       : 1;
  __IO uint32_t SDCKE      : 1;
       uint32_t RESERVED1  : 10;
  __IO uint32_t PEND       : 1;
} stc_exbus_sdcmd_field_t;

typedef struct stc_exbus_memcerr_field
{
  __IO uint32_t SFER       : 1;
  __IO uint32_t SDER       : 1;
  __IO uint32_t SFION      : 1;
  __IO uint32_t SDION      : 1;
       uint32_t RESERVED0  : 28;
} stc_exbus_memcerr_field_t;

typedef struct stc_exbus_dclkr_field
{
  __IO uint32_t MDIV       : 4;
  __IO uint32_t MCLKON     : 1;
       uint32_t RESERVED0  : 27;
} stc_exbus_dclkr_field_t;

typedef struct stc_exbus_est_field
{
  __IO uint32_t WERR       : 1;
       uint32_t RESERVED0  : 31;
} stc_exbus_est_field_t;

typedef struct stc_exbus_wead_field
{
  __IO uint32_t ADDR       : 32;
} stc_exbus_wead_field_t;

typedef struct stc_exbus_esclr_field
{
  __IO uint32_t WERRCLR    : 1;
       uint32_t RESERVED0  : 31;
} stc_exbus_esclr_field_t;

typedef struct stc_exbus_amode_field
{
  __IO uint32_t WAEN       : 1;
       uint32_t RESERVED0  : 31;
} stc_exbus_amode_field_t;

