sol4ik/audio-steganography/try/fm4/s6e2cc_i2s_sk-fm4-176l-s6se2cc-v10/common/s6e2cc.h
typedef struct stc_hsspi_txe_field
{
  __IO uint32_t TFFE       : 1;
  __IO uint32_t TFEE       : 1;
  __IO uint32_t TFOE       : 1;
  __IO uint32_t TFUE       : 1;
  __IO uint32_t TFLETE     : 1;
  __IO uint32_t TFMTE      : 1;
  __IO uint32_t TSSRE      : 1;
} stc_hsspi_txe_field_t;

typedef struct stc_hsspi_txc_field
{
  __IO uint32_t TFFC       : 1;
  __IO uint32_t TFEC       : 1;
  __IO uint32_t TFOC       : 1;
  __IO uint32_t TFUC       : 1;
  __IO uint32_t TFLETC     : 1;
  __IO uint32_t TFMTC      : 1;
  __IO uint32_t TSSRC      : 1;
} stc_hsspi_txc_field_t;

typedef struct stc_hsspi_rxf_field
{
  __IO uint32_t RFFS       : 1;
  __IO uint32_t RFES       : 1;
  __IO uint32_t RFOS       : 1;
  __IO uint32_t RFUS       : 1;
  __IO uint32_t RFLETS     : 1;
  __IO uint32_t RFMTS      : 1;
  __IO uint32_t RSSRS      : 1;
} stc_hsspi_rxf_field_t;

typedef struct stc_hsspi_rxe_field
{
  __IO uint32_t RFFE       : 1;
  __IO uint32_t RFEE       : 1;
  __IO uint32_t RFOE       : 1;
  __IO uint32_t RFUE       : 1;
  __IO uint32_t RFLETE     : 1;
  __IO uint32_t RFMTE      : 1;
  __IO uint32_t RSSRE      : 1;
} stc_hsspi_rxe_field_t;

typedef struct stc_hsspi_rxc_field
{
  __IO uint32_t RFFC       : 1;
  __IO uint32_t RFEC       : 1;
  __IO uint32_t RFOC       : 1;
  __IO uint32_t RFUC       : 1;
  __IO uint32_t RFLETC     : 1;
  __IO uint32_t RFMTC      : 1;
  __IO uint32_t RSSRC      : 1;
} stc_hsspi_rxc_field_t;

typedef struct stc_hsspi_faultf_field
{
  __IO uint32_t UMAFS      : 1;
  __IO uint32_t WAFS       : 1;
  __IO uint32_t PVFS       : 1;
  __IO uint32_t DWCBSFS    : 1;
  __IO uint32_t DRCBSFS    : 1;
} stc_hsspi_faultf_field_t;

typedef struct stc_hsspi_faultc_field
{
  __IO uint32_t UMAFC      : 1;
  __IO uint32_t WAFC       : 1;
  __IO uint32_t PVFC       : 1;
  __IO uint32_t DWCBSFC    : 1;
  __IO uint32_t DRCBSFC    : 1;
} stc_hsspi_faultc_field_t;

typedef struct stc_hsspi_dmcfg_field
{
        uint8_t RESERVED1  : 1;
  __IO  uint8_t SSDC       : 1;
} stc_hsspi_dmcfg_field_t;

typedef struct stc_hsspi_dmdmaen_field
{
  __IO  uint8_t RXDMAEN    : 1;
  __IO  uint8_t TXDMAEN    : 1;
} stc_hsspi_dmdmaen_field_t;

typedef struct stc_hsspi_dmstart_field
{
  __IO  uint8_t START      : 1;
} stc_hsspi_dmstart_field_t;

typedef struct stc_hsspi_dmstop_field
{
  __IO  uint8_t STOP       : 1;
} stc_hsspi_dmstop_field_t;

typedef struct stc_hsspi_dmpsel_field
{
  __IO  uint8_t PSEL       : 2;
} stc_hsspi_dmpsel_field_t;

typedef struct stc_hsspi_dmtrp_field
{
  __IO  uint8_t TRP        : 4;
} stc_hsspi_dmtrp_field_t;

typedef struct stc_hsspi_dmbcc_field
{
  __IO uint16_t BCC        : 16;
} stc_hsspi_dmbcc_field_t;

typedef struct stc_hsspi_dmbcs_field
{
  __IO uint16_t BCS        : 16;
} stc_hsspi_dmbcs_field_t;

typedef struct stc_hsspi_dmstatus_field
{
  __IO uint32_t RXACTIVE   : 1;
  __IO uint32_t TXACTIVE   : 1;
       uint32_t RESERVED1  : 6;
  __IO uint32_t RXFLEVEL   : 5;
       uint32_t RESERVED2  : 3;
  __IO uint32_t TXFLEVEL   : 5;
} stc_hsspi_dmstatus_field_t;

typedef struct stc_hsspi_fifocfg_field
{
  __IO uint32_t RXFTH      : 4;
  __IO uint32_t TXFTH      : 4;
  __IO uint32_t FWIDTH     : 2;
  __IO uint32_t TXCTRL     : 1;
  __IO uint32_t RXFLSH     : 1;
  __IO uint32_t TXFLSH     : 1;
} stc_hsspi_fifocfg_field_t;

typedef struct stc_hsspi_txfifo_field
{
  __IO uint32_t TXDATA     : 32;
} stc_hsspi_txfifo_field_t;

typedef struct stc_hsspi_rxfifo_field
{
  __IO uint32_t RXDATA     : 32;
} stc_hsspi_rxfifo_field_t;

typedef struct stc_hsspi_cscfg_field
{
  __IO uint32_t SRAM       : 1;
  __IO uint32_t MBM        : 2;
       uint32_t RESERVED1  : 5;
  __IO uint32_t SSEL0EN    : 1;
  __IO uint32_t SSEL1EN    : 1;
  __IO uint32_t SSEL2EN    : 1;
  __IO uint32_t SSEL3EN    : 1;
       uint32_t RESERVED2  : 4;
  __IO uint32_t MSEL       : 4;
} stc_hsspi_cscfg_field_t;

typedef struct stc_hsspi_csitime_field
{
  __IO uint32_t ITIME      : 16;
} stc_hsspi_csitime_field_t;

typedef struct stc_hsspi_csaext_field
{
       uint32_t RESERVED1  : 13;
  __IO uint32_t AEXT       : 19;
} stc_hsspi_csaext_field_t;

typedef struct stc_hsspi_rdcsdc_field
{
  __IO uint16_t DEC        : 1;
  __IO uint16_t TRP        : 2;
  __IO uint16_t CONT       : 1;
       uint16_t RESERVED1  : 4;
  __IO uint16_t RDCSDATA   : 8;
} stc_hsspi_rdcsdc_field_t;

typedef struct stc_hsspi_wrcsdc_field
{
  __IO uint16_t DEC        : 1;
  __IO uint16_t TRP        : 2;
  __IO uint16_t CONT       : 1;
       uint16_t RESERVED1  : 4;
  __IO uint16_t WRCSDATA   : 8;
} stc_hsspi_wrcsdc_field_t;

typedef struct stc_hsspi_mid_field
{
  __IO uint32_t MID        : 32;
} stc_hsspi_mid_field_t;

typedef struct stc_hsspi_qdclkr_field
{
  __IO  uint8_t QHDIV      : 4;
} stc_hsspi_qdclkr_field_t;

typedef struct stc_hsspi_dbcnt_field
{
  __IO  uint8_t RXDBEN     : 1;
  __IO  uint8_t TXDBEN     : 1;
} stc_hsspi_dbcnt_field_t;

/******************************************************************************
 * Peripheral register structures
 ******************************************************************************/

/******************************************************************************
 * FLASH_IF_MODULE
 ******************************************************************************/
/* FLASH_IF registers */
typedef struct
{
  union {
    __IO uint32_t FASZR;
    stc_flash_if_faszr_field_t FASZR_f;
  };
  union {
    __IO uint32_t FRWTR;
    stc_flash_if_frwtr_field_t FRWTR_f;
  };
  union {
    __IO uint32_t FSTR;
    stc_flash_if_fstr_field_t FSTR_f;
  };
        uint8_t RESERVED1[4];
  union {
    __IO uint32_t FSYNDN;
    stc_flash_if_fsyndn_field_t FSYNDN_f;
  };
  union {
    __IO uint32_t FBFCR;
    stc_flash_if_fbfcr_field_t FBFCR_f;
  };
        uint8_t RESERVED2[8];
  union {
    __IO uint32_t FICR;
    stc_flash_if_ficr_field_t FICR_f;
  };
  union {
    __IO uint32_t FISR;
    stc_flash_if_fisr_field_t FISR_f;
  };
  union {
    __IO uint32_t FICLR;
    stc_flash_if_ficlr_field_t FICLR_f;
  };
        uint8_t RESERVED3[4];
  union {
    __IO uint32_t DFCTRLR;
    stc_flash_if_dfctrlr_field_t DFCTRLR_f;
  };
        uint8_t RESERVED4[204];
  union {
    __IO uint32_t CRTRMM;
    stc_flash_if_crtrmm_field_t CRTRMM_f;
  };
        uint8_t RESERVED5[12];
  union {
    __IO uint32_t FGPDM1;
    stc_flash_if_fgpdm1_field_t FGPDM1_f;
  };
  union {
    __IO uint32_t FGPDM2;
    stc_flash_if_fgpdm2_field_t FGPDM2_f;
  };
  union {
    __IO uint32_t FGPDM3;
    stc_flash_if_fgpdm3_field_t FGPDM3_f;
  };
  union {
    __IO uint32_t FGPDM4;
    stc_flash_if_fgpdm4_field_t FGPDM4_f;
  };
}FM4_FLASH_IF_TypeDef;

