sol4ik/audio-steganography/try/fm4/s6e2cc_i2s_sk-fm4-176l-s6se2cc-v10/common/s6e2cc.h
/******************************************************************************
 * INTREQ_MODULE
 ******************************************************************************/
/* INTREQ registers */
typedef struct
{
  union {
    __IO uint32_t DRQSEL;
    stc_intreq_drqsel_field_t DRQSEL_f;
  };
        uint8_t RESERVED1[12];
  union {
    __IO  uint8_t ODDPKS;
    stc_intreq_oddpks_field_t ODDPKS_f;
  };
        uint8_t RESERVED2[3];
  union {
    __IO  uint8_t ODDPKS1;
    stc_intreq_oddpks1_field_t ODDPKS1_f;
  };
        uint8_t RESERVED3[251];
  union {
    __IO uint32_t IRQ003SEL;
    stc_intreq_irq003sel_field_t IRQ003SEL_f;
  };
  union {
    __IO uint32_t IRQ004SEL;
    stc_intreq_irq004sel_field_t IRQ004SEL_f;
  };
  union {
    __IO uint32_t IRQ005SEL;
    stc_intreq_irq005sel_field_t IRQ005SEL_f;
  };
  union {
    __IO uint32_t IRQ006SEL;
    stc_intreq_irq006sel_field_t IRQ006SEL_f;
  };
  union {
    __IO uint32_t IRQ007SEL;
    stc_intreq_irq007sel_field_t IRQ007SEL_f;
  };
  union {
    __IO uint32_t IRQ008SEL;
    stc_intreq_irq008sel_field_t IRQ008SEL_f;
  };
  union {
    __IO uint32_t IRQ009SEL;
    stc_intreq_irq009sel_field_t IRQ009SEL_f;
  };
  union {
    __IO uint32_t IRQ010SEL;
    stc_intreq_irq010sel_field_t IRQ010SEL_f;
  };
        uint8_t RESERVED4[208];
  union {
    __IO uint32_t EXC02MON;
    stc_intreq_exc02mon_field_t EXC02MON_f;
  };
  union {
    __IO uint32_t IRQ000MON;
    stc_intreq_irq000mon_field_t IRQ000MON_f;
  };
  union {
    __IO uint32_t IRQ001MON;
    stc_intreq_irq001mon_field_t IRQ001MON_f;
  };
  union {
    __IO uint32_t IRQ002MON;
    stc_intreq_irq002mon_field_t IRQ002MON_f;
  };
  union {
    __IO uint32_t IRQ003MON;
    stc_intreq_irq003mon_field_t IRQ003MON_f;
  };
  union {
    __IO uint32_t IRQ004MON;
    stc_intreq_irq004mon_field_t IRQ004MON_f;
  };
  union {
    __IO uint32_t IRQ005MON;
    stc_intreq_irq005mon_field_t IRQ005MON_f;
  };
  union {
    __IO uint32_t IRQ006MON;
    stc_intreq_irq006mon_field_t IRQ006MON_f;
  };
  union {
    __IO uint32_t IRQ007MON;
    stc_intreq_irq007mon_field_t IRQ007MON_f;
  };
  union {
    __IO uint32_t IRQ008MON;
    stc_intreq_irq008mon_field_t IRQ008MON_f;
  };
  union {
    __IO uint32_t IRQ009MON;
    stc_intreq_irq009mon_field_t IRQ009MON_f;
  };
  union {
    __IO uint32_t IRQ010MON;
    stc_intreq_irq010mon_field_t IRQ010MON_f;
  };
  union {
    __IO uint32_t IRQ011MON;
    stc_intreq_irq011mon_field_t IRQ011MON_f;
  };
  union {
    __IO uint32_t IRQ012MON;
    stc_intreq_irq012mon_field_t IRQ012MON_f;
  };
  union {
    __IO uint32_t IRQ013MON;
    stc_intreq_irq013mon_field_t IRQ013MON_f;
  };
  union {
    __IO uint32_t IRQ014MON;
    stc_intreq_irq014mon_field_t IRQ014MON_f;
  };
  union {
    __IO uint32_t IRQ015MON;
    stc_intreq_irq015mon_field_t IRQ015MON_f;
  };
  union {
    __IO uint32_t IRQ016MON;
    stc_intreq_irq016mon_field_t IRQ016MON_f;
  };
  union {
    __IO uint32_t IRQ017MON;
    stc_intreq_irq017mon_field_t IRQ017MON_f;
  };
  union {
    __IO uint32_t IRQ018MON;
    stc_intreq_irq018mon_field_t IRQ018MON_f;
  };
  union {
    __IO uint32_t IRQ019MON;
    stc_intreq_irq019mon_field_t IRQ019MON_f;
  };
  union {
    __IO uint32_t IRQ020MON;
    stc_intreq_irq020mon_field_t IRQ020MON_f;
  };
  union {
    __IO uint32_t IRQ021MON;
    stc_intreq_irq021mon_field_t IRQ021MON_f;
  };
  union {
    __IO uint32_t IRQ022MON;
    stc_intreq_irq022mon_field_t IRQ022MON_f;
  };
  union {
    __IO uint32_t IRQ023MON;
    stc_intreq_irq023mon_field_t IRQ023MON_f;
  };
  union {
    __IO uint32_t IRQ024MON;
    stc_intreq_irq024mon_field_t IRQ024MON_f;
  };
  union {
    __IO uint32_t IRQ025MON;
    stc_intreq_irq025mon_field_t IRQ025MON_f;
  };
  union {
    __IO uint32_t IRQ026MON;
    stc_intreq_irq026mon_field_t IRQ026MON_f;
  };
  union {
    __IO uint32_t IRQ027MON;
    stc_intreq_irq027mon_field_t IRQ027MON_f;
  };
  union {
    __IO uint32_t IRQ028MON;
    stc_intreq_irq028mon_field_t IRQ028MON_f;
  };
  union {
    __IO uint32_t IRQ029MON;
    stc_intreq_irq029mon_field_t IRQ029MON_f;
  };
  union {
    __IO uint32_t IRQ030MON;
    stc_intreq_irq030mon_field_t IRQ030MON_f;
  };
  union {
    __IO uint32_t IRQ031MON;
    stc_intreq_irq031mon_field_t IRQ031MON_f;
  };
  union {
    __IO uint32_t IRQ032MON;
    stc_intreq_irq032mon_field_t IRQ032MON_f;
  };
  union {
    __IO uint32_t IRQ033MON;
    stc_intreq_irq033mon_field_t IRQ033MON_f;
  };
  union {
    __IO uint32_t IRQ034MON;
    stc_intreq_irq034mon_field_t IRQ034MON_f;
  };
  union {
    __IO uint32_t IRQ035MON;
    stc_intreq_irq035mon_field_t IRQ035MON_f;
  };
  union {
    __IO uint32_t IRQ036MON;
    stc_intreq_irq036mon_field_t IRQ036MON_f;
  };
  union {
    __IO uint32_t IRQ037MON;
    stc_intreq_irq037mon_field_t IRQ037MON_f;
  };
  union {
    __IO uint32_t IRQ038MON;
    stc_intreq_irq038mon_field_t IRQ038MON_f;
  };
  union {
    __IO uint32_t IRQ039MON;
    stc_intreq_irq039mon_field_t IRQ039MON_f;
  };
  union {
    __IO uint32_t IRQ040MON;
    stc_intreq_irq040mon_field_t IRQ040MON_f;
  };
  union {
    __IO uint32_t IRQ041MON;
    stc_intreq_irq041mon_field_t IRQ041MON_f;
  };
  union {
    __IO uint32_t IRQ042MON;
    stc_intreq_irq042mon_field_t IRQ042MON_f;
  };
  union {
    __IO uint32_t IRQ043MON;
    stc_intreq_irq043mon_field_t IRQ043MON_f;
  };
  union {
    __IO uint32_t IRQ044MON;
    stc_intreq_irq044mon_field_t IRQ044MON_f;
  };
  union {
    __IO uint32_t IRQ045MON;
    stc_intreq_irq045mon_field_t IRQ045MON_f;
  };
  union {
    __IO uint32_t IRQ046MON;
    stc_intreq_irq046mon_field_t IRQ046MON_f;
  };
  union {
    __IO uint32_t IRQ047MON;
    stc_intreq_irq047mon_field_t IRQ047MON_f;
  };
  union {
    __IO uint32_t IRQ048MON;
    stc_intreq_irq048mon_field_t IRQ048MON_f;
  };
  union {
    __IO uint32_t IRQ049MON;
    stc_intreq_irq049mon_field_t IRQ049MON_f;
  };
  union {
    __IO uint32_t IRQ050MON;
    stc_intreq_irq050mon_field_t IRQ050MON_f;
  };
  union {
    __IO uint32_t IRQ051MON;
    stc_intreq_irq051mon_field_t IRQ051MON_f;
  };
  union {
    __IO uint32_t IRQ052MON;
    stc_intreq_irq052mon_field_t IRQ052MON_f;
  };
  union {
    __IO uint32_t IRQ053MON;
    stc_intreq_irq053mon_field_t IRQ053MON_f;
  };
  union {
    __IO uint32_t IRQ054MON;
    stc_intreq_irq054mon_field_t IRQ054MON_f;
  };
  union {
    __IO uint32_t IRQ055MON;
    stc_intreq_irq055mon_field_t IRQ055MON_f;
  };
  union {
    __IO uint32_t IRQ056MON;
    stc_intreq_irq056mon_field_t IRQ056MON_f;
  };
  union {
    __IO uint32_t IRQ057MON;
    stc_intreq_irq057mon_field_t IRQ057MON_f;
  };
  union {
    __IO uint32_t IRQ058MON;
    stc_intreq_irq058mon_field_t IRQ058MON_f;
  };
  union {
    __IO uint32_t IRQ059MON;
    stc_intreq_irq059mon_field_t IRQ059MON_f;
  };
  union {
    __IO uint32_t IRQ060MON;
    stc_intreq_irq060mon_field_t IRQ060MON_f;
  };
  union {
    __IO uint32_t IRQ061MON;
    stc_intreq_irq061mon_field_t IRQ061MON_f;
  };
  union {
    __IO uint32_t IRQ062MON;
    stc_intreq_irq062mon_field_t IRQ062MON_f;
  };
  union {
    __IO uint32_t IRQ063MON;
    stc_intreq_irq063mon_field_t IRQ063MON_f;
  };
  union {
    __IO uint32_t IRQ064MON;
    stc_intreq_irq064mon_field_t IRQ064MON_f;
  };
  union {
    __IO uint32_t IRQ065MON;
    stc_intreq_irq065mon_field_t IRQ065MON_f;
  };
  union {
    __IO uint32_t IRQ066MON;
    stc_intreq_irq066mon_field_t IRQ066MON_f;
  };
  union {
    __IO uint32_t IRQ067MON;
    stc_intreq_irq067mon_field_t IRQ067MON_f;
  };
  union {
    __IO uint32_t IRQ068MON;
    stc_intreq_irq068mon_field_t IRQ068MON_f;
  };
  union {
    __IO uint32_t IRQ069MON;
    stc_intreq_irq069mon_field_t IRQ069MON_f;
  };
  union {
    __IO uint32_t IRQ070MON;
    stc_intreq_irq070mon_field_t IRQ070MON_f;
  };
  union {
    __IO uint32_t IRQ071MON;
    stc_intreq_irq071mon_field_t IRQ071MON_f;
  };
  union {
    __IO uint32_t IRQ072MON;
    stc_intreq_irq072mon_field_t IRQ072MON_f;
  };
  union {
    __IO uint32_t IRQ073MON;
    stc_intreq_irq073mon_field_t IRQ073MON_f;
  };
  union {
    __IO uint32_t IRQ074MON;
    stc_intreq_irq074mon_field_t IRQ074MON_f;
  };
  union {
    __IO uint32_t IRQ075MON;
    stc_intreq_irq075mon_field_t IRQ075MON_f;
  };
  union {
    __IO uint32_t IRQ076MON;
    stc_intreq_irq076mon_field_t IRQ076MON_f;
  };
  union {
    __IO uint32_t IRQ077MON;
    stc_intreq_irq077mon_field_t IRQ077MON_f;
  };
  union {
    __IO uint32_t IRQ078MON;
    stc_intreq_irq078mon_field_t IRQ078MON_f;
  };
  union {
    __IO uint32_t IRQ079MON;
    stc_intreq_irq079mon_field_t IRQ079MON_f;
  };
  union {
    __IO uint32_t IRQ080MON;
    stc_intreq_irq080mon_field_t IRQ080MON_f;
  };
  union {
    __IO uint32_t IRQ081MON;
    stc_intreq_irq081mon_field_t IRQ081MON_f;
  };
  union {
    __IO uint32_t IRQ082MON;
    stc_intreq_irq082mon_field_t IRQ082MON_f;
  };
  union {
    __IO uint32_t IRQ083MON;
    stc_intreq_irq083mon_field_t IRQ083MON_f;
  };
  union {
    __IO uint32_t IRQ084MON;
    stc_intreq_irq084mon_field_t IRQ084MON_f;
  };
  union {
    __IO uint32_t IRQ085MON;
    stc_intreq_irq085mon_field_t IRQ085MON_f;
  };
  union {
    __IO uint32_t IRQ086MON;
    stc_intreq_irq086mon_field_t IRQ086MON_f;
  };
  union {
    __IO uint32_t IRQ087MON;
    stc_intreq_irq087mon_field_t IRQ087MON_f;
  };
  union {
    __IO uint32_t IRQ088MON;
    stc_intreq_irq088mon_field_t IRQ088MON_f;
  };
  union {
    __IO uint32_t IRQ089MON;
    stc_intreq_irq089mon_field_t IRQ089MON_f;
  };
  union {
    __IO uint32_t IRQ090MON;
    stc_intreq_irq090mon_field_t IRQ090MON_f;
  };
  union {
    __IO uint32_t IRQ091MON;
    stc_intreq_irq091mon_field_t IRQ091MON_f;
  };
  union {
    __IO uint32_t IRQ092MON;
    stc_intreq_irq092mon_field_t IRQ092MON_f;
  };
  union {
    __IO uint32_t IRQ093MON;
    stc_intreq_irq093mon_field_t IRQ093MON_f;
  };
  union {
    __IO uint32_t IRQ094MON;
    stc_intreq_irq094mon_field_t IRQ094MON_f;
  };
  union {
    __IO uint32_t IRQ095MON;
    stc_intreq_irq095mon_field_t IRQ095MON_f;
  };
  union {
    __IO uint32_t IRQ096MON;
    stc_intreq_irq096mon_field_t IRQ096MON_f;
  };
  union {
    __IO uint32_t IRQ097MON;
    stc_intreq_irq097mon_field_t IRQ097MON_f;
  };
  union {
    __IO uint32_t IRQ098MON;
    stc_intreq_irq098mon_field_t IRQ098MON_f;
  };
  union {
    __IO uint32_t IRQ099MON;
    stc_intreq_irq099mon_field_t IRQ099MON_f;
  };
  union {
    __IO uint32_t IRQ100MON;
    stc_intreq_irq100mon_field_t IRQ100MON_f;
  };
  union {
    __IO uint32_t IRQ101MON;
    stc_intreq_irq101mon_field_t IRQ101MON_f;
  };
  union {
    __IO uint32_t IRQ102MON;
    stc_intreq_irq102mon_field_t IRQ102MON_f;
  };
  union {
    __IO uint32_t IRQ103MON;
    stc_intreq_irq103mon_field_t IRQ103MON_f;
  };
  union {
    __IO uint32_t IRQ104MON;
    stc_intreq_irq104mon_field_t IRQ104MON_f;
  };
  union {
    __IO uint32_t IRQ105MON;
    stc_intreq_irq105mon_field_t IRQ105MON_f;
  };
  union {
    __IO uint32_t IRQ106MON;
    stc_intreq_irq106mon_field_t IRQ106MON_f;
  };
  union {
    __IO uint32_t IRQ107MON;
    stc_intreq_irq107mon_field_t IRQ107MON_f;
  };
  union {
    __IO uint32_t IRQ108MON;
    stc_intreq_irq108mon_field_t IRQ108MON_f;
  };
  union {
    __IO uint32_t IRQ109MON;
    stc_intreq_irq109mon_field_t IRQ109MON_f;
  };
  union {
    __IO uint32_t IRQ110MON;
    stc_intreq_irq110mon_field_t IRQ110MON_f;
  };
  union {
    __IO uint32_t IRQ111MON;
    stc_intreq_irq111mon_field_t IRQ111MON_f;
  };
  union {
    __IO uint32_t IRQ112MON;
    stc_intreq_irq112mon_field_t IRQ112MON_f;
  };
  union {
    __IO uint32_t IRQ113MON;
    stc_intreq_irq113mon_field_t IRQ113MON_f;
  };
  union {
    __IO uint32_t IRQ114MON;
    stc_intreq_irq114mon_field_t IRQ114MON_f;
  };
  union {
    __IO uint32_t IRQ115MON;
    stc_intreq_irq115mon_field_t IRQ115MON_f;
  };
  __IO uint32_t IRQ116MON;
  union {
    __IO uint32_t IRQ117MON;
    stc_intreq_irq117mon_field_t IRQ117MON_f;
  };
  union {
    __IO uint32_t IRQ118MON;
    stc_intreq_irq118mon_field_t IRQ118MON_f;
  };
  union {
    __IO uint32_t IRQ119MON;
    stc_intreq_irq119mon_field_t IRQ119MON_f;
  };
  union {
    __IO uint32_t IRQ120MON;
    stc_intreq_irq120mon_field_t IRQ120MON_f;
  };
  union {
    __IO uint32_t IRQ121MON;
    stc_intreq_irq121mon_field_t IRQ121MON_f;
  };
  union {
    __IO uint32_t IRQ122MON;
    stc_intreq_irq122mon_field_t IRQ122MON_f;
  };
  union {
    __IO uint32_t IRQ123MON;
    stc_intreq_irq123mon_field_t IRQ123MON_f;
  };
  union {
    __IO uint32_t IRQ124MON;
    stc_intreq_irq124mon_field_t IRQ124MON_f;
  };
  union {
    __IO uint32_t IRQ125MON;
    stc_intreq_irq125mon_field_t IRQ125MON_f;
  };
  union {
    __IO uint32_t IRQ126MON;
    stc_intreq_irq126mon_field_t IRQ126MON_f;
  };
  union {
    __IO uint32_t IRQ127MON;
    stc_intreq_irq127mon_field_t IRQ127MON_f;
  };
}FM4_INTREQ_TypeDef;

