sol4ik/audio-steganography/try/fm4/s6e2cc_i2s_sk-fm4-176l-s6se2cc-v10/common/s6e2cc.h
/* Multifunction Timer unit 1 Waveform Generator and Noise Canceler registers */
#define bFM4_MFT1_WFG_WFSA10_DCK0              *((volatile unsigned char*)(0x42423480UL))
#define bFM4_MFT1_WFG_WFSA10_DCK1              *((volatile unsigned char*)(0x42423484UL))
#define bFM4_MFT1_WFG_WFSA10_DCK2              *((volatile unsigned char*)(0x42423488UL))
#define bFM4_MFT1_WFG_WFSA10_GTEN0             *((volatile unsigned char*)(0x42423498UL))
#define bFM4_MFT1_WFG_WFSA10_GTEN1             *((volatile unsigned char*)(0x4242349CUL))
#define bFM4_MFT1_WFG_WFSA10_PSEL0             *((volatile unsigned char*)(0x424234A0UL))
#define bFM4_MFT1_WFG_WFSA10_PSEL1             *((volatile unsigned char*)(0x424234A4UL))
#define bFM4_MFT1_WFG_WFSA10_PGEN0             *((volatile unsigned char*)(0x424234A8UL))
#define bFM4_MFT1_WFG_WFSA10_PGEN1             *((volatile unsigned char*)(0x424234ACUL))
#define bFM4_MFT1_WFG_WFSA32_DCK0              *((volatile unsigned char*)(0x42423500UL))
#define bFM4_MFT1_WFG_WFSA32_DCK1              *((volatile unsigned char*)(0x42423504UL))
#define bFM4_MFT1_WFG_WFSA32_DCK2              *((volatile unsigned char*)(0x42423508UL))
#define bFM4_MFT1_WFG_WFSA32_GTEN0             *((volatile unsigned char*)(0x42423518UL))
#define bFM4_MFT1_WFG_WFSA32_GTEN1             *((volatile unsigned char*)(0x4242351CUL))
#define bFM4_MFT1_WFG_WFSA32_PSEL0             *((volatile unsigned char*)(0x42423520UL))
#define bFM4_MFT1_WFG_WFSA32_PSEL1             *((volatile unsigned char*)(0x42423524UL))
#define bFM4_MFT1_WFG_WFSA32_PGEN0             *((volatile unsigned char*)(0x42423528UL))
#define bFM4_MFT1_WFG_WFSA32_PGEN1             *((volatile unsigned char*)(0x4242352CUL))
#define bFM4_MFT1_WFG_WFSA54_DCK0              *((volatile unsigned char*)(0x42423580UL))
#define bFM4_MFT1_WFG_WFSA54_DCK1              *((volatile unsigned char*)(0x42423584UL))
#define bFM4_MFT1_WFG_WFSA54_DCK2              *((volatile unsigned char*)(0x42423588UL))
#define bFM4_MFT1_WFG_WFSA54_GTEN0             *((volatile unsigned char*)(0x42423598UL))
#define bFM4_MFT1_WFG_WFSA54_GTEN1             *((volatile unsigned char*)(0x4242359CUL))
#define bFM4_MFT1_WFG_WFSA54_PSEL0             *((volatile unsigned char*)(0x424235A0UL))
#define bFM4_MFT1_WFG_WFSA54_PSEL1             *((volatile unsigned char*)(0x424235A4UL))
#define bFM4_MFT1_WFG_WFSA54_PGEN0             *((volatile unsigned char*)(0x424235A8UL))
#define bFM4_MFT1_WFG_WFSA54_PGEN1             *((volatile unsigned char*)(0x424235ACUL))
#define bFM4_MFT1_WFG_WFIR_DTIFA               *((volatile unsigned char*)(0x42423600UL))
#define bFM4_MFT1_WFG_WFIR_DTICA               *((volatile unsigned char*)(0x42423604UL))
#define bFM4_MFT1_WFG_WFIR_DTIFB               *((volatile unsigned char*)(0x42423608UL))
#define bFM4_MFT1_WFG_WFIR_DTICB               *((volatile unsigned char*)(0x4242360CUL))
#define bFM4_MFT1_WFG_WFIR_TMIF10              *((volatile unsigned char*)(0x42423610UL))
#define bFM4_MFT1_WFG_WFIR_TMIC10              *((volatile unsigned char*)(0x42423614UL))
#define bFM4_MFT1_WFG_WFIR_TMIE10              *((volatile unsigned char*)(0x42423618UL))
#define bFM4_MFT1_WFG_WFIR_TMIS10              *((volatile unsigned char*)(0x4242361CUL))
#define bFM4_MFT1_WFG_WFIR_TMIF32              *((volatile unsigned char*)(0x42423620UL))
#define bFM4_MFT1_WFG_WFIR_TMIC32              *((volatile unsigned char*)(0x42423624UL))
#define bFM4_MFT1_WFG_WFIR_TMIE32              *((volatile unsigned char*)(0x42423628UL))
#define bFM4_MFT1_WFG_WFIR_TMIS32              *((volatile unsigned char*)(0x4242362CUL))
#define bFM4_MFT1_WFG_WFIR_TMIF54              *((volatile unsigned char*)(0x42423630UL))
#define bFM4_MFT1_WFG_WFIR_TMIC54              *((volatile unsigned char*)(0x42423634UL))
#define bFM4_MFT1_WFG_WFIR_TMIE54              *((volatile unsigned char*)(0x42423638UL))
#define bFM4_MFT1_WFG_WFIR_TMIS54              *((volatile unsigned char*)(0x4242363CUL))
#define bFM4_MFT1_WFG_NZCL_DTIEA               *((volatile unsigned char*)(0x42423680UL))
#define bFM4_MFT1_WFG_NZCL_NWS0                *((volatile unsigned char*)(0x42423684UL))
#define bFM4_MFT1_WFG_NZCL_NWS1                *((volatile unsigned char*)(0x42423688UL))
#define bFM4_MFT1_WFG_NZCL_NWS2                *((volatile unsigned char*)(0x4242368CUL))
#define bFM4_MFT1_WFG_NZCL_SDTI                *((volatile unsigned char*)(0x42423690UL))
#define bFM4_MFT1_WFG_NZCL_DTIEB               *((volatile unsigned char*)(0x42423694UL))
#define bFM4_MFT1_WFG_NZCL_DHOLD               *((volatile unsigned char*)(0x4242369CUL))
#define bFM4_MFT1_WFG_NZCL_DIMA                *((volatile unsigned char*)(0x424236A0UL))
#define bFM4_MFT1_WFG_NZCL_DIMB                *((volatile unsigned char*)(0x424236A4UL))
#define bFM4_MFT1_WFG_NZCL_WIM10               *((volatile unsigned char*)(0x424236B0UL))
#define bFM4_MFT1_WFG_NZCL_WIM32               *((volatile unsigned char*)(0x424236B4UL))
#define bFM4_MFT1_WFG_NZCL_WIM54               *((volatile unsigned char*)(0x424236B8UL))

/* Multifunction Timer unit 1 Input Capture Unit registers */
#define bFM4_MFT1_ICU_ICFS10_FSI00             *((volatile unsigned char*)(0x42422D80UL))
#define bFM4_MFT1_ICU_ICFS10_FSI01             *((volatile unsigned char*)(0x42422D84UL))
#define bFM4_MFT1_ICU_ICFS10_FSI02             *((volatile unsigned char*)(0x42422D88UL))
#define bFM4_MFT1_ICU_ICFS10_FSI03             *((volatile unsigned char*)(0x42422D8CUL))
#define bFM4_MFT1_ICU_ICFS10_FSI10             *((volatile unsigned char*)(0x42422D90UL))
#define bFM4_MFT1_ICU_ICFS10_FSI11             *((volatile unsigned char*)(0x42422D94UL))
#define bFM4_MFT1_ICU_ICFS10_FSI12             *((volatile unsigned char*)(0x42422D98UL))
#define bFM4_MFT1_ICU_ICFS10_FSI13             *((volatile unsigned char*)(0x42422D9CUL))
#define bFM4_MFT1_ICU_ICFS32_FSI00             *((volatile unsigned char*)(0x42422DA0UL))
#define bFM4_MFT1_ICU_ICFS32_FSI01             *((volatile unsigned char*)(0x42422DA4UL))
#define bFM4_MFT1_ICU_ICFS32_FSI02             *((volatile unsigned char*)(0x42422DA8UL))
#define bFM4_MFT1_ICU_ICFS32_FSI03             *((volatile unsigned char*)(0x42422DACUL))
#define bFM4_MFT1_ICU_ICFS32_FSI10             *((volatile unsigned char*)(0x42422DB0UL))
#define bFM4_MFT1_ICU_ICFS32_FSI11             *((volatile unsigned char*)(0x42422DB4UL))
#define bFM4_MFT1_ICU_ICFS32_FSI12             *((volatile unsigned char*)(0x42422DB8UL))
#define bFM4_MFT1_ICU_ICFS32_FSI13             *((volatile unsigned char*)(0x42422DBCUL))
#define bFM4_MFT1_ICU_ICSA10_EG00              *((volatile unsigned char*)(0x42423080UL))
#define bFM4_MFT1_ICU_ICSA10_EG01              *((volatile unsigned char*)(0x42423084UL))
#define bFM4_MFT1_ICU_ICSA10_EG10              *((volatile unsigned char*)(0x42423088UL))
#define bFM4_MFT1_ICU_ICSA10_EG11              *((volatile unsigned char*)(0x4242308CUL))
#define bFM4_MFT1_ICU_ICSA10_ICE0              *((volatile unsigned char*)(0x42423090UL))
#define bFM4_MFT1_ICU_ICSA10_ICE1              *((volatile unsigned char*)(0x42423094UL))
#define bFM4_MFT1_ICU_ICSA10_ICP0              *((volatile unsigned char*)(0x42423098UL))
#define bFM4_MFT1_ICU_ICSA10_ICP1              *((volatile unsigned char*)(0x4242309CUL))
#define bFM4_MFT1_ICU_ICSB10_IEI0              *((volatile unsigned char*)(0x424230A0UL))
#define bFM4_MFT1_ICU_ICSB10_IEI1              *((volatile unsigned char*)(0x424230A4UL))
#define bFM4_MFT1_ICU_ICSA32_EG00              *((volatile unsigned char*)(0x42423100UL))
#define bFM4_MFT1_ICU_ICSA32_EG01              *((volatile unsigned char*)(0x42423104UL))
#define bFM4_MFT1_ICU_ICSA32_EG10              *((volatile unsigned char*)(0x42423108UL))
#define bFM4_MFT1_ICU_ICSA32_EG11              *((volatile unsigned char*)(0x4242310CUL))
#define bFM4_MFT1_ICU_ICSA32_ICE0              *((volatile unsigned char*)(0x42423110UL))
#define bFM4_MFT1_ICU_ICSA32_ICE1              *((volatile unsigned char*)(0x42423114UL))
#define bFM4_MFT1_ICU_ICSA32_ICP0              *((volatile unsigned char*)(0x42423118UL))
#define bFM4_MFT1_ICU_ICSA32_ICP1              *((volatile unsigned char*)(0x4242311CUL))
#define bFM4_MFT1_ICU_ICSB32_IEI0              *((volatile unsigned char*)(0x42423120UL))
#define bFM4_MFT1_ICU_ICSB32_IEI1              *((volatile unsigned char*)(0x42423124UL))

