sol4ik/audio-steganography/try/fm4/s6e2cc_i2s_sk-fm4-176l-s6se2cc-v10/common/s6e2cc.h
#define bFM4_ADC2_ADSS1_TS8                    *((volatile unsigned char*)(0x424E45A0UL))
#define bFM4_ADC2_ADSS1_TS9                    *((volatile unsigned char*)(0x424E45A4UL))
#define bFM4_ADC2_ADSS1_TS10                   *((volatile unsigned char*)(0x424E45A8UL))
#define bFM4_ADC2_ADSS1_TS11                   *((volatile unsigned char*)(0x424E45ACUL))
#define bFM4_ADC2_ADSS1_TS12                   *((volatile unsigned char*)(0x424E45B0UL))
#define bFM4_ADC2_ADSS1_TS13                   *((volatile unsigned char*)(0x424E45B4UL))
#define bFM4_ADC2_ADSS1_TS14                   *((volatile unsigned char*)(0x424E45B8UL))
#define bFM4_ADC2_ADSS1_TS15                   *((volatile unsigned char*)(0x424E45BCUL))
#define bFM4_ADC2_ADST01_ST10                  *((volatile unsigned char*)(0x424E4600UL))
#define bFM4_ADC2_ADST01_ST11                  *((volatile unsigned char*)(0x424E4604UL))
#define bFM4_ADC2_ADST01_ST12                  *((volatile unsigned char*)(0x424E4608UL))
#define bFM4_ADC2_ADST01_ST13                  *((volatile unsigned char*)(0x424E460CUL))
#define bFM4_ADC2_ADST01_ST14                  *((volatile unsigned char*)(0x424E4610UL))
#define bFM4_ADC2_ADST01_STX10                 *((volatile unsigned char*)(0x424E4614UL))
#define bFM4_ADC2_ADST01_STX11                 *((volatile unsigned char*)(0x424E4618UL))
#define bFM4_ADC2_ADST01_STX12                 *((volatile unsigned char*)(0x424E461CUL))
#define bFM4_ADC2_ADST01_ST00                  *((volatile unsigned char*)(0x424E4620UL))
#define bFM4_ADC2_ADST01_ST01                  *((volatile unsigned char*)(0x424E4624UL))
#define bFM4_ADC2_ADST01_ST02                  *((volatile unsigned char*)(0x424E4628UL))
#define bFM4_ADC2_ADST01_ST03                  *((volatile unsigned char*)(0x424E462CUL))
#define bFM4_ADC2_ADST01_ST04                  *((volatile unsigned char*)(0x424E4630UL))
#define bFM4_ADC2_ADST01_STX00                 *((volatile unsigned char*)(0x424E4634UL))
#define bFM4_ADC2_ADST01_STX01                 *((volatile unsigned char*)(0x424E4638UL))
#define bFM4_ADC2_ADST01_STX02                 *((volatile unsigned char*)(0x424E463CUL))
#define bFM4_ADC2_ADST1_ST10                   *((volatile unsigned char*)(0x424E4600UL))
#define bFM4_ADC2_ADST1_ST11                   *((volatile unsigned char*)(0x424E4604UL))
#define bFM4_ADC2_ADST1_ST12                   *((volatile unsigned char*)(0x424E4608UL))
#define bFM4_ADC2_ADST1_ST13                   *((volatile unsigned char*)(0x424E460CUL))
#define bFM4_ADC2_ADST1_ST14                   *((volatile unsigned char*)(0x424E4610UL))
#define bFM4_ADC2_ADST1_STX10                  *((volatile unsigned char*)(0x424E4614UL))
#define bFM4_ADC2_ADST1_STX11                  *((volatile unsigned char*)(0x424E4618UL))
#define bFM4_ADC2_ADST1_STX12                  *((volatile unsigned char*)(0x424E461CUL))
#define bFM4_ADC2_ADST0_ST00                   *((volatile unsigned char*)(0x424E4620UL))
#define bFM4_ADC2_ADST0_ST01                   *((volatile unsigned char*)(0x424E4624UL))
#define bFM4_ADC2_ADST0_ST02                   *((volatile unsigned char*)(0x424E4628UL))
#define bFM4_ADC2_ADST0_ST03                   *((volatile unsigned char*)(0x424E462CUL))
#define bFM4_ADC2_ADST0_ST04                   *((volatile unsigned char*)(0x424E4630UL))
#define bFM4_ADC2_ADST0_STX00                  *((volatile unsigned char*)(0x424E4634UL))
#define bFM4_ADC2_ADST0_STX01                  *((volatile unsigned char*)(0x424E4638UL))
#define bFM4_ADC2_ADST0_STX02                  *((volatile unsigned char*)(0x424E463CUL))
#define bFM4_ADC2_ADCT_CT0                     *((volatile unsigned char*)(0x424E4680UL))
#define bFM4_ADC2_ADCT_CT1                     *((volatile unsigned char*)(0x424E4684UL))
#define bFM4_ADC2_ADCT_CT2                     *((volatile unsigned char*)(0x424E4688UL))
#define bFM4_ADC2_PRTSL_PRTSL0                 *((volatile unsigned char*)(0x424E4700UL))
#define bFM4_ADC2_PRTSL_PRTSL1                 *((volatile unsigned char*)(0x424E4704UL))
#define bFM4_ADC2_PRTSL_PRTSL2                 *((volatile unsigned char*)(0x424E4708UL))
#define bFM4_ADC2_PRTSL_PRTSL3                 *((volatile unsigned char*)(0x424E470CUL))
#define bFM4_ADC2_SCTSL_SCTSL0                 *((volatile unsigned char*)(0x424E4720UL))
#define bFM4_ADC2_SCTSL_SCTSL1                 *((volatile unsigned char*)(0x424E4724UL))
#define bFM4_ADC2_SCTSL_SCTSL2                 *((volatile unsigned char*)(0x424E4728UL))
#define bFM4_ADC2_SCTSL_SCTSL3                 *((volatile unsigned char*)(0x424E472CUL))
#define bFM4_ADC2_ADCEN_ENBL                   *((volatile unsigned char*)(0x424E4780UL))
#define bFM4_ADC2_ADCEN_READY                  *((volatile unsigned char*)(0x424E4784UL))

/* CR trimming registers */
#define bFM4_CRTRIM_MCR_PSR_CSR0               *((volatile unsigned char*)(0x425C0000UL))
#define bFM4_CRTRIM_MCR_PSR_CSR1               *((volatile unsigned char*)(0x425C0004UL))
#define bFM4_CRTRIM_MCR_PSR_CSR2               *((volatile unsigned char*)(0x425C0008UL))
#define bFM4_CRTRIM_MCR_FTRM_TRD0              *((volatile unsigned char*)(0x425C0080UL))
#define bFM4_CRTRIM_MCR_FTRM_TRD1              *((volatile unsigned char*)(0x425C0084UL))
#define bFM4_CRTRIM_MCR_FTRM_TRD2              *((volatile unsigned char*)(0x425C0088UL))
#define bFM4_CRTRIM_MCR_FTRM_TRD3              *((volatile unsigned char*)(0x425C008CUL))
#define bFM4_CRTRIM_MCR_FTRM_TRD4              *((volatile unsigned char*)(0x425C0090UL))
#define bFM4_CRTRIM_MCR_FTRM_TRD5              *((volatile unsigned char*)(0x425C0094UL))
#define bFM4_CRTRIM_MCR_FTRM_TRD6              *((volatile unsigned char*)(0x425C0098UL))
#define bFM4_CRTRIM_MCR_FTRM_TRD7              *((volatile unsigned char*)(0x425C009CUL))
#define bFM4_CRTRIM_MCR_FTRM_TRD8              *((volatile unsigned char*)(0x425C00A0UL))
#define bFM4_CRTRIM_MCR_FTRM_TRD9              *((volatile unsigned char*)(0x425C00A4UL))
#define bFM4_CRTRIM_MCR_TTRM_TRT0              *((volatile unsigned char*)(0x425C0100UL))
#define bFM4_CRTRIM_MCR_TTRM_TRT1              *((volatile unsigned char*)(0x425C0104UL))
#define bFM4_CRTRIM_MCR_TTRM_TRT2              *((volatile unsigned char*)(0x425C0108UL))
#define bFM4_CRTRIM_MCR_TTRM_TRT3              *((volatile unsigned char*)(0x425C010CUL))
#define bFM4_CRTRIM_MCR_TTRM_TRT4              *((volatile unsigned char*)(0x425C0110UL))
#define bFM4_CRTRIM_MCR_RLR_TRMLCK0            *((volatile unsigned int*)(0x425C0180UL))
#define bFM4_CRTRIM_MCR_RLR_TRMLCK1            *((volatile unsigned int*)(0x425C0184UL))
#define bFM4_CRTRIM_MCR_RLR_TRMLCK2            *((volatile unsigned int*)(0x425C0188UL))
#define bFM4_CRTRIM_MCR_RLR_TRMLCK3            *((volatile unsigned int*)(0x425C018CUL))
#define bFM4_CRTRIM_MCR_RLR_TRMLCK4            *((volatile unsigned int*)(0x425C0190UL))
#define bFM4_CRTRIM_MCR_RLR_TRMLCK5            *((volatile unsigned int*)(0x425C0194UL))
#define bFM4_CRTRIM_MCR_RLR_TRMLCK6            *((volatile unsigned int*)(0x425C0198UL))
#define bFM4_CRTRIM_MCR_RLR_TRMLCK7            *((volatile unsigned int*)(0x425C019CUL))
#define bFM4_CRTRIM_MCR_RLR_TRMLCK8            *((volatile unsigned int*)(0x425C01A0UL))
#define bFM4_CRTRIM_MCR_RLR_TRMLCK9            *((volatile unsigned int*)(0x425C01A4UL))
#define bFM4_CRTRIM_MCR_RLR_TRMLCK10           *((volatile unsigned int*)(0x425C01A8UL))
#define bFM4_CRTRIM_MCR_RLR_TRMLCK11           *((volatile unsigned int*)(0x425C01ACUL))
#define bFM4_CRTRIM_MCR_RLR_TRMLCK12           *((volatile unsigned int*)(0x425C01B0UL))
#define bFM4_CRTRIM_MCR_RLR_TRMLCK13           *((volatile unsigned int*)(0x425C01B4UL))
#define bFM4_CRTRIM_MCR_RLR_TRMLCK14           *((volatile unsigned int*)(0x425C01B8UL))
#define bFM4_CRTRIM_MCR_RLR_TRMLCK15           *((volatile unsigned int*)(0x425C01BCUL))
#define bFM4_CRTRIM_MCR_RLR_TRMLCK16           *((volatile unsigned int*)(0x425C01C0UL))
#define bFM4_CRTRIM_MCR_RLR_TRMLCK17           *((volatile unsigned int*)(0x425C01C4UL))
#define bFM4_CRTRIM_MCR_RLR_TRMLCK18           *((volatile unsigned int*)(0x425C01C8UL))
#define bFM4_CRTRIM_MCR_RLR_TRMLCK19           *((volatile unsigned int*)(0x425C01CCUL))
#define bFM4_CRTRIM_MCR_RLR_TRMLCK20           *((volatile unsigned int*)(0x425C01D0UL))
#define bFM4_CRTRIM_MCR_RLR_TRMLCK21           *((volatile unsigned int*)(0x425C01D4UL))
#define bFM4_CRTRIM_MCR_RLR_TRMLCK22           *((volatile unsigned int*)(0x425C01D8UL))
#define bFM4_CRTRIM_MCR_RLR_TRMLCK23           *((volatile unsigned int*)(0x425C01DCUL))
#define bFM4_CRTRIM_MCR_RLR_TRMLCK24           *((volatile unsigned int*)(0x425C01E0UL))
#define bFM4_CRTRIM_MCR_RLR_TRMLCK25           *((volatile unsigned int*)(0x425C01E4UL))
#define bFM4_CRTRIM_MCR_RLR_TRMLCK26           *((volatile unsigned int*)(0x425C01E8UL))
#define bFM4_CRTRIM_MCR_RLR_TRMLCK27           *((volatile unsigned int*)(0x425C01ECUL))
#define bFM4_CRTRIM_MCR_RLR_TRMLCK28           *((volatile unsigned int*)(0x425C01F0UL))
#define bFM4_CRTRIM_MCR_RLR_TRMLCK29           *((volatile unsigned int*)(0x425C01F4UL))
#define bFM4_CRTRIM_MCR_RLR_TRMLCK30           *((volatile unsigned int*)(0x425C01F8UL))
#define bFM4_CRTRIM_MCR_RLR_TRMLCK31           *((volatile unsigned int*)(0x425C01FCUL))

