sol4ik/audio-steganography/try/fm4/s6e2cc_i2s_sk-fm4-176l-s6se2cc-v10/common/s6e2cc.h
#define bFM4_GPIO_EPFR23_SCS60E1               *((volatile unsigned char*)(0x42DECB84UL))
#define bFM4_GPIO_EPFR23_SCS61E0               *((volatile unsigned char*)(0x42DECB88UL))
#define bFM4_GPIO_EPFR23_SCS61E1               *((volatile unsigned char*)(0x42DECB8CUL))
#define bFM4_GPIO_EPFR23_SCS62E0               *((volatile unsigned char*)(0x42DECB90UL))
#define bFM4_GPIO_EPFR23_SCS62E1               *((volatile unsigned char*)(0x42DECB94UL))
#define bFM4_GPIO_EPFR23_SCS63E0               *((volatile unsigned char*)(0x42DECB98UL))
#define bFM4_GPIO_EPFR23_SCS63E1               *((volatile unsigned char*)(0x42DECB9CUL))
#define bFM4_GPIO_EPFR23_SCS70E0               *((volatile unsigned char*)(0x42DECBA0UL))
#define bFM4_GPIO_EPFR23_SCS70E1               *((volatile unsigned char*)(0x42DECBA4UL))
#define bFM4_GPIO_EPFR23_SCS71E0               *((volatile unsigned char*)(0x42DECBA8UL))
#define bFM4_GPIO_EPFR23_SCS71E1               *((volatile unsigned char*)(0x42DECBACUL))
#define bFM4_GPIO_EPFR23_SCS72E0               *((volatile unsigned char*)(0x42DECBB0UL))
#define bFM4_GPIO_EPFR23_SCS72E1               *((volatile unsigned char*)(0x42DECBB4UL))
#define bFM4_GPIO_EPFR23_SCS73E0               *((volatile unsigned char*)(0x42DECBB8UL))
#define bFM4_GPIO_EPFR23_SCS73E1               *((volatile unsigned char*)(0x42DECBBCUL))
#define bFM4_GPIO_EPFR24_I2SM4_MCLK0S0         *((volatile unsigned char*)(0x42DECC00UL))
#define bFM4_GPIO_EPFR24_I2SM4_MCLK0S1         *((volatile unsigned char*)(0x42DECC04UL))
#define bFM4_GPIO_EPFR24_I2SM4_MCLK0E0         *((volatile unsigned char*)(0x42DECC08UL))
#define bFM4_GPIO_EPFR24_I2SM4_MCLK0E1         *((volatile unsigned char*)(0x42DECC0CUL))
#define bFM4_GPIO_EPFR24_I2SM4_SCK0B0          *((volatile unsigned char*)(0x42DECC10UL))
#define bFM4_GPIO_EPFR24_I2SM4_SCK0B1          *((volatile unsigned char*)(0x42DECC14UL))
#define bFM4_GPIO_EPFR24_I2SM4_WS0B0           *((volatile unsigned char*)(0x42DECC18UL))
#define bFM4_GPIO_EPFR24_I2SM4_WS0B1           *((volatile unsigned char*)(0x42DECC1CUL))
#define bFM4_GPIO_EPFR24_I2SM4_SDI0S0          *((volatile unsigned char*)(0x42DECC20UL))
#define bFM4_GPIO_EPFR24_I2SM4_SDI0S1          *((volatile unsigned char*)(0x42DECC24UL))
#define bFM4_GPIO_EPFR24_I2SM4_SDO0E0          *((volatile unsigned char*)(0x42DECC28UL))
#define bFM4_GPIO_EPFR24_I2SM4_SDO0E1          *((volatile unsigned char*)(0x42DECC2CUL))
#define bFM4_GPIO_EPFR25_MCRX2S0               *((volatile unsigned char*)(0x42DECC80UL))
#define bFM4_GPIO_EPFR25_MCRX2S1               *((volatile unsigned char*)(0x42DECC84UL))
#define bFM4_GPIO_EPFR25_MCTX2E0               *((volatile unsigned char*)(0x42DECC88UL))
#define bFM4_GPIO_EPFR25_MCTX2E1               *((volatile unsigned char*)(0x42DECC8CUL))
#define bFM4_GPIO_EPFR26_Q_SCKE0               *((volatile unsigned char*)(0x42DECD00UL))
#define bFM4_GPIO_EPFR26_Q_SCKE1               *((volatile unsigned char*)(0x42DECD04UL))
#define bFM4_GPIO_EPFR26_Q_CS0E0               *((volatile unsigned char*)(0x42DECD08UL))
#define bFM4_GPIO_EPFR26_Q_CS0E1               *((volatile unsigned char*)(0x42DECD0CUL))
#define bFM4_GPIO_EPFR26_Q_CS1E0               *((volatile unsigned char*)(0x42DECD10UL))
#define bFM4_GPIO_EPFR26_Q_CS1E1               *((volatile unsigned char*)(0x42DECD14UL))
#define bFM4_GPIO_EPFR26_Q_CS2E0               *((volatile unsigned char*)(0x42DECD18UL))
#define bFM4_GPIO_EPFR26_Q_CS2E1               *((volatile unsigned char*)(0x42DECD1CUL))
#define bFM4_GPIO_EPFR26_Q_CS3E0               *((volatile unsigned char*)(0x42DECD20UL))
#define bFM4_GPIO_EPFR26_Q_CS3E1               *((volatile unsigned char*)(0x42DECD24UL))
#define bFM4_GPIO_EPFR26_Q_IO0B0               *((volatile unsigned char*)(0x42DECD28UL))
#define bFM4_GPIO_EPFR26_Q_IO0B1               *((volatile unsigned char*)(0x42DECD2CUL))
#define bFM4_GPIO_EPFR26_Q_IO1B0               *((volatile unsigned char*)(0x42DECD30UL))
#define bFM4_GPIO_EPFR26_Q_IO1B1               *((volatile unsigned char*)(0x42DECD34UL))
#define bFM4_GPIO_EPFR26_Q_IO2B0               *((volatile unsigned char*)(0x42DECD38UL))
#define bFM4_GPIO_EPFR26_Q_IO2B1               *((volatile unsigned char*)(0x42DECD3CUL))
#define bFM4_GPIO_EPFR26_Q_IO3B0               *((volatile unsigned char*)(0x42DECD40UL))
#define bFM4_GPIO_EPFR26_Q_IO3B1               *((volatile unsigned char*)(0x42DECD44UL))
#define bFM4_GPIO_PZR0_P0                      *((volatile unsigned char*)(0x42DEE000UL))
#define bFM4_GPIO_PZR0_P1                      *((volatile unsigned char*)(0x42DEE004UL))
#define bFM4_GPIO_PZR0_P2                      *((volatile unsigned char*)(0x42DEE008UL))
#define bFM4_GPIO_PZR0_P3                      *((volatile unsigned char*)(0x42DEE00CUL))
#define bFM4_GPIO_PZR0_P4                      *((volatile unsigned char*)(0x42DEE010UL))
#define bFM4_GPIO_PZR0_P5                      *((volatile unsigned char*)(0x42DEE014UL))
#define bFM4_GPIO_PZR0_P6                      *((volatile unsigned char*)(0x42DEE018UL))
#define bFM4_GPIO_PZR0_P7                      *((volatile unsigned char*)(0x42DEE01CUL))
#define bFM4_GPIO_PZR0_P8                      *((volatile unsigned char*)(0x42DEE020UL))
#define bFM4_GPIO_PZR0_P9                      *((volatile unsigned char*)(0x42DEE024UL))
#define bFM4_GPIO_PZR0_PA                      *((volatile unsigned char*)(0x42DEE028UL))
#define bFM4_GPIO_PZR0_PB                      *((volatile unsigned char*)(0x42DEE02CUL))
#define bFM4_GPIO_PZR0_PC                      *((volatile unsigned char*)(0x42DEE030UL))
#define bFM4_GPIO_PZR0_PD                      *((volatile unsigned char*)(0x42DEE034UL))
#define bFM4_GPIO_PZR0_PE                      *((volatile unsigned char*)(0x42DEE038UL))
#define bFM4_GPIO_PZR1_P0                      *((volatile unsigned char*)(0x42DEE080UL))
#define bFM4_GPIO_PZR1_P1                      *((volatile unsigned char*)(0x42DEE084UL))
#define bFM4_GPIO_PZR1_P2                      *((volatile unsigned char*)(0x42DEE088UL))
#define bFM4_GPIO_PZR1_P3                      *((volatile unsigned char*)(0x42DEE08CUL))
#define bFM4_GPIO_PZR1_P4                      *((volatile unsigned char*)(0x42DEE090UL))
#define bFM4_GPIO_PZR1_P5                      *((volatile unsigned char*)(0x42DEE094UL))
#define bFM4_GPIO_PZR1_P6                      *((volatile unsigned char*)(0x42DEE098UL))
#define bFM4_GPIO_PZR1_P7                      *((volatile unsigned char*)(0x42DEE09CUL))
#define bFM4_GPIO_PZR1_P8                      *((volatile unsigned char*)(0x42DEE0A0UL))
#define bFM4_GPIO_PZR1_P9                      *((volatile unsigned char*)(0x42DEE0A4UL))
#define bFM4_GPIO_PZR1_PA                      *((volatile unsigned char*)(0x42DEE0A8UL))
#define bFM4_GPIO_PZR1_PB                      *((volatile unsigned char*)(0x42DEE0ACUL))
#define bFM4_GPIO_PZR1_PC                      *((volatile unsigned char*)(0x42DEE0B0UL))
#define bFM4_GPIO_PZR1_PD                      *((volatile unsigned char*)(0x42DEE0B4UL))
#define bFM4_GPIO_PZR1_PE                      *((volatile unsigned char*)(0x42DEE0B8UL))
#define bFM4_GPIO_PZR1_PF                      *((volatile unsigned char*)(0x42DEE0BCUL))
#define bFM4_GPIO_PZR2_P0                      *((volatile unsigned char*)(0x42DEE100UL))
#define bFM4_GPIO_PZR2_P1                      *((volatile unsigned char*)(0x42DEE104UL))
#define bFM4_GPIO_PZR2_P2                      *((volatile unsigned char*)(0x42DEE108UL))
#define bFM4_GPIO_PZR2_P3                      *((volatile unsigned char*)(0x42DEE10CUL))
#define bFM4_GPIO_PZR2_P4                      *((volatile unsigned char*)(0x42DEE110UL))
#define bFM4_GPIO_PZR2_P5                      *((volatile unsigned char*)(0x42DEE114UL))
#define bFM4_GPIO_PZR2_P6                      *((volatile unsigned char*)(0x42DEE118UL))
#define bFM4_GPIO_PZR2_P7                      *((volatile unsigned char*)(0x42DEE11CUL))
#define bFM4_GPIO_PZR2_P8                      *((volatile unsigned char*)(0x42DEE120UL))
#define bFM4_GPIO_PZR2_P9                      *((volatile unsigned char*)(0x42DEE124UL))
#define bFM4_GPIO_PZR2_PA                      *((volatile unsigned char*)(0x42DEE128UL))
#define bFM4_GPIO_PZR3_P0                      *((volatile unsigned char*)(0x42DEE180UL))
#define bFM4_GPIO_PZR3_P1                      *((volatile unsigned char*)(0x42DEE184UL))
#define bFM4_GPIO_PZR3_P2                      *((volatile unsigned char*)(0x42DEE188UL))
#define bFM4_GPIO_PZR3_P3                      *((volatile unsigned char*)(0x42DEE18CUL))
#define bFM4_GPIO_PZR3_P4                      *((volatile unsigned char*)(0x42DEE190UL))
#define bFM4_GPIO_PZR3_P5                      *((volatile unsigned char*)(0x42DEE194UL))
#define bFM4_GPIO_PZR3_P6                      *((volatile unsigned char*)(0x42DEE198UL))
#define bFM4_GPIO_PZR3_P7                      *((volatile unsigned char*)(0x42DEE19CUL))
#define bFM4_GPIO_PZR3_P8                      *((volatile unsigned char*)(0x42DEE1A0UL))
#define bFM4_GPIO_PZR3_P9                      *((volatile unsigned char*)(0x42DEE1A4UL))
#define bFM4_GPIO_PZR3_PA                      *((volatile unsigned char*)(0x42DEE1A8UL))
#define bFM4_GPIO_PZR3_PB                      *((volatile unsigned char*)(0x42DEE1ACUL))
#define bFM4_GPIO_PZR3_PC                      *((volatile unsigned char*)(0x42DEE1B0UL))
#define bFM4_GPIO_PZR3_PD                      *((volatile unsigned char*)(0x42DEE1B4UL))
#define bFM4_GPIO_PZR3_PE                      *((volatile unsigned char*)(0x42DEE1B8UL))
#define bFM4_GPIO_PZR4_P0                      *((volatile unsigned char*)(0x42DEE200UL))
#define bFM4_GPIO_PZR4_P1                      *((volatile unsigned char*)(0x42DEE204UL))
#define bFM4_GPIO_PZR4_P2                      *((volatile unsigned char*)(0x42DEE208UL))
#define bFM4_GPIO_PZR4_P3                      *((volatile unsigned char*)(0x42DEE20CUL))
#define bFM4_GPIO_PZR4_P4                      *((volatile unsigned char*)(0x42DEE210UL))
#define bFM4_GPIO_PZR4_P5                      *((volatile unsigned char*)(0x42DEE214UL))
#define bFM4_GPIO_PZR4_P6                      *((volatile unsigned char*)(0x42DEE218UL))
#define bFM4_GPIO_PZR4_P7                      *((volatile unsigned char*)(0x42DEE21CUL))
#define bFM4_GPIO_PZR4_P8                      *((volatile unsigned char*)(0x42DEE220UL))
#define bFM4_GPIO_PZR4_P9                      *((volatile unsigned char*)(0x42DEE224UL))
#define bFM4_GPIO_PZR4_PA                      *((volatile unsigned char*)(0x42DEE228UL))
#define bFM4_GPIO_PZR4_PB                      *((volatile unsigned char*)(0x42DEE22CUL))
#define bFM4_GPIO_PZR4_PC                      *((volatile unsigned char*)(0x42DEE230UL))
#define bFM4_GPIO_PZR4_PD                      *((volatile unsigned char*)(0x42DEE234UL))
#define bFM4_GPIO_PZR4_PE                      *((volatile unsigned char*)(0x42DEE238UL))
#define bFM4_GPIO_PZR5_P0                      *((volatile unsigned char*)(0x42DEE280UL))
#define bFM4_GPIO_PZR5_P1                      *((volatile unsigned char*)(0x42DEE284UL))
#define bFM4_GPIO_PZR5_P2                      *((volatile unsigned char*)(0x42DEE288UL))
#define bFM4_GPIO_PZR5_P3                      *((volatile unsigned char*)(0x42DEE28CUL))
#define bFM4_GPIO_PZR5_P4                      *((volatile unsigned char*)(0x42DEE290UL))
#define bFM4_GPIO_PZR5_P5                      *((volatile unsigned char*)(0x42DEE294UL))
#define bFM4_GPIO_PZR5_P6                      *((volatile unsigned char*)(0x42DEE298UL))
#define bFM4_GPIO_PZR5_P7                      *((volatile unsigned char*)(0x42DEE29CUL))
#define bFM4_GPIO_PZR5_P8                      *((volatile unsigned char*)(0x42DEE2A0UL))
#define bFM4_GPIO_PZR5_P9                      *((volatile unsigned char*)(0x42DEE2A4UL))
#define bFM4_GPIO_PZR5_PA                      *((volatile unsigned char*)(0x42DEE2A8UL))
#define bFM4_GPIO_PZR5_PB                      *((volatile unsigned char*)(0x42DEE2ACUL))
#define bFM4_GPIO_PZR5_PC                      *((volatile unsigned char*)(0x42DEE2B0UL))
#define bFM4_GPIO_PZR5_PD                      *((volatile unsigned char*)(0x42DEE2B4UL))
#define bFM4_GPIO_PZR5_PE                      *((volatile unsigned char*)(0x42DEE2B8UL))
#define bFM4_GPIO_PZR5_PF                      *((volatile unsigned char*)(0x42DEE2BCUL))
#define bFM4_GPIO_PZR6_P0                      *((volatile unsigned char*)(0x42DEE300UL))
#define bFM4_GPIO_PZR6_P1                      *((volatile unsigned char*)(0x42DEE304UL))
#define bFM4_GPIO_PZR6_P2                      *((volatile unsigned char*)(0x42DEE308UL))
#define bFM4_GPIO_PZR6_P3                      *((volatile unsigned char*)(0x42DEE30CUL))
#define bFM4_GPIO_PZR6_P4                      *((volatile unsigned char*)(0x42DEE310UL))
#define bFM4_GPIO_PZR6_P5                      *((volatile unsigned char*)(0x42DEE314UL))
#define bFM4_GPIO_PZR6_P6                      *((volatile unsigned char*)(0x42DEE318UL))
#define bFM4_GPIO_PZR6_P7                      *((volatile unsigned char*)(0x42DEE31CUL))
#define bFM4_GPIO_PZR6_P8                      *((volatile unsigned char*)(0x42DEE320UL))
#define bFM4_GPIO_PZR6_P9                      *((volatile unsigned char*)(0x42DEE324UL))
#define bFM4_GPIO_PZR6_PA                      *((volatile unsigned char*)(0x42DEE328UL))
#define bFM4_GPIO_PZR6_PB                      *((volatile unsigned char*)(0x42DEE32CUL))
#define bFM4_GPIO_PZR6_PC                      *((volatile unsigned char*)(0x42DEE330UL))
#define bFM4_GPIO_PZR6_PD                      *((volatile unsigned char*)(0x42DEE334UL))
#define bFM4_GPIO_PZR6_PE                      *((volatile unsigned char*)(0x42DEE338UL))
#define bFM4_GPIO_PZR7_P0                      *((volatile unsigned char*)(0x42DEE380UL))
#define bFM4_GPIO_PZR7_P1                      *((volatile unsigned char*)(0x42DEE384UL))
#define bFM4_GPIO_PZR7_P2                      *((volatile unsigned char*)(0x42DEE388UL))
#define bFM4_GPIO_PZR7_P3                      *((volatile unsigned char*)(0x42DEE38CUL))
#define bFM4_GPIO_PZR7_P4                      *((volatile unsigned char*)(0x42DEE390UL))
#define bFM4_GPIO_PZR7_P5                      *((volatile unsigned char*)(0x42DEE394UL))
#define bFM4_GPIO_PZR7_P6                      *((volatile unsigned char*)(0x42DEE398UL))
#define bFM4_GPIO_PZR7_P7                      *((volatile unsigned char*)(0x42DEE39CUL))
#define bFM4_GPIO_PZR7_P8                      *((volatile unsigned char*)(0x42DEE3A0UL))
#define bFM4_GPIO_PZR7_P9                      *((volatile unsigned char*)(0x42DEE3A4UL))
#define bFM4_GPIO_PZR7_PA                      *((volatile unsigned char*)(0x42DEE3A8UL))
#define bFM4_GPIO_PZR7_PB                      *((volatile unsigned char*)(0x42DEE3ACUL))
#define bFM4_GPIO_PZR7_PC                      *((volatile unsigned char*)(0x42DEE3B0UL))
#define bFM4_GPIO_PZR7_PD                      *((volatile unsigned char*)(0x42DEE3B4UL))
#define bFM4_GPIO_PZR7_PE                      *((volatile unsigned char*)(0x42DEE3B8UL))
#define bFM4_GPIO_PZR8_P0                      *((volatile unsigned char*)(0x42DEE400UL))
#define bFM4_GPIO_PZR8_P1                      *((volatile unsigned char*)(0x42DEE404UL))
#define bFM4_GPIO_PZR8_P2                      *((volatile unsigned char*)(0x42DEE408UL))
#define bFM4_GPIO_PZR8_P3                      *((volatile unsigned char*)(0x42DEE40CUL))
#define bFM4_GPIO_PZR9_P0                      *((volatile unsigned char*)(0x42DEE480UL))
#define bFM4_GPIO_PZR9_P1                      *((volatile unsigned char*)(0x42DEE484UL))
#define bFM4_GPIO_PZR9_P2                      *((volatile unsigned char*)(0x42DEE488UL))
#define bFM4_GPIO_PZR9_P3                      *((volatile unsigned char*)(0x42DEE48CUL))
#define bFM4_GPIO_PZR9_P4                      *((volatile unsigned char*)(0x42DEE490UL))
#define bFM4_GPIO_PZR9_P5                      *((volatile unsigned char*)(0x42DEE494UL))
#define bFM4_GPIO_PZR9_P6                      *((volatile unsigned char*)(0x42DEE498UL))
#define bFM4_GPIO_PZR9_P7                      *((volatile unsigned char*)(0x42DEE49CUL))
#define bFM4_GPIO_PZRA_P0                      *((volatile unsigned char*)(0x42DEE500UL))
#define bFM4_GPIO_PZRA_P1                      *((volatile unsigned char*)(0x42DEE504UL))
#define bFM4_GPIO_PZRA_P2                      *((volatile unsigned char*)(0x42DEE508UL))
#define bFM4_GPIO_PZRA_P3                      *((volatile unsigned char*)(0x42DEE50CUL))
#define bFM4_GPIO_PZRA_P4                      *((volatile unsigned char*)(0x42DEE510UL))
#define bFM4_GPIO_PZRA_P5                      *((volatile unsigned char*)(0x42DEE514UL))
#define bFM4_GPIO_PZRA_P6                      *((volatile unsigned char*)(0x42DEE518UL))
#define bFM4_GPIO_PZRA_P7                      *((volatile unsigned char*)(0x42DEE51CUL))
#define bFM4_GPIO_PZRA_P8                      *((volatile unsigned char*)(0x42DEE520UL))
#define bFM4_GPIO_PZRA_P9                      *((volatile unsigned char*)(0x42DEE524UL))
#define bFM4_GPIO_PZRA_PA                      *((volatile unsigned char*)(0x42DEE528UL))
#define bFM4_GPIO_PZRA_PB                      *((volatile unsigned char*)(0x42DEE52CUL))
#define bFM4_GPIO_PZRA_PC                      *((volatile unsigned char*)(0x42DEE530UL))
#define bFM4_GPIO_PZRA_PD                      *((volatile unsigned char*)(0x42DEE534UL))
#define bFM4_GPIO_PZRA_PE                      *((volatile unsigned char*)(0x42DEE538UL))
#define bFM4_GPIO_PZRA_PF                      *((volatile unsigned char*)(0x42DEE53CUL))
#define bFM4_GPIO_PZRB_P0                      *((volatile unsigned char*)(0x42DEE580UL))
#define bFM4_GPIO_PZRB_P1                      *((volatile unsigned char*)(0x42DEE584UL))
#define bFM4_GPIO_PZRB_P2                      *((volatile unsigned char*)(0x42DEE588UL))
#define bFM4_GPIO_PZRB_P3                      *((volatile unsigned char*)(0x42DEE58CUL))
#define bFM4_GPIO_PZRB_P4                      *((volatile unsigned char*)(0x42DEE590UL))
#define bFM4_GPIO_PZRB_P5                      *((volatile unsigned char*)(0x42DEE594UL))
#define bFM4_GPIO_PZRB_P6                      *((volatile unsigned char*)(0x42DEE598UL))
#define bFM4_GPIO_PZRB_P7                      *((volatile unsigned char*)(0x42DEE59CUL))
#define bFM4_GPIO_PZRB_P8                      *((volatile unsigned char*)(0x42DEE5A0UL))
#define bFM4_GPIO_PZRB_P9                      *((volatile unsigned char*)(0x42DEE5A4UL))
#define bFM4_GPIO_PZRB_PA                      *((volatile unsigned char*)(0x42DEE5A8UL))
#define bFM4_GPIO_PZRB_PB                      *((volatile unsigned char*)(0x42DEE5ACUL))
#define bFM4_GPIO_PZRB_PC                      *((volatile unsigned char*)(0x42DEE5B0UL))
#define bFM4_GPIO_PZRB_PD                      *((volatile unsigned char*)(0x42DEE5B4UL))
#define bFM4_GPIO_PZRB_PE                      *((volatile unsigned char*)(0x42DEE5B8UL))
#define bFM4_GPIO_PZRB_PF                      *((volatile unsigned char*)(0x42DEE5BCUL))
#define bFM4_GPIO_PZRC_P0                      *((volatile unsigned char*)(0x42DEE600UL))
#define bFM4_GPIO_PZRC_P1                      *((volatile unsigned char*)(0x42DEE604UL))
#define bFM4_GPIO_PZRC_P2                      *((volatile unsigned char*)(0x42DEE608UL))
#define bFM4_GPIO_PZRC_P3                      *((volatile unsigned char*)(0x42DEE60CUL))
#define bFM4_GPIO_PZRC_P4                      *((volatile unsigned char*)(0x42DEE610UL))
#define bFM4_GPIO_PZRC_P5                      *((volatile unsigned char*)(0x42DEE614UL))
#define bFM4_GPIO_PZRC_P6                      *((volatile unsigned char*)(0x42DEE618UL))
#define bFM4_GPIO_PZRC_P7                      *((volatile unsigned char*)(0x42DEE61CUL))
#define bFM4_GPIO_PZRC_P8                      *((volatile unsigned char*)(0x42DEE620UL))
#define bFM4_GPIO_PZRC_P9                      *((volatile unsigned char*)(0x42DEE624UL))
#define bFM4_GPIO_PZRC_PA                      *((volatile unsigned char*)(0x42DEE628UL))
#define bFM4_GPIO_PZRC_PB                      *((volatile unsigned char*)(0x42DEE62CUL))
#define bFM4_GPIO_PZRC_PC                      *((volatile unsigned char*)(0x42DEE630UL))
#define bFM4_GPIO_PZRC_PD                      *((volatile unsigned char*)(0x42DEE634UL))
#define bFM4_GPIO_PZRC_PE                      *((volatile unsigned char*)(0x42DEE638UL))
#define bFM4_GPIO_PZRC_PF                      *((volatile unsigned char*)(0x42DEE63CUL))
#define bFM4_GPIO_PZRD_P0                      *((volatile unsigned char*)(0x42DEE680UL))
#define bFM4_GPIO_PZRD_P1                      *((volatile unsigned char*)(0x42DEE684UL))
#define bFM4_GPIO_PZRD_P2                      *((volatile unsigned char*)(0x42DEE688UL))
#define bFM4_GPIO_PZRE_P0                      *((volatile unsigned char*)(0x42DEE700UL))
#define bFM4_GPIO_PZRE_P2                      *((volatile unsigned char*)(0x42DEE708UL))
#define bFM4_GPIO_PZRE_P3                      *((volatile unsigned char*)(0x42DEE70CUL))
#define bFM4_GPIO_PZRF_P0                      *((volatile unsigned char*)(0x42DEE780UL))
#define bFM4_GPIO_PZRF_P1                      *((volatile unsigned char*)(0x42DEE784UL))
#define bFM4_GPIO_PZRF_P2                      *((volatile unsigned char*)(0x42DEE788UL))
#define bFM4_GPIO_PZRF_P3                      *((volatile unsigned char*)(0x42DEE78CUL))
#define bFM4_GPIO_PZRF_P4                      *((volatile unsigned char*)(0x42DEE790UL))
#define bFM4_GPIO_PZRF_P5                      *((volatile unsigned char*)(0x42DEE794UL))
#define bFM4_GPIO_PZRF_P6                      *((volatile unsigned char*)(0x42DEE798UL))
#define bFM4_GPIO_PZRF_P7                      *((volatile unsigned char*)(0x42DEE79CUL))
#define bFM4_GPIO_PZRF_P8                      *((volatile unsigned char*)(0x42DEE7A0UL))
#define bFM4_GPIO_PZRF_P9                      *((volatile unsigned char*)(0x42DEE7A4UL))
#define bFM4_GPIO_PZRF_PA                      *((volatile unsigned char*)(0x42DEE7A8UL))
#define bFM4_GPIO_PZRF_PB                      *((volatile unsigned char*)(0x42DEE7ACUL))
#define bFM4_GPIO_PZRF_PC                      *((volatile unsigned char*)(0x42DEE7B0UL))
#define bFM4_GPIO_PDSR0_P0                     *((volatile unsigned char*)(0x42DEE800UL))
#define bFM4_GPIO_PDSR0_P1                     *((volatile unsigned char*)(0x42DEE804UL))
#define bFM4_GPIO_PDSR0_P2                     *((volatile unsigned char*)(0x42DEE808UL))
#define bFM4_GPIO_PDSR0_P3                     *((volatile unsigned char*)(0x42DEE80CUL))
#define bFM4_GPIO_PDSR0_P4                     *((volatile unsigned char*)(0x42DEE810UL))
#define bFM4_GPIO_PDSR0_P5                     *((volatile unsigned char*)(0x42DEE814UL))
#define bFM4_GPIO_PDSR0_P6                     *((volatile unsigned char*)(0x42DEE818UL))
#define bFM4_GPIO_PDSR0_P7                     *((volatile unsigned char*)(0x42DEE81CUL))
#define bFM4_GPIO_PDSR0_P8                     *((volatile unsigned char*)(0x42DEE820UL))
#define bFM4_GPIO_PDSR0_P9                     *((volatile unsigned char*)(0x42DEE824UL))
#define bFM4_GPIO_PDSR0_PA                     *((volatile unsigned char*)(0x42DEE828UL))
#define bFM4_GPIO_PDSR0_PB                     *((volatile unsigned char*)(0x42DEE82CUL))
#define bFM4_GPIO_PDSR0_PC                     *((volatile unsigned char*)(0x42DEE830UL))
#define bFM4_GPIO_PDSR0_PD                     *((volatile unsigned char*)(0x42DEE834UL))
#define bFM4_GPIO_PDSR0_PE                     *((volatile unsigned char*)(0x42DEE838UL))
#define bFM4_GPIO_PDSR1_P0                     *((volatile unsigned char*)(0x42DEE880UL))
#define bFM4_GPIO_PDSR1_P1                     *((volatile unsigned char*)(0x42DEE884UL))
