sol4ik/audio-steganography/try/fm4/s6e2cc_i2s_sk-fm4-176l-s6se2cc-v10/common/s6e2cc.h
/* MFS LIN channel 1 registers */
#define bFM4_MFS1_LIN_SMR_SOE                  *((volatile unsigned char*)(0x42702000UL))
#define bFM4_MFS1_LIN_SMR_SBL                  *((volatile unsigned char*)(0x4270200CUL))
#define bFM4_MFS1_LIN_SMR_WUCR                 *((volatile unsigned char*)(0x42702010UL))
#define bFM4_MFS1_LIN_SMR_MD0                  *((volatile unsigned char*)(0x42702014UL))
#define bFM4_MFS1_LIN_SMR_MD1                  *((volatile unsigned char*)(0x42702018UL))
#define bFM4_MFS1_LIN_SMR_MD2                  *((volatile unsigned char*)(0x4270201CUL))
#define bFM4_MFS1_LIN_SCR_TXE                  *((volatile unsigned char*)(0x42702020UL))
#define bFM4_MFS1_LIN_SCR_RXE                  *((volatile unsigned char*)(0x42702024UL))
#define bFM4_MFS1_LIN_SCR_TBIE                 *((volatile unsigned char*)(0x42702028UL))
#define bFM4_MFS1_LIN_SCR_TIE                  *((volatile unsigned char*)(0x4270202CUL))
#define bFM4_MFS1_LIN_SCR_RIE                  *((volatile unsigned char*)(0x42702030UL))
#define bFM4_MFS1_LIN_SCR_LBR                  *((volatile unsigned char*)(0x42702034UL))
#define bFM4_MFS1_LIN_SCR_MS                   *((volatile unsigned char*)(0x42702038UL))
#define bFM4_MFS1_LIN_SCR_UPCL                 *((volatile unsigned char*)(0x4270203CUL))
#define bFM4_MFS1_LIN_ESCR_DEL0                *((volatile unsigned char*)(0x42702080UL))
#define bFM4_MFS1_LIN_ESCR_DEL1                *((volatile unsigned char*)(0x42702084UL))
#define bFM4_MFS1_LIN_ESCR_LBL0                *((volatile unsigned char*)(0x42702088UL))
#define bFM4_MFS1_LIN_ESCR_LBL1                *((volatile unsigned char*)(0x4270208CUL))
#define bFM4_MFS1_LIN_ESCR_LBIE                *((volatile unsigned char*)(0x42702090UL))
#define bFM4_MFS1_LIN_ESCR_ESBL                *((volatile unsigned char*)(0x42702098UL))
#define bFM4_MFS1_LIN_SSR_TBI                  *((volatile unsigned char*)(0x427020A0UL))
#define bFM4_MFS1_LIN_SSR_TDRE                 *((volatile unsigned char*)(0x427020A4UL))
#define bFM4_MFS1_LIN_SSR_RDRF                 *((volatile unsigned char*)(0x427020A8UL))
#define bFM4_MFS1_LIN_SSR_ORE                  *((volatile unsigned char*)(0x427020ACUL))
#define bFM4_MFS1_LIN_SSR_FRE                  *((volatile unsigned char*)(0x427020B0UL))
#define bFM4_MFS1_LIN_SSR_LBD                  *((volatile unsigned char*)(0x427020B4UL))
#define bFM4_MFS1_LIN_SSR_REC                  *((volatile unsigned char*)(0x427020BCUL))
#define bFM4_MFS1_LIN_BGR_EXT                  *((volatile unsigned char*)(0x427021BCUL))
#define bFM4_MFS1_LIN_BGR1_EXT                 *((volatile unsigned char*)(0x427021BCUL))
#define bFM4_MFS1_LIN_FCR_FE1                  *((volatile unsigned char*)(0x42702280UL))
#define bFM4_MFS1_LIN_FCR_FE2                  *((volatile unsigned char*)(0x42702284UL))
#define bFM4_MFS1_LIN_FCR_FCL1                 *((volatile unsigned char*)(0x42702288UL))
#define bFM4_MFS1_LIN_FCR_FCL2                 *((volatile unsigned char*)(0x4270228CUL))
#define bFM4_MFS1_LIN_FCR_FSET                 *((volatile unsigned char*)(0x42702290UL))
#define bFM4_MFS1_LIN_FCR_FLD                  *((volatile unsigned char*)(0x42702294UL))
#define bFM4_MFS1_LIN_FCR_FLST                 *((volatile unsigned char*)(0x42702298UL))
#define bFM4_MFS1_LIN_FCR_FSEL                 *((volatile unsigned char*)(0x427022A0UL))
#define bFM4_MFS1_LIN_FCR_FTIE                 *((volatile unsigned char*)(0x427022A4UL))
#define bFM4_MFS1_LIN_FCR_FDRQ                 *((volatile unsigned char*)(0x427022A8UL))
#define bFM4_MFS1_LIN_FCR_FRIIE                *((volatile unsigned char*)(0x427022ACUL))
#define bFM4_MFS1_LIN_FCR_FLSTE                *((volatile unsigned char*)(0x427022B0UL))
#define bFM4_MFS1_LIN_FCR0_FE1                 *((volatile unsigned char*)(0x42702280UL))
#define bFM4_MFS1_LIN_FCR0_FE2                 *((volatile unsigned char*)(0x42702284UL))
#define bFM4_MFS1_LIN_FCR0_FCL1                *((volatile unsigned char*)(0x42702288UL))
#define bFM4_MFS1_LIN_FCR0_FCL2                *((volatile unsigned char*)(0x4270228CUL))
#define bFM4_MFS1_LIN_FCR0_FSET                *((volatile unsigned char*)(0x42702290UL))
#define bFM4_MFS1_LIN_FCR0_FLD                 *((volatile unsigned char*)(0x42702294UL))
#define bFM4_MFS1_LIN_FCR0_FLST                *((volatile unsigned char*)(0x42702298UL))
#define bFM4_MFS1_LIN_FCR1_FSEL                *((volatile unsigned char*)(0x427022A0UL))
#define bFM4_MFS1_LIN_FCR1_FTIE                *((volatile unsigned char*)(0x427022A4UL))
#define bFM4_MFS1_LIN_FCR1_FDRQ                *((volatile unsigned char*)(0x427022A8UL))
#define bFM4_MFS1_LIN_FCR1_FRIIE               *((volatile unsigned char*)(0x427022ACUL))
#define bFM4_MFS1_LIN_FCR1_FLSTE               *((volatile unsigned char*)(0x427022B0UL))
#define bFM4_MFS1_LIN_FBYTE_FD0                *((volatile unsigned char*)(0x42702300UL))
#define bFM4_MFS1_LIN_FBYTE_FD1                *((volatile unsigned char*)(0x42702304UL))
#define bFM4_MFS1_LIN_FBYTE_FD2                *((volatile unsigned char*)(0x42702308UL))
#define bFM4_MFS1_LIN_FBYTE_FD3                *((volatile unsigned char*)(0x4270230CUL))
#define bFM4_MFS1_LIN_FBYTE_FD4                *((volatile unsigned char*)(0x42702310UL))
#define bFM4_MFS1_LIN_FBYTE_FD5                *((volatile unsigned char*)(0x42702314UL))
#define bFM4_MFS1_LIN_FBYTE_FD6                *((volatile unsigned char*)(0x42702318UL))
#define bFM4_MFS1_LIN_FBYTE_FD7                *((volatile unsigned char*)(0x4270231CUL))
#define bFM4_MFS1_LIN_FBYTE_FD8                *((volatile unsigned char*)(0x42702320UL))
#define bFM4_MFS1_LIN_FBYTE_FD9                *((volatile unsigned char*)(0x42702324UL))
#define bFM4_MFS1_LIN_FBYTE_FD10               *((volatile unsigned char*)(0x42702328UL))
#define bFM4_MFS1_LIN_FBYTE_FD11               *((volatile unsigned char*)(0x4270232CUL))
#define bFM4_MFS1_LIN_FBYTE_FD12               *((volatile unsigned char*)(0x42702330UL))
#define bFM4_MFS1_LIN_FBYTE_FD13               *((volatile unsigned char*)(0x42702334UL))
#define bFM4_MFS1_LIN_FBYTE_FD14               *((volatile unsigned char*)(0x42702338UL))
#define bFM4_MFS1_LIN_FBYTE_FD15               *((volatile unsigned char*)(0x4270233CUL))
#define bFM4_MFS1_LIN_FBYTE1_FD0               *((volatile unsigned char*)(0x42702300UL))
#define bFM4_MFS1_LIN_FBYTE1_FD1               *((volatile unsigned char*)(0x42702304UL))
#define bFM4_MFS1_LIN_FBYTE1_FD2               *((volatile unsigned char*)(0x42702308UL))
#define bFM4_MFS1_LIN_FBYTE1_FD3               *((volatile unsigned char*)(0x4270230CUL))
#define bFM4_MFS1_LIN_FBYTE1_FD4               *((volatile unsigned char*)(0x42702310UL))
#define bFM4_MFS1_LIN_FBYTE1_FD5               *((volatile unsigned char*)(0x42702314UL))
#define bFM4_MFS1_LIN_FBYTE1_FD6               *((volatile unsigned char*)(0x42702318UL))
#define bFM4_MFS1_LIN_FBYTE1_FD7               *((volatile unsigned char*)(0x4270231CUL))
#define bFM4_MFS1_LIN_FBYTE2_FD8               *((volatile unsigned char*)(0x42702320UL))
#define bFM4_MFS1_LIN_FBYTE2_FD9               *((volatile unsigned char*)(0x42702324UL))
#define bFM4_MFS1_LIN_FBYTE2_FD10              *((volatile unsigned char*)(0x42702328UL))
#define bFM4_MFS1_LIN_FBYTE2_FD11              *((volatile unsigned char*)(0x4270232CUL))
#define bFM4_MFS1_LIN_FBYTE2_FD12              *((volatile unsigned char*)(0x42702330UL))
#define bFM4_MFS1_LIN_FBYTE2_FD13              *((volatile unsigned char*)(0x42702334UL))
#define bFM4_MFS1_LIN_FBYTE2_FD14              *((volatile unsigned char*)(0x42702338UL))
#define bFM4_MFS1_LIN_FBYTE2_FD15              *((volatile unsigned char*)(0x4270233CUL))

/* MFS I2C channel 1 registers */
#define bFM4_MFS1_I2C_SMR_TIE                  *((volatile unsigned char*)(0x42702008UL))
#define bFM4_MFS1_I2C_SMR_RIE                  *((volatile unsigned char*)(0x4270200CUL))
#define bFM4_MFS1_I2C_SMR_MD0                  *((volatile unsigned char*)(0x42702014UL))
#define bFM4_MFS1_I2C_SMR_MD1                  *((volatile unsigned char*)(0x42702018UL))
#define bFM4_MFS1_I2C_SMR_MD2                  *((volatile unsigned char*)(0x4270201CUL))
#define bFM4_MFS1_I2C_IBCR_INT                 *((volatile unsigned char*)(0x42702020UL))
#define bFM4_MFS1_I2C_IBCR_BER                 *((volatile unsigned char*)(0x42702024UL))
#define bFM4_MFS1_I2C_IBCR_INTE                *((volatile unsigned char*)(0x42702028UL))
#define bFM4_MFS1_I2C_IBCR_CNDE                *((volatile unsigned char*)(0x4270202CUL))
#define bFM4_MFS1_I2C_IBCR_WSEL                *((volatile unsigned char*)(0x42702030UL))
#define bFM4_MFS1_I2C_IBCR_ACKE                *((volatile unsigned char*)(0x42702034UL))
#define bFM4_MFS1_I2C_IBCR_ACT                 *((volatile unsigned char*)(0x42702038UL))
#define bFM4_MFS1_I2C_IBCR_SCC                 *((volatile unsigned char*)(0x42702038UL))
#define bFM4_MFS1_I2C_IBCR_MSS                 *((volatile unsigned char*)(0x4270203CUL))
#define bFM4_MFS1_I2C_IBSR_BB                  *((volatile unsigned char*)(0x42702080UL))
#define bFM4_MFS1_I2C_IBSR_SPC                 *((volatile unsigned char*)(0x42702084UL))
#define bFM4_MFS1_I2C_IBSR_RSC                 *((volatile unsigned char*)(0x42702088UL))
#define bFM4_MFS1_I2C_IBSR_AL                  *((volatile unsigned char*)(0x4270208CUL))
#define bFM4_MFS1_I2C_IBSR_TRX                 *((volatile unsigned char*)(0x42702090UL))
#define bFM4_MFS1_I2C_IBSR_RSA                 *((volatile unsigned char*)(0x42702094UL))
#define bFM4_MFS1_I2C_IBSR_RACK                *((volatile unsigned char*)(0x42702098UL))
#define bFM4_MFS1_I2C_IBSR_FBT                 *((volatile unsigned char*)(0x4270209CUL))
#define bFM4_MFS1_I2C_SSR_TBI                  *((volatile unsigned char*)(0x427020A0UL))
#define bFM4_MFS1_I2C_SSR_TDRE                 *((volatile unsigned char*)(0x427020A4UL))
#define bFM4_MFS1_I2C_SSR_RDRF                 *((volatile unsigned char*)(0x427020A8UL))
#define bFM4_MFS1_I2C_SSR_ORE                  *((volatile unsigned char*)(0x427020ACUL))
#define bFM4_MFS1_I2C_SSR_TBIE                 *((volatile unsigned char*)(0x427020B0UL))
#define bFM4_MFS1_I2C_SSR_DMA                  *((volatile unsigned char*)(0x427020B4UL))
#define bFM4_MFS1_I2C_SSR_TSET                 *((volatile unsigned char*)(0x427020B8UL))
#define bFM4_MFS1_I2C_SSR_REC                  *((volatile unsigned char*)(0x427020BCUL))
#define bFM4_MFS1_I2C_ISBA_SA0                 *((volatile unsigned char*)(0x42702200UL))
#define bFM4_MFS1_I2C_ISBA_SA1                 *((volatile unsigned char*)(0x42702204UL))
#define bFM4_MFS1_I2C_ISBA_SA2                 *((volatile unsigned char*)(0x42702208UL))
#define bFM4_MFS1_I2C_ISBA_SA3                 *((volatile unsigned char*)(0x4270220CUL))
#define bFM4_MFS1_I2C_ISBA_SA4                 *((volatile unsigned char*)(0x42702210UL))
#define bFM4_MFS1_I2C_ISBA_SA5                 *((volatile unsigned char*)(0x42702214UL))
#define bFM4_MFS1_I2C_ISBA_SA6                 *((volatile unsigned char*)(0x42702218UL))
#define bFM4_MFS1_I2C_ISBA_SAEN                *((volatile unsigned char*)(0x4270221CUL))
#define bFM4_MFS1_I2C_ISMK_SM0                 *((volatile unsigned char*)(0x42702220UL))
#define bFM4_MFS1_I2C_ISMK_SM1                 *((volatile unsigned char*)(0x42702224UL))
#define bFM4_MFS1_I2C_ISMK_SM2                 *((volatile unsigned char*)(0x42702228UL))
#define bFM4_MFS1_I2C_ISMK_SM3                 *((volatile unsigned char*)(0x4270222CUL))
#define bFM4_MFS1_I2C_ISMK_SM4                 *((volatile unsigned char*)(0x42702230UL))
#define bFM4_MFS1_I2C_ISMK_SM5                 *((volatile unsigned char*)(0x42702234UL))
#define bFM4_MFS1_I2C_ISMK_SM6                 *((volatile unsigned char*)(0x42702238UL))
#define bFM4_MFS1_I2C_ISMK_EN                  *((volatile unsigned char*)(0x4270223CUL))
#define bFM4_MFS1_I2C_FCR_FE1                  *((volatile unsigned char*)(0x42702280UL))
#define bFM4_MFS1_I2C_FCR_FE2                  *((volatile unsigned char*)(0x42702284UL))
#define bFM4_MFS1_I2C_FCR_FCL1                 *((volatile unsigned char*)(0x42702288UL))
#define bFM4_MFS1_I2C_FCR_FCL2                 *((volatile unsigned char*)(0x4270228CUL))
#define bFM4_MFS1_I2C_FCR_FSET                 *((volatile unsigned char*)(0x42702290UL))
#define bFM4_MFS1_I2C_FCR_FLD                  *((volatile unsigned char*)(0x42702294UL))
#define bFM4_MFS1_I2C_FCR_FLST                 *((volatile unsigned char*)(0x42702298UL))
#define bFM4_MFS1_I2C_FCR_FSEL                 *((volatile unsigned char*)(0x427022A0UL))
#define bFM4_MFS1_I2C_FCR_FTIE                 *((volatile unsigned char*)(0x427022A4UL))
#define bFM4_MFS1_I2C_FCR_FDRQ                 *((volatile unsigned char*)(0x427022A8UL))
#define bFM4_MFS1_I2C_FCR_FRIIE                *((volatile unsigned char*)(0x427022ACUL))
#define bFM4_MFS1_I2C_FCR_FLSTE                *((volatile unsigned char*)(0x427022B0UL))
#define bFM4_MFS1_I2C_FCR0_FE1                 *((volatile unsigned char*)(0x42702280UL))
#define bFM4_MFS1_I2C_FCR0_FE2                 *((volatile unsigned char*)(0x42702284UL))
#define bFM4_MFS1_I2C_FCR0_FCL1                *((volatile unsigned char*)(0x42702288UL))
#define bFM4_MFS1_I2C_FCR0_FCL2                *((volatile unsigned char*)(0x4270228CUL))
#define bFM4_MFS1_I2C_FCR0_FSET                *((volatile unsigned char*)(0x42702290UL))
#define bFM4_MFS1_I2C_FCR0_FLD                 *((volatile unsigned char*)(0x42702294UL))
#define bFM4_MFS1_I2C_FCR0_FLST                *((volatile unsigned char*)(0x42702298UL))
#define bFM4_MFS1_I2C_FCR1_FSEL                *((volatile unsigned char*)(0x427022A0UL))
#define bFM4_MFS1_I2C_FCR1_FTIE                *((volatile unsigned char*)(0x427022A4UL))
#define bFM4_MFS1_I2C_FCR1_FDRQ                *((volatile unsigned char*)(0x427022A8UL))
#define bFM4_MFS1_I2C_FCR1_FRIIE               *((volatile unsigned char*)(0x427022ACUL))
#define bFM4_MFS1_I2C_FCR1_FLSTE               *((volatile unsigned char*)(0x427022B0UL))
#define bFM4_MFS1_I2C_FBYTE_FD0                *((volatile unsigned char*)(0x42702300UL))
#define bFM4_MFS1_I2C_FBYTE_FD1                *((volatile unsigned char*)(0x42702304UL))
#define bFM4_MFS1_I2C_FBYTE_FD2                *((volatile unsigned char*)(0x42702308UL))
#define bFM4_MFS1_I2C_FBYTE_FD3                *((volatile unsigned char*)(0x4270230CUL))
#define bFM4_MFS1_I2C_FBYTE_FD4                *((volatile unsigned char*)(0x42702310UL))
#define bFM4_MFS1_I2C_FBYTE_FD5                *((volatile unsigned char*)(0x42702314UL))
#define bFM4_MFS1_I2C_FBYTE_FD6                *((volatile unsigned char*)(0x42702318UL))
#define bFM4_MFS1_I2C_FBYTE_FD7                *((volatile unsigned char*)(0x4270231CUL))
#define bFM4_MFS1_I2C_FBYTE_FD8                *((volatile unsigned char*)(0x42702320UL))
#define bFM4_MFS1_I2C_FBYTE_FD9                *((volatile unsigned char*)(0x42702324UL))
#define bFM4_MFS1_I2C_FBYTE_FD10               *((volatile unsigned char*)(0x42702328UL))
#define bFM4_MFS1_I2C_FBYTE_FD11               *((volatile unsigned char*)(0x4270232CUL))
#define bFM4_MFS1_I2C_FBYTE_FD12               *((volatile unsigned char*)(0x42702330UL))
#define bFM4_MFS1_I2C_FBYTE_FD13               *((volatile unsigned char*)(0x42702334UL))
#define bFM4_MFS1_I2C_FBYTE_FD14               *((volatile unsigned char*)(0x42702338UL))
#define bFM4_MFS1_I2C_FBYTE_FD15               *((volatile unsigned char*)(0x4270233CUL))
#define bFM4_MFS1_I2C_FBYTE1_FD0               *((volatile unsigned char*)(0x42702300UL))
#define bFM4_MFS1_I2C_FBYTE1_FD1               *((volatile unsigned char*)(0x42702304UL))
#define bFM4_MFS1_I2C_FBYTE1_FD2               *((volatile unsigned char*)(0x42702308UL))
#define bFM4_MFS1_I2C_FBYTE1_FD3               *((volatile unsigned char*)(0x4270230CUL))
#define bFM4_MFS1_I2C_FBYTE1_FD4               *((volatile unsigned char*)(0x42702310UL))
#define bFM4_MFS1_I2C_FBYTE1_FD5               *((volatile unsigned char*)(0x42702314UL))
#define bFM4_MFS1_I2C_FBYTE1_FD6               *((volatile unsigned char*)(0x42702318UL))
#define bFM4_MFS1_I2C_FBYTE1_FD7               *((volatile unsigned char*)(0x4270231CUL))
#define bFM4_MFS1_I2C_FBYTE2_FD8               *((volatile unsigned char*)(0x42702320UL))
#define bFM4_MFS1_I2C_FBYTE2_FD9               *((volatile unsigned char*)(0x42702324UL))
#define bFM4_MFS1_I2C_FBYTE2_FD10              *((volatile unsigned char*)(0x42702328UL))
#define bFM4_MFS1_I2C_FBYTE2_FD11              *((volatile unsigned char*)(0x4270232CUL))
#define bFM4_MFS1_I2C_FBYTE2_FD12              *((volatile unsigned char*)(0x42702330UL))
#define bFM4_MFS1_I2C_FBYTE2_FD13              *((volatile unsigned char*)(0x42702334UL))
#define bFM4_MFS1_I2C_FBYTE2_FD14              *((volatile unsigned char*)(0x42702338UL))
#define bFM4_MFS1_I2C_FBYTE2_FD15              *((volatile unsigned char*)(0x4270233CUL))

