sol4ik/audio-steganography/try/fm4/s6e2cc_i2s_sk-fm4-176l-s6se2cc-v10/common/s6e2cc.h
/* MFS UART channel 3 registers */
#define bFM4_MFS3_UART_SMR_SOE                 *((volatile unsigned char*)(0x42706000UL))
#define bFM4_MFS3_UART_SMR_BDS                 *((volatile unsigned char*)(0x42706008UL))
#define bFM4_MFS3_UART_SMR_SBL                 *((volatile unsigned char*)(0x4270600CUL))
#define bFM4_MFS3_UART_SMR_WUCR                *((volatile unsigned char*)(0x42706010UL))
#define bFM4_MFS3_UART_SMR_MD0                 *((volatile unsigned char*)(0x42706014UL))
#define bFM4_MFS3_UART_SMR_MD1                 *((volatile unsigned char*)(0x42706018UL))
#define bFM4_MFS3_UART_SMR_MD2                 *((volatile unsigned char*)(0x4270601CUL))
#define bFM4_MFS3_UART_SCR_TXE                 *((volatile unsigned char*)(0x42706020UL))
#define bFM4_MFS3_UART_SCR_RXE                 *((volatile unsigned char*)(0x42706024UL))
#define bFM4_MFS3_UART_SCR_TBIE                *((volatile unsigned char*)(0x42706028UL))
#define bFM4_MFS3_UART_SCR_TIE                 *((volatile unsigned char*)(0x4270602CUL))
#define bFM4_MFS3_UART_SCR_RIE                 *((volatile unsigned char*)(0x42706030UL))
#define bFM4_MFS3_UART_SCR_UPCL                *((volatile unsigned char*)(0x4270603CUL))
#define bFM4_MFS3_UART_ESCR_L0                 *((volatile unsigned char*)(0x42706080UL))
#define bFM4_MFS3_UART_ESCR_L1                 *((volatile unsigned char*)(0x42706084UL))
#define bFM4_MFS3_UART_ESCR_L2                 *((volatile unsigned char*)(0x42706088UL))
#define bFM4_MFS3_UART_ESCR_P                  *((volatile unsigned char*)(0x4270608CUL))
#define bFM4_MFS3_UART_ESCR_PEN                *((volatile unsigned char*)(0x42706090UL))
#define bFM4_MFS3_UART_ESCR_INV                *((volatile unsigned char*)(0x42706094UL))
#define bFM4_MFS3_UART_ESCR_ESBL               *((volatile unsigned char*)(0x42706098UL))
#define bFM4_MFS3_UART_ESCR_FLWEN              *((volatile unsigned char*)(0x4270609CUL))
#define bFM4_MFS3_UART_SSR_TBI                 *((volatile unsigned char*)(0x427060A0UL))
#define bFM4_MFS3_UART_SSR_TDRE                *((volatile unsigned char*)(0x427060A4UL))
#define bFM4_MFS3_UART_SSR_RDRF                *((volatile unsigned char*)(0x427060A8UL))
#define bFM4_MFS3_UART_SSR_ORE                 *((volatile unsigned char*)(0x427060ACUL))
#define bFM4_MFS3_UART_SSR_FRE                 *((volatile unsigned char*)(0x427060B0UL))
#define bFM4_MFS3_UART_SSR_PE                  *((volatile unsigned char*)(0x427060B4UL))
#define bFM4_MFS3_UART_SSR_REC                 *((volatile unsigned char*)(0x427060BCUL))
#define bFM4_MFS3_UART_BGR_EXT                 *((volatile unsigned char*)(0x427061BCUL))
#define bFM4_MFS3_UART_BGR1_EXT                *((volatile unsigned char*)(0x427061BCUL))
#define bFM4_MFS3_UART_FCR_FE1                 *((volatile unsigned char*)(0x42706280UL))
#define bFM4_MFS3_UART_FCR_FE2                 *((volatile unsigned char*)(0x42706284UL))
#define bFM4_MFS3_UART_FCR_FCL1                *((volatile unsigned char*)(0x42706288UL))
#define bFM4_MFS3_UART_FCR_FCL2                *((volatile unsigned char*)(0x4270628CUL))
#define bFM4_MFS3_UART_FCR_FSET                *((volatile unsigned char*)(0x42706290UL))
#define bFM4_MFS3_UART_FCR_FLD                 *((volatile unsigned char*)(0x42706294UL))
#define bFM4_MFS3_UART_FCR_FLST                *((volatile unsigned char*)(0x42706298UL))
#define bFM4_MFS3_UART_FCR_FSEL                *((volatile unsigned char*)(0x427062A0UL))
#define bFM4_MFS3_UART_FCR_FTIE                *((volatile unsigned char*)(0x427062A4UL))
#define bFM4_MFS3_UART_FCR_FDRQ                *((volatile unsigned char*)(0x427062A8UL))
#define bFM4_MFS3_UART_FCR_FRIIE               *((volatile unsigned char*)(0x427062ACUL))
#define bFM4_MFS3_UART_FCR_FLSTE               *((volatile unsigned char*)(0x427062B0UL))
#define bFM4_MFS3_UART_FCR0_FE1                *((volatile unsigned char*)(0x42706280UL))
#define bFM4_MFS3_UART_FCR0_FE2                *((volatile unsigned char*)(0x42706284UL))
#define bFM4_MFS3_UART_FCR0_FCL1               *((volatile unsigned char*)(0x42706288UL))
#define bFM4_MFS3_UART_FCR0_FCL2               *((volatile unsigned char*)(0x4270628CUL))
#define bFM4_MFS3_UART_FCR0_FSET               *((volatile unsigned char*)(0x42706290UL))
#define bFM4_MFS3_UART_FCR0_FLD                *((volatile unsigned char*)(0x42706294UL))
#define bFM4_MFS3_UART_FCR0_FLST               *((volatile unsigned char*)(0x42706298UL))
#define bFM4_MFS3_UART_FCR1_FSEL               *((volatile unsigned char*)(0x427062A0UL))
#define bFM4_MFS3_UART_FCR1_FTIE               *((volatile unsigned char*)(0x427062A4UL))
#define bFM4_MFS3_UART_FCR1_FDRQ               *((volatile unsigned char*)(0x427062A8UL))
#define bFM4_MFS3_UART_FCR1_FRIIE              *((volatile unsigned char*)(0x427062ACUL))
#define bFM4_MFS3_UART_FCR1_FLSTE              *((volatile unsigned char*)(0x427062B0UL))
#define bFM4_MFS3_UART_FBYTE_FD0               *((volatile unsigned char*)(0x42706300UL))
#define bFM4_MFS3_UART_FBYTE_FD1               *((volatile unsigned char*)(0x42706304UL))
#define bFM4_MFS3_UART_FBYTE_FD2               *((volatile unsigned char*)(0x42706308UL))
#define bFM4_MFS3_UART_FBYTE_FD3               *((volatile unsigned char*)(0x4270630CUL))
#define bFM4_MFS3_UART_FBYTE_FD4               *((volatile unsigned char*)(0x42706310UL))
#define bFM4_MFS3_UART_FBYTE_FD5               *((volatile unsigned char*)(0x42706314UL))
#define bFM4_MFS3_UART_FBYTE_FD6               *((volatile unsigned char*)(0x42706318UL))
#define bFM4_MFS3_UART_FBYTE_FD7               *((volatile unsigned char*)(0x4270631CUL))
#define bFM4_MFS3_UART_FBYTE_FD8               *((volatile unsigned char*)(0x42706320UL))
#define bFM4_MFS3_UART_FBYTE_FD9               *((volatile unsigned char*)(0x42706324UL))
#define bFM4_MFS3_UART_FBYTE_FD10              *((volatile unsigned char*)(0x42706328UL))
#define bFM4_MFS3_UART_FBYTE_FD11              *((volatile unsigned char*)(0x4270632CUL))
#define bFM4_MFS3_UART_FBYTE_FD12              *((volatile unsigned char*)(0x42706330UL))
#define bFM4_MFS3_UART_FBYTE_FD13              *((volatile unsigned char*)(0x42706334UL))
#define bFM4_MFS3_UART_FBYTE_FD14              *((volatile unsigned char*)(0x42706338UL))
#define bFM4_MFS3_UART_FBYTE_FD15              *((volatile unsigned char*)(0x4270633CUL))
#define bFM4_MFS3_UART_FBYTE1_FD0              *((volatile unsigned char*)(0x42706300UL))
#define bFM4_MFS3_UART_FBYTE1_FD1              *((volatile unsigned char*)(0x42706304UL))
#define bFM4_MFS3_UART_FBYTE1_FD2              *((volatile unsigned char*)(0x42706308UL))
#define bFM4_MFS3_UART_FBYTE1_FD3              *((volatile unsigned char*)(0x4270630CUL))
#define bFM4_MFS3_UART_FBYTE1_FD4              *((volatile unsigned char*)(0x42706310UL))
#define bFM4_MFS3_UART_FBYTE1_FD5              *((volatile unsigned char*)(0x42706314UL))
#define bFM4_MFS3_UART_FBYTE1_FD6              *((volatile unsigned char*)(0x42706318UL))
#define bFM4_MFS3_UART_FBYTE1_FD7              *((volatile unsigned char*)(0x4270631CUL))
#define bFM4_MFS3_UART_FBYTE2_FD8              *((volatile unsigned char*)(0x42706320UL))
#define bFM4_MFS3_UART_FBYTE2_FD9              *((volatile unsigned char*)(0x42706324UL))
#define bFM4_MFS3_UART_FBYTE2_FD10             *((volatile unsigned char*)(0x42706328UL))
#define bFM4_MFS3_UART_FBYTE2_FD11             *((volatile unsigned char*)(0x4270632CUL))
#define bFM4_MFS3_UART_FBYTE2_FD12             *((volatile unsigned char*)(0x42706330UL))
#define bFM4_MFS3_UART_FBYTE2_FD13             *((volatile unsigned char*)(0x42706334UL))
#define bFM4_MFS3_UART_FBYTE2_FD14             *((volatile unsigned char*)(0x42706338UL))
#define bFM4_MFS3_UART_FBYTE2_FD15             *((volatile unsigned char*)(0x4270633CUL))

