sol4ik/audio-steganography/try/fm4/s6e2cc_i2s_sk-fm4-176l-s6se2cc-v10/common/s6e2cc.h
/* MFS LIN channel 7 registers */
#define bFM4_MFS7_LIN_SMR_SOE                  *((volatile unsigned char*)(0x4270E000UL))
#define bFM4_MFS7_LIN_SMR_SBL                  *((volatile unsigned char*)(0x4270E00CUL))
#define bFM4_MFS7_LIN_SMR_WUCR                 *((volatile unsigned char*)(0x4270E010UL))
#define bFM4_MFS7_LIN_SMR_MD0                  *((volatile unsigned char*)(0x4270E014UL))
#define bFM4_MFS7_LIN_SMR_MD1                  *((volatile unsigned char*)(0x4270E018UL))
#define bFM4_MFS7_LIN_SMR_MD2                  *((volatile unsigned char*)(0x4270E01CUL))
#define bFM4_MFS7_LIN_SCR_TXE                  *((volatile unsigned char*)(0x4270E020UL))
#define bFM4_MFS7_LIN_SCR_RXE                  *((volatile unsigned char*)(0x4270E024UL))
#define bFM4_MFS7_LIN_SCR_TBIE                 *((volatile unsigned char*)(0x4270E028UL))
#define bFM4_MFS7_LIN_SCR_TIE                  *((volatile unsigned char*)(0x4270E02CUL))
#define bFM4_MFS7_LIN_SCR_RIE                  *((volatile unsigned char*)(0x4270E030UL))
#define bFM4_MFS7_LIN_SCR_LBR                  *((volatile unsigned char*)(0x4270E034UL))
#define bFM4_MFS7_LIN_SCR_MS                   *((volatile unsigned char*)(0x4270E038UL))
#define bFM4_MFS7_LIN_SCR_UPCL                 *((volatile unsigned char*)(0x4270E03CUL))
#define bFM4_MFS7_LIN_ESCR_DEL0                *((volatile unsigned char*)(0x4270E080UL))
#define bFM4_MFS7_LIN_ESCR_DEL1                *((volatile unsigned char*)(0x4270E084UL))
#define bFM4_MFS7_LIN_ESCR_LBL0                *((volatile unsigned char*)(0x4270E088UL))
#define bFM4_MFS7_LIN_ESCR_LBL1                *((volatile unsigned char*)(0x4270E08CUL))
#define bFM4_MFS7_LIN_ESCR_LBIE                *((volatile unsigned char*)(0x4270E090UL))
#define bFM4_MFS7_LIN_ESCR_ESBL                *((volatile unsigned char*)(0x4270E098UL))
#define bFM4_MFS7_LIN_SSR_TBI                  *((volatile unsigned char*)(0x4270E0A0UL))
#define bFM4_MFS7_LIN_SSR_TDRE                 *((volatile unsigned char*)(0x4270E0A4UL))
#define bFM4_MFS7_LIN_SSR_RDRF                 *((volatile unsigned char*)(0x4270E0A8UL))
#define bFM4_MFS7_LIN_SSR_ORE                  *((volatile unsigned char*)(0x4270E0ACUL))
#define bFM4_MFS7_LIN_SSR_FRE                  *((volatile unsigned char*)(0x4270E0B0UL))
#define bFM4_MFS7_LIN_SSR_LBD                  *((volatile unsigned char*)(0x4270E0B4UL))
#define bFM4_MFS7_LIN_SSR_REC                  *((volatile unsigned char*)(0x4270E0BCUL))
#define bFM4_MFS7_LIN_BGR_EXT                  *((volatile unsigned char*)(0x4270E1BCUL))
#define bFM4_MFS7_LIN_BGR1_EXT                 *((volatile unsigned char*)(0x4270E1BCUL))
#define bFM4_MFS7_LIN_FCR_FE1                  *((volatile unsigned char*)(0x4270E280UL))
#define bFM4_MFS7_LIN_FCR_FE2                  *((volatile unsigned char*)(0x4270E284UL))
#define bFM4_MFS7_LIN_FCR_FCL1                 *((volatile unsigned char*)(0x4270E288UL))
#define bFM4_MFS7_LIN_FCR_FCL2                 *((volatile unsigned char*)(0x4270E28CUL))
#define bFM4_MFS7_LIN_FCR_FSET                 *((volatile unsigned char*)(0x4270E290UL))
#define bFM4_MFS7_LIN_FCR_FLD                  *((volatile unsigned char*)(0x4270E294UL))
#define bFM4_MFS7_LIN_FCR_FLST                 *((volatile unsigned char*)(0x4270E298UL))
#define bFM4_MFS7_LIN_FCR_FSEL                 *((volatile unsigned char*)(0x4270E2A0UL))
#define bFM4_MFS7_LIN_FCR_FTIE                 *((volatile unsigned char*)(0x4270E2A4UL))
#define bFM4_MFS7_LIN_FCR_FDRQ                 *((volatile unsigned char*)(0x4270E2A8UL))
#define bFM4_MFS7_LIN_FCR_FRIIE                *((volatile unsigned char*)(0x4270E2ACUL))
#define bFM4_MFS7_LIN_FCR_FLSTE                *((volatile unsigned char*)(0x4270E2B0UL))
#define bFM4_MFS7_LIN_FCR0_FE1                 *((volatile unsigned char*)(0x4270E280UL))
#define bFM4_MFS7_LIN_FCR0_FE2                 *((volatile unsigned char*)(0x4270E284UL))
#define bFM4_MFS7_LIN_FCR0_FCL1                *((volatile unsigned char*)(0x4270E288UL))
#define bFM4_MFS7_LIN_FCR0_FCL2                *((volatile unsigned char*)(0x4270E28CUL))
#define bFM4_MFS7_LIN_FCR0_FSET                *((volatile unsigned char*)(0x4270E290UL))
#define bFM4_MFS7_LIN_FCR0_FLD                 *((volatile unsigned char*)(0x4270E294UL))
#define bFM4_MFS7_LIN_FCR0_FLST                *((volatile unsigned char*)(0x4270E298UL))
#define bFM4_MFS7_LIN_FCR1_FSEL                *((volatile unsigned char*)(0x4270E2A0UL))
#define bFM4_MFS7_LIN_FCR1_FTIE                *((volatile unsigned char*)(0x4270E2A4UL))
#define bFM4_MFS7_LIN_FCR1_FDRQ                *((volatile unsigned char*)(0x4270E2A8UL))
#define bFM4_MFS7_LIN_FCR1_FRIIE               *((volatile unsigned char*)(0x4270E2ACUL))
#define bFM4_MFS7_LIN_FCR1_FLSTE               *((volatile unsigned char*)(0x4270E2B0UL))
#define bFM4_MFS7_LIN_FBYTE_FD0                *((volatile unsigned char*)(0x4270E300UL))
#define bFM4_MFS7_LIN_FBYTE_FD1                *((volatile unsigned char*)(0x4270E304UL))
#define bFM4_MFS7_LIN_FBYTE_FD2                *((volatile unsigned char*)(0x4270E308UL))
#define bFM4_MFS7_LIN_FBYTE_FD3                *((volatile unsigned char*)(0x4270E30CUL))
#define bFM4_MFS7_LIN_FBYTE_FD4                *((volatile unsigned char*)(0x4270E310UL))
#define bFM4_MFS7_LIN_FBYTE_FD5                *((volatile unsigned char*)(0x4270E314UL))
#define bFM4_MFS7_LIN_FBYTE_FD6                *((volatile unsigned char*)(0x4270E318UL))
#define bFM4_MFS7_LIN_FBYTE_FD7                *((volatile unsigned char*)(0x4270E31CUL))
#define bFM4_MFS7_LIN_FBYTE_FD8                *((volatile unsigned char*)(0x4270E320UL))
#define bFM4_MFS7_LIN_FBYTE_FD9                *((volatile unsigned char*)(0x4270E324UL))
#define bFM4_MFS7_LIN_FBYTE_FD10               *((volatile unsigned char*)(0x4270E328UL))
#define bFM4_MFS7_LIN_FBYTE_FD11               *((volatile unsigned char*)(0x4270E32CUL))
#define bFM4_MFS7_LIN_FBYTE_FD12               *((volatile unsigned char*)(0x4270E330UL))
#define bFM4_MFS7_LIN_FBYTE_FD13               *((volatile unsigned char*)(0x4270E334UL))
#define bFM4_MFS7_LIN_FBYTE_FD14               *((volatile unsigned char*)(0x4270E338UL))
#define bFM4_MFS7_LIN_FBYTE_FD15               *((volatile unsigned char*)(0x4270E33CUL))
#define bFM4_MFS7_LIN_FBYTE1_FD0               *((volatile unsigned char*)(0x4270E300UL))
#define bFM4_MFS7_LIN_FBYTE1_FD1               *((volatile unsigned char*)(0x4270E304UL))
#define bFM4_MFS7_LIN_FBYTE1_FD2               *((volatile unsigned char*)(0x4270E308UL))
#define bFM4_MFS7_LIN_FBYTE1_FD3               *((volatile unsigned char*)(0x4270E30CUL))
#define bFM4_MFS7_LIN_FBYTE1_FD4               *((volatile unsigned char*)(0x4270E310UL))
#define bFM4_MFS7_LIN_FBYTE1_FD5               *((volatile unsigned char*)(0x4270E314UL))
#define bFM4_MFS7_LIN_FBYTE1_FD6               *((volatile unsigned char*)(0x4270E318UL))
#define bFM4_MFS7_LIN_FBYTE1_FD7               *((volatile unsigned char*)(0x4270E31CUL))
#define bFM4_MFS7_LIN_FBYTE2_FD8               *((volatile unsigned char*)(0x4270E320UL))
#define bFM4_MFS7_LIN_FBYTE2_FD9               *((volatile unsigned char*)(0x4270E324UL))
#define bFM4_MFS7_LIN_FBYTE2_FD10              *((volatile unsigned char*)(0x4270E328UL))
#define bFM4_MFS7_LIN_FBYTE2_FD11              *((volatile unsigned char*)(0x4270E32CUL))
#define bFM4_MFS7_LIN_FBYTE2_FD12              *((volatile unsigned char*)(0x4270E330UL))
#define bFM4_MFS7_LIN_FBYTE2_FD13              *((volatile unsigned char*)(0x4270E334UL))
#define bFM4_MFS7_LIN_FBYTE2_FD14              *((volatile unsigned char*)(0x4270E338UL))
#define bFM4_MFS7_LIN_FBYTE2_FD15              *((volatile unsigned char*)(0x4270E33CUL))

/* MFS I2C channel 7 registers */
#define bFM4_MFS7_I2C_SMR_TIE                  *((volatile unsigned char*)(0x4270E008UL))
#define bFM4_MFS7_I2C_SMR_RIE                  *((volatile unsigned char*)(0x4270E00CUL))
#define bFM4_MFS7_I2C_SMR_MD0                  *((volatile unsigned char*)(0x4270E014UL))
#define bFM4_MFS7_I2C_SMR_MD1                  *((volatile unsigned char*)(0x4270E018UL))
#define bFM4_MFS7_I2C_SMR_MD2                  *((volatile unsigned char*)(0x4270E01CUL))
#define bFM4_MFS7_I2C_IBCR_INT                 *((volatile unsigned char*)(0x4270E020UL))
#define bFM4_MFS7_I2C_IBCR_BER                 *((volatile unsigned char*)(0x4270E024UL))
#define bFM4_MFS7_I2C_IBCR_INTE                *((volatile unsigned char*)(0x4270E028UL))
#define bFM4_MFS7_I2C_IBCR_CNDE                *((volatile unsigned char*)(0x4270E02CUL))
#define bFM4_MFS7_I2C_IBCR_WSEL                *((volatile unsigned char*)(0x4270E030UL))
#define bFM4_MFS7_I2C_IBCR_ACKE                *((volatile unsigned char*)(0x4270E034UL))
#define bFM4_MFS7_I2C_IBCR_ACT                 *((volatile unsigned char*)(0x4270E038UL))
#define bFM4_MFS7_I2C_IBCR_SCC                 *((volatile unsigned char*)(0x4270E038UL))
#define bFM4_MFS7_I2C_IBCR_MSS                 *((volatile unsigned char*)(0x4270E03CUL))
#define bFM4_MFS7_I2C_IBSR_BB                  *((volatile unsigned char*)(0x4270E080UL))
#define bFM4_MFS7_I2C_IBSR_SPC                 *((volatile unsigned char*)(0x4270E084UL))
#define bFM4_MFS7_I2C_IBSR_RSC                 *((volatile unsigned char*)(0x4270E088UL))
#define bFM4_MFS7_I2C_IBSR_AL                  *((volatile unsigned char*)(0x4270E08CUL))
#define bFM4_MFS7_I2C_IBSR_TRX                 *((volatile unsigned char*)(0x4270E090UL))
#define bFM4_MFS7_I2C_IBSR_RSA                 *((volatile unsigned char*)(0x4270E094UL))
#define bFM4_MFS7_I2C_IBSR_RACK                *((volatile unsigned char*)(0x4270E098UL))
#define bFM4_MFS7_I2C_IBSR_FBT                 *((volatile unsigned char*)(0x4270E09CUL))
#define bFM4_MFS7_I2C_SSR_TBI                  *((volatile unsigned char*)(0x4270E0A0UL))
#define bFM4_MFS7_I2C_SSR_TDRE                 *((volatile unsigned char*)(0x4270E0A4UL))
#define bFM4_MFS7_I2C_SSR_RDRF                 *((volatile unsigned char*)(0x4270E0A8UL))
#define bFM4_MFS7_I2C_SSR_ORE                  *((volatile unsigned char*)(0x4270E0ACUL))
#define bFM4_MFS7_I2C_SSR_TBIE                 *((volatile unsigned char*)(0x4270E0B0UL))
#define bFM4_MFS7_I2C_SSR_DMA                  *((volatile unsigned char*)(0x4270E0B4UL))
#define bFM4_MFS7_I2C_SSR_TSET                 *((volatile unsigned char*)(0x4270E0B8UL))
#define bFM4_MFS7_I2C_SSR_REC                  *((volatile unsigned char*)(0x4270E0BCUL))
#define bFM4_MFS7_I2C_ISBA_SA0                 *((volatile unsigned char*)(0x4270E200UL))
#define bFM4_MFS7_I2C_ISBA_SA1                 *((volatile unsigned char*)(0x4270E204UL))
#define bFM4_MFS7_I2C_ISBA_SA2                 *((volatile unsigned char*)(0x4270E208UL))
#define bFM4_MFS7_I2C_ISBA_SA3                 *((volatile unsigned char*)(0x4270E20CUL))
#define bFM4_MFS7_I2C_ISBA_SA4                 *((volatile unsigned char*)(0x4270E210UL))
#define bFM4_MFS7_I2C_ISBA_SA5                 *((volatile unsigned char*)(0x4270E214UL))
#define bFM4_MFS7_I2C_ISBA_SA6                 *((volatile unsigned char*)(0x4270E218UL))
#define bFM4_MFS7_I2C_ISBA_SAEN                *((volatile unsigned char*)(0x4270E21CUL))
#define bFM4_MFS7_I2C_ISMK_SM0                 *((volatile unsigned char*)(0x4270E220UL))
#define bFM4_MFS7_I2C_ISMK_SM1                 *((volatile unsigned char*)(0x4270E224UL))
#define bFM4_MFS7_I2C_ISMK_SM2                 *((volatile unsigned char*)(0x4270E228UL))
#define bFM4_MFS7_I2C_ISMK_SM3                 *((volatile unsigned char*)(0x4270E22CUL))
#define bFM4_MFS7_I2C_ISMK_SM4                 *((volatile unsigned char*)(0x4270E230UL))
#define bFM4_MFS7_I2C_ISMK_SM5                 *((volatile unsigned char*)(0x4270E234UL))
#define bFM4_MFS7_I2C_ISMK_SM6                 *((volatile unsigned char*)(0x4270E238UL))
#define bFM4_MFS7_I2C_ISMK_EN                  *((volatile unsigned char*)(0x4270E23CUL))
#define bFM4_MFS7_I2C_FCR_FE1                  *((volatile unsigned char*)(0x4270E280UL))
#define bFM4_MFS7_I2C_FCR_FE2                  *((volatile unsigned char*)(0x4270E284UL))
#define bFM4_MFS7_I2C_FCR_FCL1                 *((volatile unsigned char*)(0x4270E288UL))
#define bFM4_MFS7_I2C_FCR_FCL2                 *((volatile unsigned char*)(0x4270E28CUL))
#define bFM4_MFS7_I2C_FCR_FSET                 *((volatile unsigned char*)(0x4270E290UL))
#define bFM4_MFS7_I2C_FCR_FLD                  *((volatile unsigned char*)(0x4270E294UL))
#define bFM4_MFS7_I2C_FCR_FLST                 *((volatile unsigned char*)(0x4270E298UL))
#define bFM4_MFS7_I2C_FCR_FSEL                 *((volatile unsigned char*)(0x4270E2A0UL))
#define bFM4_MFS7_I2C_FCR_FTIE                 *((volatile unsigned char*)(0x4270E2A4UL))
#define bFM4_MFS7_I2C_FCR_FDRQ                 *((volatile unsigned char*)(0x4270E2A8UL))
#define bFM4_MFS7_I2C_FCR_FRIIE                *((volatile unsigned char*)(0x4270E2ACUL))
#define bFM4_MFS7_I2C_FCR_FLSTE                *((volatile unsigned char*)(0x4270E2B0UL))
#define bFM4_MFS7_I2C_FCR0_FE1                 *((volatile unsigned char*)(0x4270E280UL))
#define bFM4_MFS7_I2C_FCR0_FE2                 *((volatile unsigned char*)(0x4270E284UL))
#define bFM4_MFS7_I2C_FCR0_FCL1                *((volatile unsigned char*)(0x4270E288UL))
#define bFM4_MFS7_I2C_FCR0_FCL2                *((volatile unsigned char*)(0x4270E28CUL))
#define bFM4_MFS7_I2C_FCR0_FSET                *((volatile unsigned char*)(0x4270E290UL))
#define bFM4_MFS7_I2C_FCR0_FLD                 *((volatile unsigned char*)(0x4270E294UL))
#define bFM4_MFS7_I2C_FCR0_FLST                *((volatile unsigned char*)(0x4270E298UL))
#define bFM4_MFS7_I2C_FCR1_FSEL                *((volatile unsigned char*)(0x4270E2A0UL))
#define bFM4_MFS7_I2C_FCR1_FTIE                *((volatile unsigned char*)(0x4270E2A4UL))
#define bFM4_MFS7_I2C_FCR1_FDRQ                *((volatile unsigned char*)(0x4270E2A8UL))
#define bFM4_MFS7_I2C_FCR1_FRIIE               *((volatile unsigned char*)(0x4270E2ACUL))
#define bFM4_MFS7_I2C_FCR1_FLSTE               *((volatile unsigned char*)(0x4270E2B0UL))
#define bFM4_MFS7_I2C_FBYTE_FD0                *((volatile unsigned char*)(0x4270E300UL))
#define bFM4_MFS7_I2C_FBYTE_FD1                *((volatile unsigned char*)(0x4270E304UL))
#define bFM4_MFS7_I2C_FBYTE_FD2                *((volatile unsigned char*)(0x4270E308UL))
#define bFM4_MFS7_I2C_FBYTE_FD3                *((volatile unsigned char*)(0x4270E30CUL))
#define bFM4_MFS7_I2C_FBYTE_FD4                *((volatile unsigned char*)(0x4270E310UL))
#define bFM4_MFS7_I2C_FBYTE_FD5                *((volatile unsigned char*)(0x4270E314UL))
#define bFM4_MFS7_I2C_FBYTE_FD6                *((volatile unsigned char*)(0x4270E318UL))
#define bFM4_MFS7_I2C_FBYTE_FD7                *((volatile unsigned char*)(0x4270E31CUL))
#define bFM4_MFS7_I2C_FBYTE_FD8                *((volatile unsigned char*)(0x4270E320UL))
#define bFM4_MFS7_I2C_FBYTE_FD9                *((volatile unsigned char*)(0x4270E324UL))
#define bFM4_MFS7_I2C_FBYTE_FD10               *((volatile unsigned char*)(0x4270E328UL))
#define bFM4_MFS7_I2C_FBYTE_FD11               *((volatile unsigned char*)(0x4270E32CUL))
#define bFM4_MFS7_I2C_FBYTE_FD12               *((volatile unsigned char*)(0x4270E330UL))
#define bFM4_MFS7_I2C_FBYTE_FD13               *((volatile unsigned char*)(0x4270E334UL))
#define bFM4_MFS7_I2C_FBYTE_FD14               *((volatile unsigned char*)(0x4270E338UL))
#define bFM4_MFS7_I2C_FBYTE_FD15               *((volatile unsigned char*)(0x4270E33CUL))
#define bFM4_MFS7_I2C_FBYTE1_FD0               *((volatile unsigned char*)(0x4270E300UL))
#define bFM4_MFS7_I2C_FBYTE1_FD1               *((volatile unsigned char*)(0x4270E304UL))
#define bFM4_MFS7_I2C_FBYTE1_FD2               *((volatile unsigned char*)(0x4270E308UL))
#define bFM4_MFS7_I2C_FBYTE1_FD3               *((volatile unsigned char*)(0x4270E30CUL))
#define bFM4_MFS7_I2C_FBYTE1_FD4               *((volatile unsigned char*)(0x4270E310UL))
#define bFM4_MFS7_I2C_FBYTE1_FD5               *((volatile unsigned char*)(0x4270E314UL))
#define bFM4_MFS7_I2C_FBYTE1_FD6               *((volatile unsigned char*)(0x4270E318UL))
#define bFM4_MFS7_I2C_FBYTE1_FD7               *((volatile unsigned char*)(0x4270E31CUL))
#define bFM4_MFS7_I2C_FBYTE2_FD8               *((volatile unsigned char*)(0x4270E320UL))
#define bFM4_MFS7_I2C_FBYTE2_FD9               *((volatile unsigned char*)(0x4270E324UL))
#define bFM4_MFS7_I2C_FBYTE2_FD10              *((volatile unsigned char*)(0x4270E328UL))
#define bFM4_MFS7_I2C_FBYTE2_FD11              *((volatile unsigned char*)(0x4270E32CUL))
#define bFM4_MFS7_I2C_FBYTE2_FD12              *((volatile unsigned char*)(0x4270E330UL))
#define bFM4_MFS7_I2C_FBYTE2_FD13              *((volatile unsigned char*)(0x4270E334UL))
#define bFM4_MFS7_I2C_FBYTE2_FD14              *((volatile unsigned char*)(0x4270E338UL))
#define bFM4_MFS7_I2C_FBYTE2_FD15              *((volatile unsigned char*)(0x4270E33CUL))

