sol4ik/audio-steganography/try/fm4/s6e2cc_i2s_sk-fm4-176l-s6se2cc-v10/common/s6e2cc.h
/* MFS LIN channel 14 registers */
#define bFM4_MFS14_LIN_SMR_SOE                 *((volatile unsigned char*)(0x4271C000UL))
#define bFM4_MFS14_LIN_SMR_SBL                 *((volatile unsigned char*)(0x4271C00CUL))
#define bFM4_MFS14_LIN_SMR_WUCR                *((volatile unsigned char*)(0x4271C010UL))
#define bFM4_MFS14_LIN_SMR_MD0                 *((volatile unsigned char*)(0x4271C014UL))
#define bFM4_MFS14_LIN_SMR_MD1                 *((volatile unsigned char*)(0x4271C018UL))
#define bFM4_MFS14_LIN_SMR_MD2                 *((volatile unsigned char*)(0x4271C01CUL))
#define bFM4_MFS14_LIN_SCR_TXE                 *((volatile unsigned char*)(0x4271C020UL))
#define bFM4_MFS14_LIN_SCR_RXE                 *((volatile unsigned char*)(0x4271C024UL))
#define bFM4_MFS14_LIN_SCR_TBIE                *((volatile unsigned char*)(0x4271C028UL))
#define bFM4_MFS14_LIN_SCR_TIE                 *((volatile unsigned char*)(0x4271C02CUL))
#define bFM4_MFS14_LIN_SCR_RIE                 *((volatile unsigned char*)(0x4271C030UL))
#define bFM4_MFS14_LIN_SCR_LBR                 *((volatile unsigned char*)(0x4271C034UL))
#define bFM4_MFS14_LIN_SCR_MS                  *((volatile unsigned char*)(0x4271C038UL))
#define bFM4_MFS14_LIN_SCR_UPCL                *((volatile unsigned char*)(0x4271C03CUL))
#define bFM4_MFS14_LIN_ESCR_DEL0               *((volatile unsigned char*)(0x4271C080UL))
#define bFM4_MFS14_LIN_ESCR_DEL1               *((volatile unsigned char*)(0x4271C084UL))
#define bFM4_MFS14_LIN_ESCR_LBL0               *((volatile unsigned char*)(0x4271C088UL))
#define bFM4_MFS14_LIN_ESCR_LBL1               *((volatile unsigned char*)(0x4271C08CUL))
#define bFM4_MFS14_LIN_ESCR_LBIE               *((volatile unsigned char*)(0x4271C090UL))
#define bFM4_MFS14_LIN_ESCR_ESBL               *((volatile unsigned char*)(0x4271C098UL))
#define bFM4_MFS14_LIN_SSR_TBI                 *((volatile unsigned char*)(0x4271C0A0UL))
#define bFM4_MFS14_LIN_SSR_TDRE                *((volatile unsigned char*)(0x4271C0A4UL))
#define bFM4_MFS14_LIN_SSR_RDRF                *((volatile unsigned char*)(0x4271C0A8UL))
#define bFM4_MFS14_LIN_SSR_ORE                 *((volatile unsigned char*)(0x4271C0ACUL))
#define bFM4_MFS14_LIN_SSR_FRE                 *((volatile unsigned char*)(0x4271C0B0UL))
#define bFM4_MFS14_LIN_SSR_LBD                 *((volatile unsigned char*)(0x4271C0B4UL))
#define bFM4_MFS14_LIN_SSR_REC                 *((volatile unsigned char*)(0x4271C0BCUL))
#define bFM4_MFS14_LIN_BGR_EXT                 *((volatile unsigned char*)(0x4271C1BCUL))
#define bFM4_MFS14_LIN_BGR1_EXT                *((volatile unsigned char*)(0x4271C1BCUL))
#define bFM4_MFS14_LIN_FCR_FE1                 *((volatile unsigned char*)(0x4271C280UL))
#define bFM4_MFS14_LIN_FCR_FE2                 *((volatile unsigned char*)(0x4271C284UL))
#define bFM4_MFS14_LIN_FCR_FCL1                *((volatile unsigned char*)(0x4271C288UL))
#define bFM4_MFS14_LIN_FCR_FCL2                *((volatile unsigned char*)(0x4271C28CUL))
#define bFM4_MFS14_LIN_FCR_FSET                *((volatile unsigned char*)(0x4271C290UL))
#define bFM4_MFS14_LIN_FCR_FLD                 *((volatile unsigned char*)(0x4271C294UL))
#define bFM4_MFS14_LIN_FCR_FLST                *((volatile unsigned char*)(0x4271C298UL))
#define bFM4_MFS14_LIN_FCR_FSEL                *((volatile unsigned char*)(0x4271C2A0UL))
#define bFM4_MFS14_LIN_FCR_FTIE                *((volatile unsigned char*)(0x4271C2A4UL))
#define bFM4_MFS14_LIN_FCR_FDRQ                *((volatile unsigned char*)(0x4271C2A8UL))
#define bFM4_MFS14_LIN_FCR_FRIIE               *((volatile unsigned char*)(0x4271C2ACUL))
#define bFM4_MFS14_LIN_FCR_FLSTE               *((volatile unsigned char*)(0x4271C2B0UL))
#define bFM4_MFS14_LIN_FCR0_FE1                *((volatile unsigned char*)(0x4271C280UL))
#define bFM4_MFS14_LIN_FCR0_FE2                *((volatile unsigned char*)(0x4271C284UL))
#define bFM4_MFS14_LIN_FCR0_FCL1               *((volatile unsigned char*)(0x4271C288UL))
#define bFM4_MFS14_LIN_FCR0_FCL2               *((volatile unsigned char*)(0x4271C28CUL))
#define bFM4_MFS14_LIN_FCR0_FSET               *((volatile unsigned char*)(0x4271C290UL))
#define bFM4_MFS14_LIN_FCR0_FLD                *((volatile unsigned char*)(0x4271C294UL))
#define bFM4_MFS14_LIN_FCR0_FLST               *((volatile unsigned char*)(0x4271C298UL))
#define bFM4_MFS14_LIN_FCR1_FSEL               *((volatile unsigned char*)(0x4271C2A0UL))
#define bFM4_MFS14_LIN_FCR1_FTIE               *((volatile unsigned char*)(0x4271C2A4UL))
#define bFM4_MFS14_LIN_FCR1_FDRQ               *((volatile unsigned char*)(0x4271C2A8UL))
#define bFM4_MFS14_LIN_FCR1_FRIIE              *((volatile unsigned char*)(0x4271C2ACUL))
#define bFM4_MFS14_LIN_FCR1_FLSTE              *((volatile unsigned char*)(0x4271C2B0UL))
#define bFM4_MFS14_LIN_FBYTE_FD0               *((volatile unsigned char*)(0x4271C300UL))
#define bFM4_MFS14_LIN_FBYTE_FD1               *((volatile unsigned char*)(0x4271C304UL))
#define bFM4_MFS14_LIN_FBYTE_FD2               *((volatile unsigned char*)(0x4271C308UL))
#define bFM4_MFS14_LIN_FBYTE_FD3               *((volatile unsigned char*)(0x4271C30CUL))
#define bFM4_MFS14_LIN_FBYTE_FD4               *((volatile unsigned char*)(0x4271C310UL))
#define bFM4_MFS14_LIN_FBYTE_FD5               *((volatile unsigned char*)(0x4271C314UL))
#define bFM4_MFS14_LIN_FBYTE_FD6               *((volatile unsigned char*)(0x4271C318UL))
#define bFM4_MFS14_LIN_FBYTE_FD7               *((volatile unsigned char*)(0x4271C31CUL))
#define bFM4_MFS14_LIN_FBYTE_FD8               *((volatile unsigned char*)(0x4271C320UL))
#define bFM4_MFS14_LIN_FBYTE_FD9               *((volatile unsigned char*)(0x4271C324UL))
#define bFM4_MFS14_LIN_FBYTE_FD10              *((volatile unsigned char*)(0x4271C328UL))
#define bFM4_MFS14_LIN_FBYTE_FD11              *((volatile unsigned char*)(0x4271C32CUL))
#define bFM4_MFS14_LIN_FBYTE_FD12              *((volatile unsigned char*)(0x4271C330UL))
#define bFM4_MFS14_LIN_FBYTE_FD13              *((volatile unsigned char*)(0x4271C334UL))
#define bFM4_MFS14_LIN_FBYTE_FD14              *((volatile unsigned char*)(0x4271C338UL))
#define bFM4_MFS14_LIN_FBYTE_FD15              *((volatile unsigned char*)(0x4271C33CUL))
#define bFM4_MFS14_LIN_FBYTE1_FD0              *((volatile unsigned char*)(0x4271C300UL))
#define bFM4_MFS14_LIN_FBYTE1_FD1              *((volatile unsigned char*)(0x4271C304UL))
#define bFM4_MFS14_LIN_FBYTE1_FD2              *((volatile unsigned char*)(0x4271C308UL))
#define bFM4_MFS14_LIN_FBYTE1_FD3              *((volatile unsigned char*)(0x4271C30CUL))
#define bFM4_MFS14_LIN_FBYTE1_FD4              *((volatile unsigned char*)(0x4271C310UL))
#define bFM4_MFS14_LIN_FBYTE1_FD5              *((volatile unsigned char*)(0x4271C314UL))
#define bFM4_MFS14_LIN_FBYTE1_FD6              *((volatile unsigned char*)(0x4271C318UL))
#define bFM4_MFS14_LIN_FBYTE1_FD7              *((volatile unsigned char*)(0x4271C31CUL))
#define bFM4_MFS14_LIN_FBYTE2_FD8              *((volatile unsigned char*)(0x4271C320UL))
#define bFM4_MFS14_LIN_FBYTE2_FD9              *((volatile unsigned char*)(0x4271C324UL))
#define bFM4_MFS14_LIN_FBYTE2_FD10             *((volatile unsigned char*)(0x4271C328UL))
#define bFM4_MFS14_LIN_FBYTE2_FD11             *((volatile unsigned char*)(0x4271C32CUL))
#define bFM4_MFS14_LIN_FBYTE2_FD12             *((volatile unsigned char*)(0x4271C330UL))
#define bFM4_MFS14_LIN_FBYTE2_FD13             *((volatile unsigned char*)(0x4271C334UL))
#define bFM4_MFS14_LIN_FBYTE2_FD14             *((volatile unsigned char*)(0x4271C338UL))
#define bFM4_MFS14_LIN_FBYTE2_FD15             *((volatile unsigned char*)(0x4271C33CUL))

/* MFS I2C channel 14 registers */
#define bFM4_MFS14_I2C_SMR_TIE                 *((volatile unsigned char*)(0x4271C008UL))
#define bFM4_MFS14_I2C_SMR_RIE                 *((volatile unsigned char*)(0x4271C00CUL))
#define bFM4_MFS14_I2C_SMR_MD0                 *((volatile unsigned char*)(0x4271C014UL))
#define bFM4_MFS14_I2C_SMR_MD1                 *((volatile unsigned char*)(0x4271C018UL))
#define bFM4_MFS14_I2C_SMR_MD2                 *((volatile unsigned char*)(0x4271C01CUL))
#define bFM4_MFS14_I2C_IBCR_INT                *((volatile unsigned char*)(0x4271C020UL))
#define bFM4_MFS14_I2C_IBCR_BER                *((volatile unsigned char*)(0x4271C024UL))
#define bFM4_MFS14_I2C_IBCR_INTE               *((volatile unsigned char*)(0x4271C028UL))
#define bFM4_MFS14_I2C_IBCR_CNDE               *((volatile unsigned char*)(0x4271C02CUL))
#define bFM4_MFS14_I2C_IBCR_WSEL               *((volatile unsigned char*)(0x4271C030UL))
#define bFM4_MFS14_I2C_IBCR_ACKE               *((volatile unsigned char*)(0x4271C034UL))
#define bFM4_MFS14_I2C_IBCR_ACT                *((volatile unsigned char*)(0x4271C038UL))
#define bFM4_MFS14_I2C_IBCR_SCC                *((volatile unsigned char*)(0x4271C038UL))
#define bFM4_MFS14_I2C_IBCR_MSS                *((volatile unsigned char*)(0x4271C03CUL))
#define bFM4_MFS14_I2C_IBSR_BB                 *((volatile unsigned char*)(0x4271C080UL))
#define bFM4_MFS14_I2C_IBSR_SPC                *((volatile unsigned char*)(0x4271C084UL))
#define bFM4_MFS14_I2C_IBSR_RSC                *((volatile unsigned char*)(0x4271C088UL))
#define bFM4_MFS14_I2C_IBSR_AL                 *((volatile unsigned char*)(0x4271C08CUL))
#define bFM4_MFS14_I2C_IBSR_TRX                *((volatile unsigned char*)(0x4271C090UL))
#define bFM4_MFS14_I2C_IBSR_RSA                *((volatile unsigned char*)(0x4271C094UL))
#define bFM4_MFS14_I2C_IBSR_RACK               *((volatile unsigned char*)(0x4271C098UL))
#define bFM4_MFS14_I2C_IBSR_FBT                *((volatile unsigned char*)(0x4271C09CUL))
#define bFM4_MFS14_I2C_SSR_TBI                 *((volatile unsigned char*)(0x4271C0A0UL))
#define bFM4_MFS14_I2C_SSR_TDRE                *((volatile unsigned char*)(0x4271C0A4UL))
#define bFM4_MFS14_I2C_SSR_RDRF                *((volatile unsigned char*)(0x4271C0A8UL))
#define bFM4_MFS14_I2C_SSR_ORE                 *((volatile unsigned char*)(0x4271C0ACUL))
#define bFM4_MFS14_I2C_SSR_TBIE                *((volatile unsigned char*)(0x4271C0B0UL))
#define bFM4_MFS14_I2C_SSR_DMA                 *((volatile unsigned char*)(0x4271C0B4UL))
#define bFM4_MFS14_I2C_SSR_TSET                *((volatile unsigned char*)(0x4271C0B8UL))
#define bFM4_MFS14_I2C_SSR_REC                 *((volatile unsigned char*)(0x4271C0BCUL))
#define bFM4_MFS14_I2C_ISBA_SA0                *((volatile unsigned char*)(0x4271C200UL))
#define bFM4_MFS14_I2C_ISBA_SA1                *((volatile unsigned char*)(0x4271C204UL))
#define bFM4_MFS14_I2C_ISBA_SA2                *((volatile unsigned char*)(0x4271C208UL))
#define bFM4_MFS14_I2C_ISBA_SA3                *((volatile unsigned char*)(0x4271C20CUL))
#define bFM4_MFS14_I2C_ISBA_SA4                *((volatile unsigned char*)(0x4271C210UL))
#define bFM4_MFS14_I2C_ISBA_SA5                *((volatile unsigned char*)(0x4271C214UL))
#define bFM4_MFS14_I2C_ISBA_SA6                *((volatile unsigned char*)(0x4271C218UL))
#define bFM4_MFS14_I2C_ISBA_SAEN               *((volatile unsigned char*)(0x4271C21CUL))
#define bFM4_MFS14_I2C_ISMK_SM0                *((volatile unsigned char*)(0x4271C220UL))
#define bFM4_MFS14_I2C_ISMK_SM1                *((volatile unsigned char*)(0x4271C224UL))
#define bFM4_MFS14_I2C_ISMK_SM2                *((volatile unsigned char*)(0x4271C228UL))
#define bFM4_MFS14_I2C_ISMK_SM3                *((volatile unsigned char*)(0x4271C22CUL))
#define bFM4_MFS14_I2C_ISMK_SM4                *((volatile unsigned char*)(0x4271C230UL))
#define bFM4_MFS14_I2C_ISMK_SM5                *((volatile unsigned char*)(0x4271C234UL))
#define bFM4_MFS14_I2C_ISMK_SM6                *((volatile unsigned char*)(0x4271C238UL))
#define bFM4_MFS14_I2C_ISMK_EN                 *((volatile unsigned char*)(0x4271C23CUL))
#define bFM4_MFS14_I2C_FCR_FE1                 *((volatile unsigned char*)(0x4271C280UL))
#define bFM4_MFS14_I2C_FCR_FE2                 *((volatile unsigned char*)(0x4271C284UL))
#define bFM4_MFS14_I2C_FCR_FCL1                *((volatile unsigned char*)(0x4271C288UL))
#define bFM4_MFS14_I2C_FCR_FCL2                *((volatile unsigned char*)(0x4271C28CUL))
#define bFM4_MFS14_I2C_FCR_FSET                *((volatile unsigned char*)(0x4271C290UL))
#define bFM4_MFS14_I2C_FCR_FLD                 *((volatile unsigned char*)(0x4271C294UL))
#define bFM4_MFS14_I2C_FCR_FLST                *((volatile unsigned char*)(0x4271C298UL))
#define bFM4_MFS14_I2C_FCR_FSEL                *((volatile unsigned char*)(0x4271C2A0UL))
#define bFM4_MFS14_I2C_FCR_FTIE                *((volatile unsigned char*)(0x4271C2A4UL))
#define bFM4_MFS14_I2C_FCR_FDRQ                *((volatile unsigned char*)(0x4271C2A8UL))
#define bFM4_MFS14_I2C_FCR_FRIIE               *((volatile unsigned char*)(0x4271C2ACUL))
#define bFM4_MFS14_I2C_FCR_FLSTE               *((volatile unsigned char*)(0x4271C2B0UL))
#define bFM4_MFS14_I2C_FCR0_FE1                *((volatile unsigned char*)(0x4271C280UL))
#define bFM4_MFS14_I2C_FCR0_FE2                *((volatile unsigned char*)(0x4271C284UL))
#define bFM4_MFS14_I2C_FCR0_FCL1               *((volatile unsigned char*)(0x4271C288UL))
#define bFM4_MFS14_I2C_FCR0_FCL2               *((volatile unsigned char*)(0x4271C28CUL))
#define bFM4_MFS14_I2C_FCR0_FSET               *((volatile unsigned char*)(0x4271C290UL))
#define bFM4_MFS14_I2C_FCR0_FLD                *((volatile unsigned char*)(0x4271C294UL))
#define bFM4_MFS14_I2C_FCR0_FLST               *((volatile unsigned char*)(0x4271C298UL))
#define bFM4_MFS14_I2C_FCR1_FSEL               *((volatile unsigned char*)(0x4271C2A0UL))
#define bFM4_MFS14_I2C_FCR1_FTIE               *((volatile unsigned char*)(0x4271C2A4UL))
#define bFM4_MFS14_I2C_FCR1_FDRQ               *((volatile unsigned char*)(0x4271C2A8UL))
#define bFM4_MFS14_I2C_FCR1_FRIIE              *((volatile unsigned char*)(0x4271C2ACUL))
#define bFM4_MFS14_I2C_FCR1_FLSTE              *((volatile unsigned char*)(0x4271C2B0UL))
#define bFM4_MFS14_I2C_FBYTE_FD0               *((volatile unsigned char*)(0x4271C300UL))
#define bFM4_MFS14_I2C_FBYTE_FD1               *((volatile unsigned char*)(0x4271C304UL))
#define bFM4_MFS14_I2C_FBYTE_FD2               *((volatile unsigned char*)(0x4271C308UL))
#define bFM4_MFS14_I2C_FBYTE_FD3               *((volatile unsigned char*)(0x4271C30CUL))
#define bFM4_MFS14_I2C_FBYTE_FD4               *((volatile unsigned char*)(0x4271C310UL))
#define bFM4_MFS14_I2C_FBYTE_FD5               *((volatile unsigned char*)(0x4271C314UL))
#define bFM4_MFS14_I2C_FBYTE_FD6               *((volatile unsigned char*)(0x4271C318UL))
#define bFM4_MFS14_I2C_FBYTE_FD7               *((volatile unsigned char*)(0x4271C31CUL))
#define bFM4_MFS14_I2C_FBYTE_FD8               *((volatile unsigned char*)(0x4271C320UL))
#define bFM4_MFS14_I2C_FBYTE_FD9               *((volatile unsigned char*)(0x4271C324UL))
#define bFM4_MFS14_I2C_FBYTE_FD10              *((volatile unsigned char*)(0x4271C328UL))
#define bFM4_MFS14_I2C_FBYTE_FD11              *((volatile unsigned char*)(0x4271C32CUL))
#define bFM4_MFS14_I2C_FBYTE_FD12              *((volatile unsigned char*)(0x4271C330UL))
#define bFM4_MFS14_I2C_FBYTE_FD13              *((volatile unsigned char*)(0x4271C334UL))
#define bFM4_MFS14_I2C_FBYTE_FD14              *((volatile unsigned char*)(0x4271C338UL))
#define bFM4_MFS14_I2C_FBYTE_FD15              *((volatile unsigned char*)(0x4271C33CUL))
#define bFM4_MFS14_I2C_FBYTE1_FD0              *((volatile unsigned char*)(0x4271C300UL))
#define bFM4_MFS14_I2C_FBYTE1_FD1              *((volatile unsigned char*)(0x4271C304UL))
#define bFM4_MFS14_I2C_FBYTE1_FD2              *((volatile unsigned char*)(0x4271C308UL))
#define bFM4_MFS14_I2C_FBYTE1_FD3              *((volatile unsigned char*)(0x4271C30CUL))
#define bFM4_MFS14_I2C_FBYTE1_FD4              *((volatile unsigned char*)(0x4271C310UL))
#define bFM4_MFS14_I2C_FBYTE1_FD5              *((volatile unsigned char*)(0x4271C314UL))
#define bFM4_MFS14_I2C_FBYTE1_FD6              *((volatile unsigned char*)(0x4271C318UL))
#define bFM4_MFS14_I2C_FBYTE1_FD7              *((volatile unsigned char*)(0x4271C31CUL))
#define bFM4_MFS14_I2C_FBYTE2_FD8              *((volatile unsigned char*)(0x4271C320UL))
#define bFM4_MFS14_I2C_FBYTE2_FD9              *((volatile unsigned char*)(0x4271C324UL))
#define bFM4_MFS14_I2C_FBYTE2_FD10             *((volatile unsigned char*)(0x4271C328UL))
#define bFM4_MFS14_I2C_FBYTE2_FD11             *((volatile unsigned char*)(0x4271C32CUL))
#define bFM4_MFS14_I2C_FBYTE2_FD12             *((volatile unsigned char*)(0x4271C330UL))
#define bFM4_MFS14_I2C_FBYTE2_FD13             *((volatile unsigned char*)(0x4271C334UL))
#define bFM4_MFS14_I2C_FBYTE2_FD14             *((volatile unsigned char*)(0x4271C338UL))
#define bFM4_MFS14_I2C_FBYTE2_FD15             *((volatile unsigned char*)(0x4271C33CUL))

