sol4ik/audio-steganography/try/fm4/s6e2cc_i2s_sk-fm4-176l-s6se2cc-v10/common/s6e2cc.h
/* External bus interface registers */
#define bFM4_EXBUS_MODE0_WDTH0                 *((volatile unsigned int*)(0x427E0000UL))
#define bFM4_EXBUS_MODE0_WDTH1                 *((volatile unsigned int*)(0x427E0004UL))
#define bFM4_EXBUS_MODE0_RBMON                 *((volatile unsigned int*)(0x427E0008UL))
#define bFM4_EXBUS_MODE0_WEOFF                 *((volatile unsigned int*)(0x427E000CUL))
#define bFM4_EXBUS_MODE0_NAND                  *((volatile unsigned int*)(0x427E0010UL))
#define bFM4_EXBUS_MODE0_PAGE                  *((volatile unsigned int*)(0x427E0014UL))
#define bFM4_EXBUS_MODE0_RDY                   *((volatile unsigned int*)(0x427E0018UL))
#define bFM4_EXBUS_MODE0_SHRTDOUT              *((volatile unsigned int*)(0x427E001CUL))
#define bFM4_EXBUS_MODE0_MPXMODE               *((volatile unsigned int*)(0x427E0020UL))
#define bFM4_EXBUS_MODE0_ALEINV                *((volatile unsigned int*)(0x427E0024UL))
#define bFM4_EXBUS_MODE0_MPXDOFF               *((volatile unsigned int*)(0x427E002CUL))
#define bFM4_EXBUS_MODE0_MPXCSOF               *((volatile unsigned int*)(0x427E0030UL))
#define bFM4_EXBUS_MODE0_MOEXEUP               *((volatile unsigned int*)(0x427E0034UL))
#define bFM4_EXBUS_MODE1_WDTH0                 *((volatile unsigned int*)(0x427E0080UL))
#define bFM4_EXBUS_MODE1_WDTH1                 *((volatile unsigned int*)(0x427E0084UL))
#define bFM4_EXBUS_MODE1_RBMON                 *((volatile unsigned int*)(0x427E0088UL))
#define bFM4_EXBUS_MODE1_WEOFF                 *((volatile unsigned int*)(0x427E008CUL))
#define bFM4_EXBUS_MODE1_NAND                  *((volatile unsigned int*)(0x427E0090UL))
#define bFM4_EXBUS_MODE1_PAGE                  *((volatile unsigned int*)(0x427E0094UL))
#define bFM4_EXBUS_MODE1_RDY                   *((volatile unsigned int*)(0x427E0098UL))
#define bFM4_EXBUS_MODE1_SHRTDOUT              *((volatile unsigned int*)(0x427E009CUL))
#define bFM4_EXBUS_MODE1_MPXMODE               *((volatile unsigned int*)(0x427E00A0UL))
#define bFM4_EXBUS_MODE1_ALEINV                *((volatile unsigned int*)(0x427E00A4UL))
#define bFM4_EXBUS_MODE1_MPXDOFF               *((volatile unsigned int*)(0x427E00ACUL))
#define bFM4_EXBUS_MODE1_MPXCSOF               *((volatile unsigned int*)(0x427E00B0UL))
#define bFM4_EXBUS_MODE1_MOEXEUP               *((volatile unsigned int*)(0x427E00B4UL))
#define bFM4_EXBUS_MODE2_WDTH0                 *((volatile unsigned int*)(0x427E0100UL))
#define bFM4_EXBUS_MODE2_WDTH1                 *((volatile unsigned int*)(0x427E0104UL))
#define bFM4_EXBUS_MODE2_RBMON                 *((volatile unsigned int*)(0x427E0108UL))
#define bFM4_EXBUS_MODE2_WEOFF                 *((volatile unsigned int*)(0x427E010CUL))
#define bFM4_EXBUS_MODE2_NAND                  *((volatile unsigned int*)(0x427E0110UL))
#define bFM4_EXBUS_MODE2_PAGE                  *((volatile unsigned int*)(0x427E0114UL))
#define bFM4_EXBUS_MODE2_RDY                   *((volatile unsigned int*)(0x427E0118UL))
#define bFM4_EXBUS_MODE2_SHRTDOUT              *((volatile unsigned int*)(0x427E011CUL))
#define bFM4_EXBUS_MODE2_MPXMODE               *((volatile unsigned int*)(0x427E0120UL))
#define bFM4_EXBUS_MODE2_ALEINV                *((volatile unsigned int*)(0x427E0124UL))
#define bFM4_EXBUS_MODE2_MPXDOFF               *((volatile unsigned int*)(0x427E012CUL))
#define bFM4_EXBUS_MODE2_MPXCSOF               *((volatile unsigned int*)(0x427E0130UL))
#define bFM4_EXBUS_MODE2_MOEXEUP               *((volatile unsigned int*)(0x427E0134UL))
#define bFM4_EXBUS_MODE3_WDTH0                 *((volatile unsigned int*)(0x427E0180UL))
#define bFM4_EXBUS_MODE3_WDTH1                 *((volatile unsigned int*)(0x427E0184UL))
#define bFM4_EXBUS_MODE3_RBMON                 *((volatile unsigned int*)(0x427E0188UL))
#define bFM4_EXBUS_MODE3_WEOFF                 *((volatile unsigned int*)(0x427E018CUL))
#define bFM4_EXBUS_MODE3_NAND                  *((volatile unsigned int*)(0x427E0190UL))
#define bFM4_EXBUS_MODE3_PAGE                  *((volatile unsigned int*)(0x427E0194UL))
#define bFM4_EXBUS_MODE3_RDY                   *((volatile unsigned int*)(0x427E0198UL))
#define bFM4_EXBUS_MODE3_SHRTDOUT              *((volatile unsigned int*)(0x427E019CUL))
#define bFM4_EXBUS_MODE3_MPXMODE               *((volatile unsigned int*)(0x427E01A0UL))
#define bFM4_EXBUS_MODE3_ALEINV                *((volatile unsigned int*)(0x427E01A4UL))
#define bFM4_EXBUS_MODE3_MPXDOFF               *((volatile unsigned int*)(0x427E01ACUL))
#define bFM4_EXBUS_MODE3_MPXCSOF               *((volatile unsigned int*)(0x427E01B0UL))
#define bFM4_EXBUS_MODE3_MOEXEUP               *((volatile unsigned int*)(0x427E01B4UL))
#define bFM4_EXBUS_MODE4_WDTH0                 *((volatile unsigned int*)(0x427E0200UL))
#define bFM4_EXBUS_MODE4_WDTH1                 *((volatile unsigned int*)(0x427E0204UL))
#define bFM4_EXBUS_MODE4_RBMON                 *((volatile unsigned int*)(0x427E0208UL))
#define bFM4_EXBUS_MODE4_WEOFF                 *((volatile unsigned int*)(0x427E020CUL))
#define bFM4_EXBUS_MODE4_NAND                  *((volatile unsigned int*)(0x427E0210UL))
#define bFM4_EXBUS_MODE4_PAGE                  *((volatile unsigned int*)(0x427E0214UL))
#define bFM4_EXBUS_MODE4_RDY                   *((volatile unsigned int*)(0x427E0218UL))
#define bFM4_EXBUS_MODE4_SHRTDOUT              *((volatile unsigned int*)(0x427E021CUL))
#define bFM4_EXBUS_MODE4_MPXMODE               *((volatile unsigned int*)(0x427E0220UL))
#define bFM4_EXBUS_MODE4_ALEINV                *((volatile unsigned int*)(0x427E0224UL))
#define bFM4_EXBUS_MODE4_MPXDOFF               *((volatile unsigned int*)(0x427E022CUL))
#define bFM4_EXBUS_MODE4_MPXCSOF               *((volatile unsigned int*)(0x427E0230UL))
#define bFM4_EXBUS_MODE4_MOEXEUP               *((volatile unsigned int*)(0x427E0234UL))
#define bFM4_EXBUS_MODE5_WDTH0                 *((volatile unsigned int*)(0x427E0280UL))
#define bFM4_EXBUS_MODE5_WDTH1                 *((volatile unsigned int*)(0x427E0284UL))
#define bFM4_EXBUS_MODE5_RBMON                 *((volatile unsigned int*)(0x427E0288UL))
#define bFM4_EXBUS_MODE5_WEOFF                 *((volatile unsigned int*)(0x427E028CUL))
#define bFM4_EXBUS_MODE5_NAND                  *((volatile unsigned int*)(0x427E0290UL))
#define bFM4_EXBUS_MODE5_PAGE                  *((volatile unsigned int*)(0x427E0294UL))
#define bFM4_EXBUS_MODE5_RDY                   *((volatile unsigned int*)(0x427E0298UL))
#define bFM4_EXBUS_MODE5_SHRTDOUT              *((volatile unsigned int*)(0x427E029CUL))
#define bFM4_EXBUS_MODE5_MPXMODE               *((volatile unsigned int*)(0x427E02A0UL))
#define bFM4_EXBUS_MODE5_ALEINV                *((volatile unsigned int*)(0x427E02A4UL))
#define bFM4_EXBUS_MODE5_MPXDOFF               *((volatile unsigned int*)(0x427E02ACUL))
#define bFM4_EXBUS_MODE5_MPXCSOF               *((volatile unsigned int*)(0x427E02B0UL))
#define bFM4_EXBUS_MODE5_MOEXEUP               *((volatile unsigned int*)(0x427E02B4UL))
#define bFM4_EXBUS_MODE6_WDTH0                 *((volatile unsigned int*)(0x427E0300UL))
#define bFM4_EXBUS_MODE6_WDTH1                 *((volatile unsigned int*)(0x427E0304UL))
#define bFM4_EXBUS_MODE6_RBMON                 *((volatile unsigned int*)(0x427E0308UL))
#define bFM4_EXBUS_MODE6_WEOFF                 *((volatile unsigned int*)(0x427E030CUL))
#define bFM4_EXBUS_MODE6_NAND                  *((volatile unsigned int*)(0x427E0310UL))
#define bFM4_EXBUS_MODE6_PAGE                  *((volatile unsigned int*)(0x427E0314UL))
#define bFM4_EXBUS_MODE6_RDY                   *((volatile unsigned int*)(0x427E0318UL))
#define bFM4_EXBUS_MODE6_SHRTDOUT              *((volatile unsigned int*)(0x427E031CUL))
#define bFM4_EXBUS_MODE6_MPXMODE               *((volatile unsigned int*)(0x427E0320UL))
#define bFM4_EXBUS_MODE6_ALEINV                *((volatile unsigned int*)(0x427E0324UL))
#define bFM4_EXBUS_MODE6_MPXDOFF               *((volatile unsigned int*)(0x427E032CUL))
#define bFM4_EXBUS_MODE6_MPXCSOF               *((volatile unsigned int*)(0x427E0330UL))
#define bFM4_EXBUS_MODE6_MOEXEUP               *((volatile unsigned int*)(0x427E0334UL))
#define bFM4_EXBUS_MODE7_WDTH0                 *((volatile unsigned int*)(0x427E0380UL))
#define bFM4_EXBUS_MODE7_WDTH1                 *((volatile unsigned int*)(0x427E0384UL))
#define bFM4_EXBUS_MODE7_RBMON                 *((volatile unsigned int*)(0x427E0388UL))
#define bFM4_EXBUS_MODE7_WEOFF                 *((volatile unsigned int*)(0x427E038CUL))
#define bFM4_EXBUS_MODE7_NAND                  *((volatile unsigned int*)(0x427E0390UL))
#define bFM4_EXBUS_MODE7_PAGE                  *((volatile unsigned int*)(0x427E0394UL))
#define bFM4_EXBUS_MODE7_RDY                   *((volatile unsigned int*)(0x427E0398UL))
#define bFM4_EXBUS_MODE7_SHRTDOUT              *((volatile unsigned int*)(0x427E039CUL))
#define bFM4_EXBUS_MODE7_MPXMODE               *((volatile unsigned int*)(0x427E03A0UL))
#define bFM4_EXBUS_MODE7_ALEINV                *((volatile unsigned int*)(0x427E03A4UL))
#define bFM4_EXBUS_MODE7_MPXDOFF               *((volatile unsigned int*)(0x427E03ACUL))
#define bFM4_EXBUS_MODE7_MPXCSOF               *((volatile unsigned int*)(0x427E03B0UL))
#define bFM4_EXBUS_MODE7_MOEXEUP               *((volatile unsigned int*)(0x427E03B4UL))
#define bFM4_EXBUS_TIM0_RACC0                  *((volatile unsigned int*)(0x427E0400UL))
#define bFM4_EXBUS_TIM0_RACC1                  *((volatile unsigned int*)(0x427E0404UL))
#define bFM4_EXBUS_TIM0_RACC2                  *((volatile unsigned int*)(0x427E0408UL))
#define bFM4_EXBUS_TIM0_RACC3                  *((volatile unsigned int*)(0x427E040CUL))
#define bFM4_EXBUS_TIM0_RADC0                  *((volatile unsigned int*)(0x427E0410UL))
#define bFM4_EXBUS_TIM0_RADC1                  *((volatile unsigned int*)(0x427E0414UL))
#define bFM4_EXBUS_TIM0_RADC2                  *((volatile unsigned int*)(0x427E0418UL))
#define bFM4_EXBUS_TIM0_RADC3                  *((volatile unsigned int*)(0x427E041CUL))
#define bFM4_EXBUS_TIM0_FRADC0                 *((volatile unsigned int*)(0x427E0420UL))
#define bFM4_EXBUS_TIM0_FRADC1                 *((volatile unsigned int*)(0x427E0424UL))
#define bFM4_EXBUS_TIM0_FRADC2                 *((volatile unsigned int*)(0x427E0428UL))
#define bFM4_EXBUS_TIM0_FRADC3                 *((volatile unsigned int*)(0x427E042CUL))
#define bFM4_EXBUS_TIM0_RIDLC0                 *((volatile unsigned int*)(0x427E0430UL))
#define bFM4_EXBUS_TIM0_RIDLC1                 *((volatile unsigned int*)(0x427E0434UL))
#define bFM4_EXBUS_TIM0_RIDLC2                 *((volatile unsigned int*)(0x427E0438UL))
#define bFM4_EXBUS_TIM0_RIDLC3                 *((volatile unsigned int*)(0x427E043CUL))
#define bFM4_EXBUS_TIM0_WACC0                  *((volatile unsigned int*)(0x427E0440UL))
#define bFM4_EXBUS_TIM0_WACC1                  *((volatile unsigned int*)(0x427E0444UL))
#define bFM4_EXBUS_TIM0_WACC2                  *((volatile unsigned int*)(0x427E0448UL))
#define bFM4_EXBUS_TIM0_WACC3                  *((volatile unsigned int*)(0x427E044CUL))
#define bFM4_EXBUS_TIM0_WADC0                  *((volatile unsigned int*)(0x427E0450UL))
#define bFM4_EXBUS_TIM0_WADC1                  *((volatile unsigned int*)(0x427E0454UL))
#define bFM4_EXBUS_TIM0_WADC2                  *((volatile unsigned int*)(0x427E0458UL))
#define bFM4_EXBUS_TIM0_WADC3                  *((volatile unsigned int*)(0x427E045CUL))
#define bFM4_EXBUS_TIM0_WWEC0                  *((volatile unsigned int*)(0x427E0460UL))
#define bFM4_EXBUS_TIM0_WWEC1                  *((volatile unsigned int*)(0x427E0464UL))
#define bFM4_EXBUS_TIM0_WWEC2                  *((volatile unsigned int*)(0x427E0468UL))
#define bFM4_EXBUS_TIM0_WWEC3                  *((volatile unsigned int*)(0x427E046CUL))
#define bFM4_EXBUS_TIM0_WIDLC0                 *((volatile unsigned int*)(0x427E0470UL))
#define bFM4_EXBUS_TIM0_WIDLC1                 *((volatile unsigned int*)(0x427E0474UL))
#define bFM4_EXBUS_TIM0_WIDLC2                 *((volatile unsigned int*)(0x427E0478UL))
#define bFM4_EXBUS_TIM0_WIDLC3                 *((volatile unsigned int*)(0x427E047CUL))
#define bFM4_EXBUS_TIM1_RACC0                  *((volatile unsigned int*)(0x427E0480UL))
#define bFM4_EXBUS_TIM1_RACC1                  *((volatile unsigned int*)(0x427E0484UL))
#define bFM4_EXBUS_TIM1_RACC2                  *((volatile unsigned int*)(0x427E0488UL))
#define bFM4_EXBUS_TIM1_RACC3                  *((volatile unsigned int*)(0x427E048CUL))
#define bFM4_EXBUS_TIM1_RADC0                  *((volatile unsigned int*)(0x427E0490UL))
#define bFM4_EXBUS_TIM1_RADC1                  *((volatile unsigned int*)(0x427E0494UL))
#define bFM4_EXBUS_TIM1_RADC2                  *((volatile unsigned int*)(0x427E0498UL))
#define bFM4_EXBUS_TIM1_RADC3                  *((volatile unsigned int*)(0x427E049CUL))
#define bFM4_EXBUS_TIM1_FRADC0                 *((volatile unsigned int*)(0x427E04A0UL))
#define bFM4_EXBUS_TIM1_FRADC1                 *((volatile unsigned int*)(0x427E04A4UL))
#define bFM4_EXBUS_TIM1_FRADC2                 *((volatile unsigned int*)(0x427E04A8UL))
#define bFM4_EXBUS_TIM1_FRADC3                 *((volatile unsigned int*)(0x427E04ACUL))
#define bFM4_EXBUS_TIM1_RIDLC0                 *((volatile unsigned int*)(0x427E04B0UL))
#define bFM4_EXBUS_TIM1_RIDLC1                 *((volatile unsigned int*)(0x427E04B4UL))
#define bFM4_EXBUS_TIM1_RIDLC2                 *((volatile unsigned int*)(0x427E04B8UL))
#define bFM4_EXBUS_TIM1_RIDLC3                 *((volatile unsigned int*)(0x427E04BCUL))
#define bFM4_EXBUS_TIM1_WACC0                  *((volatile unsigned int*)(0x427E04C0UL))
#define bFM4_EXBUS_TIM1_WACC1                  *((volatile unsigned int*)(0x427E04C4UL))
#define bFM4_EXBUS_TIM1_WACC2                  *((volatile unsigned int*)(0x427E04C8UL))
#define bFM4_EXBUS_TIM1_WACC3                  *((volatile unsigned int*)(0x427E04CCUL))
#define bFM4_EXBUS_TIM1_WADC0                  *((volatile unsigned int*)(0x427E04D0UL))
#define bFM4_EXBUS_TIM1_WADC1                  *((volatile unsigned int*)(0x427E04D4UL))
#define bFM4_EXBUS_TIM1_WADC2                  *((volatile unsigned int*)(0x427E04D8UL))
#define bFM4_EXBUS_TIM1_WADC3                  *((volatile unsigned int*)(0x427E04DCUL))
#define bFM4_EXBUS_TIM1_WWEC0                  *((volatile unsigned int*)(0x427E04E0UL))
#define bFM4_EXBUS_TIM1_WWEC1                  *((volatile unsigned int*)(0x427E04E4UL))
#define bFM4_EXBUS_TIM1_WWEC2                  *((volatile unsigned int*)(0x427E04E8UL))
#define bFM4_EXBUS_TIM1_WWEC3                  *((volatile unsigned int*)(0x427E04ECUL))
#define bFM4_EXBUS_TIM1_WIDLC0                 *((volatile unsigned int*)(0x427E04F0UL))
#define bFM4_EXBUS_TIM1_WIDLC1                 *((volatile unsigned int*)(0x427E04F4UL))
#define bFM4_EXBUS_TIM1_WIDLC2                 *((volatile unsigned int*)(0x427E04F8UL))
#define bFM4_EXBUS_TIM1_WIDLC3                 *((volatile unsigned int*)(0x427E04FCUL))
#define bFM4_EXBUS_TIM2_RACC0                  *((volatile unsigned int*)(0x427E0500UL))
#define bFM4_EXBUS_TIM2_RACC1                  *((volatile unsigned int*)(0x427E0504UL))
#define bFM4_EXBUS_TIM2_RACC2                  *((volatile unsigned int*)(0x427E0508UL))
#define bFM4_EXBUS_TIM2_RACC3                  *((volatile unsigned int*)(0x427E050CUL))
#define bFM4_EXBUS_TIM2_RADC0                  *((volatile unsigned int*)(0x427E0510UL))
#define bFM4_EXBUS_TIM2_RADC1                  *((volatile unsigned int*)(0x427E0514UL))
#define bFM4_EXBUS_TIM2_RADC2                  *((volatile unsigned int*)(0x427E0518UL))
#define bFM4_EXBUS_TIM2_RADC3                  *((volatile unsigned int*)(0x427E051CUL))
#define bFM4_EXBUS_TIM2_FRADC0                 *((volatile unsigned int*)(0x427E0520UL))
#define bFM4_EXBUS_TIM2_FRADC1                 *((volatile unsigned int*)(0x427E0524UL))
#define bFM4_EXBUS_TIM2_FRADC2                 *((volatile unsigned int*)(0x427E0528UL))
#define bFM4_EXBUS_TIM2_FRADC3                 *((volatile unsigned int*)(0x427E052CUL))
#define bFM4_EXBUS_TIM2_RIDLC0                 *((volatile unsigned int*)(0x427E0530UL))
#define bFM4_EXBUS_TIM2_RIDLC1                 *((volatile unsigned int*)(0x427E0534UL))
#define bFM4_EXBUS_TIM2_RIDLC2                 *((volatile unsigned int*)(0x427E0538UL))
#define bFM4_EXBUS_TIM2_RIDLC3                 *((volatile unsigned int*)(0x427E053CUL))
#define bFM4_EXBUS_TIM2_WACC0                  *((volatile unsigned int*)(0x427E0540UL))
#define bFM4_EXBUS_TIM2_WACC1                  *((volatile unsigned int*)(0x427E0544UL))
#define bFM4_EXBUS_TIM2_WACC2                  *((volatile unsigned int*)(0x427E0548UL))
#define bFM4_EXBUS_TIM2_WACC3                  *((volatile unsigned int*)(0x427E054CUL))
#define bFM4_EXBUS_TIM2_WADC0                  *((volatile unsigned int*)(0x427E0550UL))
#define bFM4_EXBUS_TIM2_WADC1                  *((volatile unsigned int*)(0x427E0554UL))
#define bFM4_EXBUS_TIM2_WADC2                  *((volatile unsigned int*)(0x427E0558UL))
#define bFM4_EXBUS_TIM2_WADC3                  *((volatile unsigned int*)(0x427E055CUL))
#define bFM4_EXBUS_TIM2_WWEC0                  *((volatile unsigned int*)(0x427E0560UL))
#define bFM4_EXBUS_TIM2_WWEC1                  *((volatile unsigned int*)(0x427E0564UL))
#define bFM4_EXBUS_TIM2_WWEC2                  *((volatile unsigned int*)(0x427E0568UL))
#define bFM4_EXBUS_TIM2_WWEC3                  *((volatile unsigned int*)(0x427E056CUL))
#define bFM4_EXBUS_TIM2_WIDLC0                 *((volatile unsigned int*)(0x427E0570UL))
#define bFM4_EXBUS_TIM2_WIDLC1                 *((volatile unsigned int*)(0x427E0574UL))
#define bFM4_EXBUS_TIM2_WIDLC2                 *((volatile unsigned int*)(0x427E0578UL))
#define bFM4_EXBUS_TIM2_WIDLC3                 *((volatile unsigned int*)(0x427E057CUL))
#define bFM4_EXBUS_TIM3_RACC0                  *((volatile unsigned int*)(0x427E0580UL))
#define bFM4_EXBUS_TIM3_RACC1                  *((volatile unsigned int*)(0x427E0584UL))
#define bFM4_EXBUS_TIM3_RACC2                  *((volatile unsigned int*)(0x427E0588UL))
#define bFM4_EXBUS_TIM3_RACC3                  *((volatile unsigned int*)(0x427E058CUL))
#define bFM4_EXBUS_TIM3_RADC0                  *((volatile unsigned int*)(0x427E0590UL))
#define bFM4_EXBUS_TIM3_RADC1                  *((volatile unsigned int*)(0x427E0594UL))
#define bFM4_EXBUS_TIM3_RADC2                  *((volatile unsigned int*)(0x427E0598UL))
#define bFM4_EXBUS_TIM3_RADC3                  *((volatile unsigned int*)(0x427E059CUL))
#define bFM4_EXBUS_TIM3_FRADC0                 *((volatile unsigned int*)(0x427E05A0UL))
#define bFM4_EXBUS_TIM3_FRADC1                 *((volatile unsigned int*)(0x427E05A4UL))
#define bFM4_EXBUS_TIM3_FRADC2                 *((volatile unsigned int*)(0x427E05A8UL))
#define bFM4_EXBUS_TIM3_FRADC3                 *((volatile unsigned int*)(0x427E05ACUL))
#define bFM4_EXBUS_TIM3_RIDLC0                 *((volatile unsigned int*)(0x427E05B0UL))
#define bFM4_EXBUS_TIM3_RIDLC1                 *((volatile unsigned int*)(0x427E05B4UL))
#define bFM4_EXBUS_TIM3_RIDLC2                 *((volatile unsigned int*)(0x427E05B8UL))
#define bFM4_EXBUS_TIM3_RIDLC3                 *((volatile unsigned int*)(0x427E05BCUL))
#define bFM4_EXBUS_TIM3_WACC0                  *((volatile unsigned int*)(0x427E05C0UL))
#define bFM4_EXBUS_TIM3_WACC1                  *((volatile unsigned int*)(0x427E05C4UL))
#define bFM4_EXBUS_TIM3_WACC2                  *((volatile unsigned int*)(0x427E05C8UL))
#define bFM4_EXBUS_TIM3_WACC3                  *((volatile unsigned int*)(0x427E05CCUL))
#define bFM4_EXBUS_TIM3_WADC0                  *((volatile unsigned int*)(0x427E05D0UL))
#define bFM4_EXBUS_TIM3_WADC1                  *((volatile unsigned int*)(0x427E05D4UL))
#define bFM4_EXBUS_TIM3_WADC2                  *((volatile unsigned int*)(0x427E05D8UL))
#define bFM4_EXBUS_TIM3_WADC3                  *((volatile unsigned int*)(0x427E05DCUL))
#define bFM4_EXBUS_TIM3_WWEC0                  *((volatile unsigned int*)(0x427E05E0UL))
#define bFM4_EXBUS_TIM3_WWEC1                  *((volatile unsigned int*)(0x427E05E4UL))
#define bFM4_EXBUS_TIM3_WWEC2                  *((volatile unsigned int*)(0x427E05E8UL))
#define bFM4_EXBUS_TIM3_WWEC3                  *((volatile unsigned int*)(0x427E05ECUL))
#define bFM4_EXBUS_TIM3_WIDLC0                 *((volatile unsigned int*)(0x427E05F0UL))
#define bFM4_EXBUS_TIM3_WIDLC1                 *((volatile unsigned int*)(0x427E05F4UL))
#define bFM4_EXBUS_TIM3_WIDLC2                 *((volatile unsigned int*)(0x427E05F8UL))
#define bFM4_EXBUS_TIM3_WIDLC3                 *((volatile unsigned int*)(0x427E05FCUL))
#define bFM4_EXBUS_TIM4_RACC0                  *((volatile unsigned int*)(0x427E0600UL))
#define bFM4_EXBUS_TIM4_RACC1                  *((volatile unsigned int*)(0x427E0604UL))
#define bFM4_EXBUS_TIM4_RACC2                  *((volatile unsigned int*)(0x427E0608UL))
#define bFM4_EXBUS_TIM4_RACC3                  *((volatile unsigned int*)(0x427E060CUL))
#define bFM4_EXBUS_TIM4_RADC0                  *((volatile unsigned int*)(0x427E0610UL))
#define bFM4_EXBUS_TIM4_RADC1                  *((volatile unsigned int*)(0x427E0614UL))
#define bFM4_EXBUS_TIM4_RADC2                  *((volatile unsigned int*)(0x427E0618UL))
#define bFM4_EXBUS_TIM4_RADC3                  *((volatile unsigned int*)(0x427E061CUL))
#define bFM4_EXBUS_TIM4_FRADC0                 *((volatile unsigned int*)(0x427E0620UL))
#define bFM4_EXBUS_TIM4_FRADC1                 *((volatile unsigned int*)(0x427E0624UL))
#define bFM4_EXBUS_TIM4_FRADC2                 *((volatile unsigned int*)(0x427E0628UL))
#define bFM4_EXBUS_TIM4_FRADC3                 *((volatile unsigned int*)(0x427E062CUL))
#define bFM4_EXBUS_TIM4_RIDLC0                 *((volatile unsigned int*)(0x427E0630UL))
#define bFM4_EXBUS_TIM4_RIDLC1                 *((volatile unsigned int*)(0x427E0634UL))
#define bFM4_EXBUS_TIM4_RIDLC2                 *((volatile unsigned int*)(0x427E0638UL))
#define bFM4_EXBUS_TIM4_RIDLC3                 *((volatile unsigned int*)(0x427E063CUL))
#define bFM4_EXBUS_TIM4_WACC0                  *((volatile unsigned int*)(0x427E0640UL))
#define bFM4_EXBUS_TIM4_WACC1                  *((volatile unsigned int*)(0x427E0644UL))
#define bFM4_EXBUS_TIM4_WACC2                  *((volatile unsigned int*)(0x427E0648UL))
#define bFM4_EXBUS_TIM4_WACC3                  *((volatile unsigned int*)(0x427E064CUL))
#define bFM4_EXBUS_TIM4_WADC0                  *((volatile unsigned int*)(0x427E0650UL))
#define bFM4_EXBUS_TIM4_WADC1                  *((volatile unsigned int*)(0x427E0654UL))
#define bFM4_EXBUS_TIM4_WADC2                  *((volatile unsigned int*)(0x427E0658UL))
#define bFM4_EXBUS_TIM4_WADC3                  *((volatile unsigned int*)(0x427E065CUL))
#define bFM4_EXBUS_TIM4_WWEC0                  *((volatile unsigned int*)(0x427E0660UL))
#define bFM4_EXBUS_TIM4_WWEC1                  *((volatile unsigned int*)(0x427E0664UL))
#define bFM4_EXBUS_TIM4_WWEC2                  *((volatile unsigned int*)(0x427E0668UL))
#define bFM4_EXBUS_TIM4_WWEC3                  *((volatile unsigned int*)(0x427E066CUL))
#define bFM4_EXBUS_TIM4_WIDLC0                 *((volatile unsigned int*)(0x427E0670UL))
#define bFM4_EXBUS_TIM4_WIDLC1                 *((volatile unsigned int*)(0x427E0674UL))
#define bFM4_EXBUS_TIM4_WIDLC2                 *((volatile unsigned int*)(0x427E0678UL))
#define bFM4_EXBUS_TIM4_WIDLC3                 *((volatile unsigned int*)(0x427E067CUL))
#define bFM4_EXBUS_TIM5_RACC0                  *((volatile unsigned int*)(0x427E0680UL))
#define bFM4_EXBUS_TIM5_RACC1                  *((volatile unsigned int*)(0x427E0684UL))
