sol4ik/audio-steganography/try/fm4/s6e2cc_i2s_sk-fm4-176l-s6se2cc-v10/common/s6e2cc.h
#define bFM4_CAN0_NEWDT2_NEWDAT30              *((volatile unsigned char*)(0x42C41274UL))
#define bFM4_CAN0_NEWDT2_NEWDAT31              *((volatile unsigned char*)(0x42C41278UL))
#define bFM4_CAN0_NEWDT2_NEWDAT32              *((volatile unsigned char*)(0x42C4127CUL))
#define bFM4_CAN0_INTPND_INTPND1               *((volatile unsigned char*)(0x42C41400UL))
#define bFM4_CAN0_INTPND_INTPND2               *((volatile unsigned char*)(0x42C41404UL))
#define bFM4_CAN0_INTPND_INTPND3               *((volatile unsigned char*)(0x42C41408UL))
#define bFM4_CAN0_INTPND_INTPND4               *((volatile unsigned char*)(0x42C4140CUL))
#define bFM4_CAN0_INTPND_INTPND5               *((volatile unsigned char*)(0x42C41410UL))
#define bFM4_CAN0_INTPND_INTPND6               *((volatile unsigned char*)(0x42C41414UL))
#define bFM4_CAN0_INTPND_INTPND7               *((volatile unsigned char*)(0x42C41418UL))
#define bFM4_CAN0_INTPND_INTPND8               *((volatile unsigned char*)(0x42C4141CUL))
#define bFM4_CAN0_INTPND_INTPND9               *((volatile unsigned char*)(0x42C41420UL))
#define bFM4_CAN0_INTPND_INTPND10              *((volatile unsigned char*)(0x42C41424UL))
#define bFM4_CAN0_INTPND_INTPND11              *((volatile unsigned char*)(0x42C41428UL))
#define bFM4_CAN0_INTPND_INTPND12              *((volatile unsigned char*)(0x42C4142CUL))
#define bFM4_CAN0_INTPND_INTPND13              *((volatile unsigned char*)(0x42C41430UL))
#define bFM4_CAN0_INTPND_INTPND14              *((volatile unsigned char*)(0x42C41434UL))
#define bFM4_CAN0_INTPND_INTPND15              *((volatile unsigned char*)(0x42C41438UL))
#define bFM4_CAN0_INTPND_INTPND16              *((volatile unsigned char*)(0x42C4143CUL))
#define bFM4_CAN0_INTPND_INTPND17              *((volatile unsigned char*)(0x42C41440UL))
#define bFM4_CAN0_INTPND_INTPND18              *((volatile unsigned char*)(0x42C41444UL))
#define bFM4_CAN0_INTPND_INTPND19              *((volatile unsigned char*)(0x42C41448UL))
#define bFM4_CAN0_INTPND_INTPND20              *((volatile unsigned char*)(0x42C4144CUL))
#define bFM4_CAN0_INTPND_INTPND21              *((volatile unsigned char*)(0x42C41450UL))
#define bFM4_CAN0_INTPND_INTPND22              *((volatile unsigned char*)(0x42C41454UL))
#define bFM4_CAN0_INTPND_INTPND23              *((volatile unsigned char*)(0x42C41458UL))
#define bFM4_CAN0_INTPND_INTPND24              *((volatile unsigned char*)(0x42C4145CUL))
#define bFM4_CAN0_INTPND_INTPND25              *((volatile unsigned char*)(0x42C41460UL))
#define bFM4_CAN0_INTPND_INTPND26              *((volatile unsigned char*)(0x42C41464UL))
#define bFM4_CAN0_INTPND_INTPND27              *((volatile unsigned char*)(0x42C41468UL))
#define bFM4_CAN0_INTPND_INTPND28              *((volatile unsigned char*)(0x42C4146CUL))
#define bFM4_CAN0_INTPND_INTPND29              *((volatile unsigned char*)(0x42C41470UL))
#define bFM4_CAN0_INTPND_INTPND30              *((volatile unsigned char*)(0x42C41474UL))
#define bFM4_CAN0_INTPND_INTPND31              *((volatile unsigned char*)(0x42C41478UL))
#define bFM4_CAN0_INTPND_INTPND32              *((volatile unsigned char*)(0x42C4147CUL))
#define bFM4_CAN0_INTPND1_INTPND1              *((volatile unsigned char*)(0x42C41400UL))
#define bFM4_CAN0_INTPND1_INTPND2              *((volatile unsigned char*)(0x42C41404UL))
#define bFM4_CAN0_INTPND1_INTPND3              *((volatile unsigned char*)(0x42C41408UL))
#define bFM4_CAN0_INTPND1_INTPND4              *((volatile unsigned char*)(0x42C4140CUL))
#define bFM4_CAN0_INTPND1_INTPND5              *((volatile unsigned char*)(0x42C41410UL))
#define bFM4_CAN0_INTPND1_INTPND6              *((volatile unsigned char*)(0x42C41414UL))
#define bFM4_CAN0_INTPND1_INTPND7              *((volatile unsigned char*)(0x42C41418UL))
#define bFM4_CAN0_INTPND1_INTPND8              *((volatile unsigned char*)(0x42C4141CUL))
#define bFM4_CAN0_INTPND1_INTPND9              *((volatile unsigned char*)(0x42C41420UL))
#define bFM4_CAN0_INTPND1_INTPND10             *((volatile unsigned char*)(0x42C41424UL))
#define bFM4_CAN0_INTPND1_INTPND11             *((volatile unsigned char*)(0x42C41428UL))
#define bFM4_CAN0_INTPND1_INTPND12             *((volatile unsigned char*)(0x42C4142CUL))
#define bFM4_CAN0_INTPND1_INTPND13             *((volatile unsigned char*)(0x42C41430UL))
#define bFM4_CAN0_INTPND1_INTPND14             *((volatile unsigned char*)(0x42C41434UL))
#define bFM4_CAN0_INTPND1_INTPND15             *((volatile unsigned char*)(0x42C41438UL))
#define bFM4_CAN0_INTPND1_INTPND16             *((volatile unsigned char*)(0x42C4143CUL))
#define bFM4_CAN0_INTPND2_INTPND17             *((volatile unsigned char*)(0x42C41440UL))
#define bFM4_CAN0_INTPND2_INTPND18             *((volatile unsigned char*)(0x42C41444UL))
#define bFM4_CAN0_INTPND2_INTPND19             *((volatile unsigned char*)(0x42C41448UL))
#define bFM4_CAN0_INTPND2_INTPND20             *((volatile unsigned char*)(0x42C4144CUL))
#define bFM4_CAN0_INTPND2_INTPND21             *((volatile unsigned char*)(0x42C41450UL))
#define bFM4_CAN0_INTPND2_INTPND22             *((volatile unsigned char*)(0x42C41454UL))
#define bFM4_CAN0_INTPND2_INTPND23             *((volatile unsigned char*)(0x42C41458UL))
#define bFM4_CAN0_INTPND2_INTPND24             *((volatile unsigned char*)(0x42C4145CUL))
#define bFM4_CAN0_INTPND2_INTPND25             *((volatile unsigned char*)(0x42C41460UL))
#define bFM4_CAN0_INTPND2_INTPND26             *((volatile unsigned char*)(0x42C41464UL))
#define bFM4_CAN0_INTPND2_INTPND27             *((volatile unsigned char*)(0x42C41468UL))
#define bFM4_CAN0_INTPND2_INTPND28             *((volatile unsigned char*)(0x42C4146CUL))
#define bFM4_CAN0_INTPND2_INTPND29             *((volatile unsigned char*)(0x42C41470UL))
#define bFM4_CAN0_INTPND2_INTPND30             *((volatile unsigned char*)(0x42C41474UL))
#define bFM4_CAN0_INTPND2_INTPND31             *((volatile unsigned char*)(0x42C41478UL))
#define bFM4_CAN0_INTPND2_INTPND32             *((volatile unsigned char*)(0x42C4147CUL))
#define bFM4_CAN0_MSGVAL_MSGVAL1               *((volatile unsigned char*)(0x42C41600UL))
#define bFM4_CAN0_MSGVAL_MSGVAL2               *((volatile unsigned char*)(0x42C41604UL))
#define bFM4_CAN0_MSGVAL_MSGVAL3               *((volatile unsigned char*)(0x42C41608UL))
#define bFM4_CAN0_MSGVAL_MSGVAL4               *((volatile unsigned char*)(0x42C4160CUL))
#define bFM4_CAN0_MSGVAL_MSGVAL5               *((volatile unsigned char*)(0x42C41610UL))
#define bFM4_CAN0_MSGVAL_MSGVAL6               *((volatile unsigned char*)(0x42C41614UL))
#define bFM4_CAN0_MSGVAL_MSGVAL7               *((volatile unsigned char*)(0x42C41618UL))
#define bFM4_CAN0_MSGVAL_MSGVAL8               *((volatile unsigned char*)(0x42C4161CUL))
#define bFM4_CAN0_MSGVAL_MSGVAL9               *((volatile unsigned char*)(0x42C41620UL))
#define bFM4_CAN0_MSGVAL_MSGVAL10              *((volatile unsigned char*)(0x42C41624UL))
#define bFM4_CAN0_MSGVAL_MSGVAL11              *((volatile unsigned char*)(0x42C41628UL))
#define bFM4_CAN0_MSGVAL_MSGVAL12              *((volatile unsigned char*)(0x42C4162CUL))
#define bFM4_CAN0_MSGVAL_MSGVAL13              *((volatile unsigned char*)(0x42C41630UL))
#define bFM4_CAN0_MSGVAL_MSGVAL14              *((volatile unsigned char*)(0x42C41634UL))
#define bFM4_CAN0_MSGVAL_MSGVAL15              *((volatile unsigned char*)(0x42C41638UL))
#define bFM4_CAN0_MSGVAL_MSGVAL16              *((volatile unsigned char*)(0x42C4163CUL))
#define bFM4_CAN0_MSGVAL_MSGVAL17              *((volatile unsigned char*)(0x42C41640UL))
#define bFM4_CAN0_MSGVAL_MSGVAL18              *((volatile unsigned char*)(0x42C41644UL))
#define bFM4_CAN0_MSGVAL_MSGVAL19              *((volatile unsigned char*)(0x42C41648UL))
#define bFM4_CAN0_MSGVAL_MSGVAL20              *((volatile unsigned char*)(0x42C4164CUL))
#define bFM4_CAN0_MSGVAL_MSGVAL21              *((volatile unsigned char*)(0x42C41650UL))
#define bFM4_CAN0_MSGVAL_MSGVAL22              *((volatile unsigned char*)(0x42C41654UL))
#define bFM4_CAN0_MSGVAL_MSGVAL23              *((volatile unsigned char*)(0x42C41658UL))
#define bFM4_CAN0_MSGVAL_MSGVAL24              *((volatile unsigned char*)(0x42C4165CUL))
#define bFM4_CAN0_MSGVAL_MSGVAL25              *((volatile unsigned char*)(0x42C41660UL))
#define bFM4_CAN0_MSGVAL_MSGVAL26              *((volatile unsigned char*)(0x42C41664UL))
#define bFM4_CAN0_MSGVAL_MSGVAL27              *((volatile unsigned char*)(0x42C41668UL))
#define bFM4_CAN0_MSGVAL_MSGVAL28              *((volatile unsigned char*)(0x42C4166CUL))
#define bFM4_CAN0_MSGVAL_MSGVAL29              *((volatile unsigned char*)(0x42C41670UL))
#define bFM4_CAN0_MSGVAL_MSGVAL30              *((volatile unsigned char*)(0x42C41674UL))
#define bFM4_CAN0_MSGVAL_MSGVAL31              *((volatile unsigned char*)(0x42C41678UL))
#define bFM4_CAN0_MSGVAL_MSGVAL32              *((volatile unsigned char*)(0x42C4167CUL))
#define bFM4_CAN0_MSGVAL1_MSGVAL1              *((volatile unsigned char*)(0x42C41600UL))
#define bFM4_CAN0_MSGVAL1_MSGVAL2              *((volatile unsigned char*)(0x42C41604UL))
#define bFM4_CAN0_MSGVAL1_MSGVAL3              *((volatile unsigned char*)(0x42C41608UL))
#define bFM4_CAN0_MSGVAL1_MSGVAL4              *((volatile unsigned char*)(0x42C4160CUL))
#define bFM4_CAN0_MSGVAL1_MSGVAL5              *((volatile unsigned char*)(0x42C41610UL))
#define bFM4_CAN0_MSGVAL1_MSGVAL6              *((volatile unsigned char*)(0x42C41614UL))
#define bFM4_CAN0_MSGVAL1_MSGVAL7              *((volatile unsigned char*)(0x42C41618UL))
#define bFM4_CAN0_MSGVAL1_MSGVAL8              *((volatile unsigned char*)(0x42C4161CUL))
#define bFM4_CAN0_MSGVAL1_MSGVAL9              *((volatile unsigned char*)(0x42C41620UL))
#define bFM4_CAN0_MSGVAL1_MSGVAL10             *((volatile unsigned char*)(0x42C41624UL))
#define bFM4_CAN0_MSGVAL1_MSGVAL11             *((volatile unsigned char*)(0x42C41628UL))
#define bFM4_CAN0_MSGVAL1_MSGVAL12             *((volatile unsigned char*)(0x42C4162CUL))
#define bFM4_CAN0_MSGVAL1_MSGVAL13             *((volatile unsigned char*)(0x42C41630UL))
#define bFM4_CAN0_MSGVAL1_MSGVAL14             *((volatile unsigned char*)(0x42C41634UL))
#define bFM4_CAN0_MSGVAL1_MSGVAL15             *((volatile unsigned char*)(0x42C41638UL))
#define bFM4_CAN0_MSGVAL1_MSGVAL16             *((volatile unsigned char*)(0x42C4163CUL))
#define bFM4_CAN0_MSGVAL2_MSGVAL17             *((volatile unsigned char*)(0x42C41640UL))
#define bFM4_CAN0_MSGVAL2_MSGVAL18             *((volatile unsigned char*)(0x42C41644UL))
#define bFM4_CAN0_MSGVAL2_MSGVAL19             *((volatile unsigned char*)(0x42C41648UL))
#define bFM4_CAN0_MSGVAL2_MSGVAL20             *((volatile unsigned char*)(0x42C4164CUL))
#define bFM4_CAN0_MSGVAL2_MSGVAL21             *((volatile unsigned char*)(0x42C41650UL))
#define bFM4_CAN0_MSGVAL2_MSGVAL22             *((volatile unsigned char*)(0x42C41654UL))
#define bFM4_CAN0_MSGVAL2_MSGVAL23             *((volatile unsigned char*)(0x42C41658UL))
#define bFM4_CAN0_MSGVAL2_MSGVAL24             *((volatile unsigned char*)(0x42C4165CUL))
#define bFM4_CAN0_MSGVAL2_MSGVAL25             *((volatile unsigned char*)(0x42C41660UL))
#define bFM4_CAN0_MSGVAL2_MSGVAL26             *((volatile unsigned char*)(0x42C41664UL))
#define bFM4_CAN0_MSGVAL2_MSGVAL27             *((volatile unsigned char*)(0x42C41668UL))
#define bFM4_CAN0_MSGVAL2_MSGVAL28             *((volatile unsigned char*)(0x42C4166CUL))
#define bFM4_CAN0_MSGVAL2_MSGVAL29             *((volatile unsigned char*)(0x42C41670UL))
#define bFM4_CAN0_MSGVAL2_MSGVAL30             *((volatile unsigned char*)(0x42C41674UL))
#define bFM4_CAN0_MSGVAL2_MSGVAL31             *((volatile unsigned char*)(0x42C41678UL))
#define bFM4_CAN0_MSGVAL2_MSGVAL32             *((volatile unsigned char*)(0x42C4167CUL))

