sol4ik/audio-steganography/try/fm4/s6e2cc_i2s_sk-fm4-176l-s6se2cc-v10/common/s6e2cc.h
/* Ethernet MAC 0 registers */
#define bFM4_ETHERNET_MAC0_MCR_RE              *((volatile unsigned char*)(0x42C80008UL))
#define bFM4_ETHERNET_MAC0_MCR_TE              *((volatile unsigned char*)(0x42C8000CUL))
#define bFM4_ETHERNET_MAC0_MCR_DC              *((volatile unsigned char*)(0x42C80010UL))
#define bFM4_ETHERNET_MAC0_MCR_BL0             *((volatile unsigned char*)(0x42C80014UL))
#define bFM4_ETHERNET_MAC0_MCR_BL1             *((volatile unsigned char*)(0x42C80018UL))
#define bFM4_ETHERNET_MAC0_MCR_ACS             *((volatile unsigned char*)(0x42C8001CUL))
#define bFM4_ETHERNET_MAC0_MCR_LUD             *((volatile unsigned char*)(0x42C80020UL))
#define bFM4_ETHERNET_MAC0_MCR_DR              *((volatile unsigned char*)(0x42C80024UL))
#define bFM4_ETHERNET_MAC0_MCR_IPC             *((volatile unsigned char*)(0x42C80028UL))
#define bFM4_ETHERNET_MAC0_MCR_DM              *((volatile unsigned char*)(0x42C8002CUL))
#define bFM4_ETHERNET_MAC0_MCR_LM              *((volatile unsigned char*)(0x42C80030UL))
#define bFM4_ETHERNET_MAC0_MCR_DO              *((volatile unsigned char*)(0x42C80034UL))
#define bFM4_ETHERNET_MAC0_MCR_FES             *((volatile unsigned char*)(0x42C80038UL))
#define bFM4_ETHERNET_MAC0_MCR_PS              *((volatile unsigned char*)(0x42C8003CUL))
#define bFM4_ETHERNET_MAC0_MCR_DCRS            *((volatile unsigned char*)(0x42C80040UL))
#define bFM4_ETHERNET_MAC0_MCR_IFG0            *((volatile unsigned char*)(0x42C80044UL))
#define bFM4_ETHERNET_MAC0_MCR_IFG1            *((volatile unsigned char*)(0x42C80048UL))
#define bFM4_ETHERNET_MAC0_MCR_IFG2            *((volatile unsigned char*)(0x42C8004CUL))
#define bFM4_ETHERNET_MAC0_MCR_JE              *((volatile unsigned char*)(0x42C80050UL))
#define bFM4_ETHERNET_MAC0_MCR_BE              *((volatile unsigned char*)(0x42C80054UL))
#define bFM4_ETHERNET_MAC0_MCR_JD              *((volatile unsigned char*)(0x42C80058UL))
#define bFM4_ETHERNET_MAC0_MCR_WD              *((volatile unsigned char*)(0x42C8005CUL))
#define bFM4_ETHERNET_MAC0_MCR_TC              *((volatile unsigned char*)(0x42C80060UL))
#define bFM4_ETHERNET_MAC0_MCR_CST             *((volatile unsigned char*)(0x42C80064UL))
#define bFM4_ETHERNET_MAC0_MFFR_PR             *((volatile unsigned char*)(0x42C80080UL))
#define bFM4_ETHERNET_MAC0_MFFR_HUC            *((volatile unsigned char*)(0x42C80084UL))
#define bFM4_ETHERNET_MAC0_MFFR_HMC            *((volatile unsigned char*)(0x42C80088UL))
#define bFM4_ETHERNET_MAC0_MFFR_DAIF           *((volatile unsigned char*)(0x42C8008CUL))
#define bFM4_ETHERNET_MAC0_MFFR_PM             *((volatile unsigned char*)(0x42C80090UL))
#define bFM4_ETHERNET_MAC0_MFFR_DB             *((volatile unsigned char*)(0x42C80094UL))
#define bFM4_ETHERNET_MAC0_MFFR_PCF0           *((volatile unsigned char*)(0x42C80098UL))
#define bFM4_ETHERNET_MAC0_MFFR_PCF1           *((volatile unsigned char*)(0x42C8009CUL))
#define bFM4_ETHERNET_MAC0_MFFR_SAIF           *((volatile unsigned char*)(0x42C800A0UL))
#define bFM4_ETHERNET_MAC0_MFFR_SAF            *((volatile unsigned char*)(0x42C800A4UL))
#define bFM4_ETHERNET_MAC0_MFFR_HPF            *((volatile unsigned char*)(0x42C800A8UL))
#define bFM4_ETHERNET_MAC0_MFFR_RA             *((volatile unsigned char*)(0x42C800FCUL))
#define bFM4_ETHERNET_MAC0_MHTRH_HTH0          *((volatile unsigned char*)(0x42C80100UL))
#define bFM4_ETHERNET_MAC0_MHTRH_HTH1          *((volatile unsigned char*)(0x42C80104UL))
#define bFM4_ETHERNET_MAC0_MHTRH_HTH2          *((volatile unsigned char*)(0x42C80108UL))
#define bFM4_ETHERNET_MAC0_MHTRH_HTH3          *((volatile unsigned char*)(0x42C8010CUL))
#define bFM4_ETHERNET_MAC0_MHTRH_HTH4          *((volatile unsigned char*)(0x42C80110UL))
#define bFM4_ETHERNET_MAC0_MHTRH_HTH5          *((volatile unsigned char*)(0x42C80114UL))
#define bFM4_ETHERNET_MAC0_MHTRH_HTH6          *((volatile unsigned char*)(0x42C80118UL))
#define bFM4_ETHERNET_MAC0_MHTRH_HTH7          *((volatile unsigned char*)(0x42C8011CUL))
#define bFM4_ETHERNET_MAC0_MHTRH_HTH8          *((volatile unsigned char*)(0x42C80120UL))
#define bFM4_ETHERNET_MAC0_MHTRH_HTH9          *((volatile unsigned char*)(0x42C80124UL))
#define bFM4_ETHERNET_MAC0_MHTRH_HTH10         *((volatile unsigned char*)(0x42C80128UL))
#define bFM4_ETHERNET_MAC0_MHTRH_HTH11         *((volatile unsigned char*)(0x42C8012CUL))
#define bFM4_ETHERNET_MAC0_MHTRH_HTH12         *((volatile unsigned char*)(0x42C80130UL))
#define bFM4_ETHERNET_MAC0_MHTRH_HTH13         *((volatile unsigned char*)(0x42C80134UL))
#define bFM4_ETHERNET_MAC0_MHTRH_HTH14         *((volatile unsigned char*)(0x42C80138UL))
#define bFM4_ETHERNET_MAC0_MHTRH_HTH15         *((volatile unsigned char*)(0x42C8013CUL))
#define bFM4_ETHERNET_MAC0_MHTRH_HTH16         *((volatile unsigned char*)(0x42C80140UL))
#define bFM4_ETHERNET_MAC0_MHTRH_HTH17         *((volatile unsigned char*)(0x42C80144UL))
#define bFM4_ETHERNET_MAC0_MHTRH_HTH18         *((volatile unsigned char*)(0x42C80148UL))
#define bFM4_ETHERNET_MAC0_MHTRH_HTH19         *((volatile unsigned char*)(0x42C8014CUL))
#define bFM4_ETHERNET_MAC0_MHTRH_HTH20         *((volatile unsigned char*)(0x42C80150UL))
#define bFM4_ETHERNET_MAC0_MHTRH_HTH21         *((volatile unsigned char*)(0x42C80154UL))
#define bFM4_ETHERNET_MAC0_MHTRH_HTH22         *((volatile unsigned char*)(0x42C80158UL))
#define bFM4_ETHERNET_MAC0_MHTRH_HTH23         *((volatile unsigned char*)(0x42C8015CUL))
#define bFM4_ETHERNET_MAC0_MHTRH_HTH24         *((volatile unsigned char*)(0x42C80160UL))
#define bFM4_ETHERNET_MAC0_MHTRH_HTH25         *((volatile unsigned char*)(0x42C80164UL))
#define bFM4_ETHERNET_MAC0_MHTRH_HTH26         *((volatile unsigned char*)(0x42C80168UL))
#define bFM4_ETHERNET_MAC0_MHTRH_HTH27         *((volatile unsigned char*)(0x42C8016CUL))
#define bFM4_ETHERNET_MAC0_MHTRH_HTH28         *((volatile unsigned char*)(0x42C80170UL))
#define bFM4_ETHERNET_MAC0_MHTRH_HTH29         *((volatile unsigned char*)(0x42C80174UL))
#define bFM4_ETHERNET_MAC0_MHTRH_HTH30         *((volatile unsigned char*)(0x42C80178UL))
#define bFM4_ETHERNET_MAC0_MHTRH_HTH31         *((volatile unsigned char*)(0x42C8017CUL))
#define bFM4_ETHERNET_MAC0_MHTRL_HTL0          *((volatile unsigned char*)(0x42C80180UL))
#define bFM4_ETHERNET_MAC0_MHTRL_HTL1          *((volatile unsigned char*)(0x42C80184UL))
#define bFM4_ETHERNET_MAC0_MHTRL_HTL2          *((volatile unsigned char*)(0x42C80188UL))
#define bFM4_ETHERNET_MAC0_MHTRL_HTL3          *((volatile unsigned char*)(0x42C8018CUL))
#define bFM4_ETHERNET_MAC0_MHTRL_HTL4          *((volatile unsigned char*)(0x42C80190UL))
#define bFM4_ETHERNET_MAC0_MHTRL_HTL5          *((volatile unsigned char*)(0x42C80194UL))
#define bFM4_ETHERNET_MAC0_MHTRL_HTL6          *((volatile unsigned char*)(0x42C80198UL))
#define bFM4_ETHERNET_MAC0_MHTRL_HTL7          *((volatile unsigned char*)(0x42C8019CUL))
#define bFM4_ETHERNET_MAC0_MHTRL_HTL8          *((volatile unsigned char*)(0x42C801A0UL))
#define bFM4_ETHERNET_MAC0_MHTRL_HTL9          *((volatile unsigned char*)(0x42C801A4UL))
#define bFM4_ETHERNET_MAC0_MHTRL_HTL10         *((volatile unsigned char*)(0x42C801A8UL))
#define bFM4_ETHERNET_MAC0_MHTRL_HTL11         *((volatile unsigned char*)(0x42C801ACUL))
#define bFM4_ETHERNET_MAC0_MHTRL_HTL12         *((volatile unsigned char*)(0x42C801B0UL))
#define bFM4_ETHERNET_MAC0_MHTRL_HTL13         *((volatile unsigned char*)(0x42C801B4UL))
#define bFM4_ETHERNET_MAC0_MHTRL_HTL14         *((volatile unsigned char*)(0x42C801B8UL))
#define bFM4_ETHERNET_MAC0_MHTRL_HTL15         *((volatile unsigned char*)(0x42C801BCUL))
#define bFM4_ETHERNET_MAC0_MHTRL_HTL16         *((volatile unsigned char*)(0x42C801C0UL))
#define bFM4_ETHERNET_MAC0_MHTRL_HTL17         *((volatile unsigned char*)(0x42C801C4UL))
#define bFM4_ETHERNET_MAC0_MHTRL_HTL18         *((volatile unsigned char*)(0x42C801C8UL))
#define bFM4_ETHERNET_MAC0_MHTRL_HTL19         *((volatile unsigned char*)(0x42C801CCUL))
#define bFM4_ETHERNET_MAC0_MHTRL_HTL20         *((volatile unsigned char*)(0x42C801D0UL))
#define bFM4_ETHERNET_MAC0_MHTRL_HTL21         *((volatile unsigned char*)(0x42C801D4UL))
#define bFM4_ETHERNET_MAC0_MHTRL_HTL22         *((volatile unsigned char*)(0x42C801D8UL))
#define bFM4_ETHERNET_MAC0_MHTRL_HTL23         *((volatile unsigned char*)(0x42C801DCUL))
#define bFM4_ETHERNET_MAC0_MHTRL_HTL24         *((volatile unsigned char*)(0x42C801E0UL))
#define bFM4_ETHERNET_MAC0_MHTRL_HTL25         *((volatile unsigned char*)(0x42C801E4UL))
#define bFM4_ETHERNET_MAC0_MHTRL_HTL26         *((volatile unsigned char*)(0x42C801E8UL))
#define bFM4_ETHERNET_MAC0_MHTRL_HTL27         *((volatile unsigned char*)(0x42C801ECUL))
#define bFM4_ETHERNET_MAC0_MHTRL_HTL28         *((volatile unsigned char*)(0x42C801F0UL))
#define bFM4_ETHERNET_MAC0_MHTRL_HTL29         *((volatile unsigned char*)(0x42C801F4UL))
#define bFM4_ETHERNET_MAC0_MHTRL_HTL30         *((volatile unsigned char*)(0x42C801F8UL))
#define bFM4_ETHERNET_MAC0_MHTRL_HTL31         *((volatile unsigned char*)(0x42C801FCUL))
#define bFM4_ETHERNET_MAC0_GAR_GB              *((volatile unsigned char*)(0x42C80200UL))
#define bFM4_ETHERNET_MAC0_GAR_GW              *((volatile unsigned char*)(0x42C80204UL))
#define bFM4_ETHERNET_MAC0_GAR_CR0             *((volatile unsigned char*)(0x42C80208UL))
#define bFM4_ETHERNET_MAC0_GAR_CR1             *((volatile unsigned char*)(0x42C8020CUL))
#define bFM4_ETHERNET_MAC0_GAR_CR2             *((volatile unsigned char*)(0x42C80210UL))
#define bFM4_ETHERNET_MAC0_GAR_CR3             *((volatile unsigned char*)(0x42C80214UL))
#define bFM4_ETHERNET_MAC0_GAR_GR0             *((volatile unsigned char*)(0x42C80218UL))
#define bFM4_ETHERNET_MAC0_GAR_GR1             *((volatile unsigned char*)(0x42C8021CUL))
#define bFM4_ETHERNET_MAC0_GAR_GR2             *((volatile unsigned char*)(0x42C80220UL))
#define bFM4_ETHERNET_MAC0_GAR_GR3             *((volatile unsigned char*)(0x42C80224UL))
#define bFM4_ETHERNET_MAC0_GAR_GR4             *((volatile unsigned char*)(0x42C80228UL))
#define bFM4_ETHERNET_MAC0_GAR_PA0             *((volatile unsigned char*)(0x42C8022CUL))
#define bFM4_ETHERNET_MAC0_GAR_PA1             *((volatile unsigned char*)(0x42C80230UL))
#define bFM4_ETHERNET_MAC0_GAR_PA2             *((volatile unsigned char*)(0x42C80234UL))
#define bFM4_ETHERNET_MAC0_GAR_PA3             *((volatile unsigned char*)(0x42C80238UL))
#define bFM4_ETHERNET_MAC0_GAR_PA4             *((volatile unsigned char*)(0x42C8023CUL))
#define bFM4_ETHERNET_MAC0_GDR_GD0             *((volatile unsigned char*)(0x42C80280UL))
#define bFM4_ETHERNET_MAC0_GDR_GD1             *((volatile unsigned char*)(0x42C80284UL))
#define bFM4_ETHERNET_MAC0_GDR_GD2             *((volatile unsigned char*)(0x42C80288UL))
#define bFM4_ETHERNET_MAC0_GDR_GD3             *((volatile unsigned char*)(0x42C8028CUL))
#define bFM4_ETHERNET_MAC0_GDR_GD4             *((volatile unsigned char*)(0x42C80290UL))
#define bFM4_ETHERNET_MAC0_GDR_GD5             *((volatile unsigned char*)(0x42C80294UL))
#define bFM4_ETHERNET_MAC0_GDR_GD6             *((volatile unsigned char*)(0x42C80298UL))
#define bFM4_ETHERNET_MAC0_GDR_GD7             *((volatile unsigned char*)(0x42C8029CUL))
#define bFM4_ETHERNET_MAC0_GDR_GD8             *((volatile unsigned char*)(0x42C802A0UL))
#define bFM4_ETHERNET_MAC0_GDR_GD9             *((volatile unsigned char*)(0x42C802A4UL))
#define bFM4_ETHERNET_MAC0_GDR_GD10            *((volatile unsigned char*)(0x42C802A8UL))
#define bFM4_ETHERNET_MAC0_GDR_GD11            *((volatile unsigned char*)(0x42C802ACUL))
#define bFM4_ETHERNET_MAC0_GDR_GD12            *((volatile unsigned char*)(0x42C802B0UL))
#define bFM4_ETHERNET_MAC0_GDR_GD13            *((volatile unsigned char*)(0x42C802B4UL))
#define bFM4_ETHERNET_MAC0_GDR_GD14            *((volatile unsigned char*)(0x42C802B8UL))
#define bFM4_ETHERNET_MAC0_GDR_GD15            *((volatile unsigned char*)(0x42C802BCUL))
#define bFM4_ETHERNET_MAC0_FCR_FCB_BPA         *((volatile unsigned char*)(0x42C80300UL))
#define bFM4_ETHERNET_MAC0_FCR_TFE             *((volatile unsigned char*)(0x42C80304UL))
#define bFM4_ETHERNET_MAC0_FCR_RFE             *((volatile unsigned char*)(0x42C80308UL))
#define bFM4_ETHERNET_MAC0_FCR_UP              *((volatile unsigned char*)(0x42C8030CUL))
#define bFM4_ETHERNET_MAC0_FCR_PLT0            *((volatile unsigned char*)(0x42C80310UL))
#define bFM4_ETHERNET_MAC0_FCR_PLT1            *((volatile unsigned char*)(0x42C80314UL))
#define bFM4_ETHERNET_MAC0_FCR_DZPQ            *((volatile unsigned char*)(0x42C8031CUL))
#define bFM4_ETHERNET_MAC0_FCR_PT0             *((volatile unsigned char*)(0x42C80340UL))
#define bFM4_ETHERNET_MAC0_FCR_PT1             *((volatile unsigned char*)(0x42C80344UL))
#define bFM4_ETHERNET_MAC0_FCR_PT2             *((volatile unsigned char*)(0x42C80348UL))
#define bFM4_ETHERNET_MAC0_FCR_PT3             *((volatile unsigned char*)(0x42C8034CUL))
#define bFM4_ETHERNET_MAC0_FCR_PT4             *((volatile unsigned char*)(0x42C80350UL))
#define bFM4_ETHERNET_MAC0_FCR_PT5             *((volatile unsigned char*)(0x42C80354UL))
#define bFM4_ETHERNET_MAC0_FCR_PT6             *((volatile unsigned char*)(0x42C80358UL))
#define bFM4_ETHERNET_MAC0_FCR_PT7             *((volatile unsigned char*)(0x42C8035CUL))
#define bFM4_ETHERNET_MAC0_FCR_PT8             *((volatile unsigned char*)(0x42C80360UL))
#define bFM4_ETHERNET_MAC0_FCR_PT9             *((volatile unsigned char*)(0x42C80364UL))
#define bFM4_ETHERNET_MAC0_FCR_PT10            *((volatile unsigned char*)(0x42C80368UL))
#define bFM4_ETHERNET_MAC0_FCR_PT11            *((volatile unsigned char*)(0x42C8036CUL))
#define bFM4_ETHERNET_MAC0_FCR_PT12            *((volatile unsigned char*)(0x42C80370UL))
#define bFM4_ETHERNET_MAC0_FCR_PT13            *((volatile unsigned char*)(0x42C80374UL))
#define bFM4_ETHERNET_MAC0_FCR_PT14            *((volatile unsigned char*)(0x42C80378UL))
#define bFM4_ETHERNET_MAC0_FCR_PT15            *((volatile unsigned char*)(0x42C8037CUL))
#define bFM4_ETHERNET_MAC0_VTR_VL0             *((volatile unsigned char*)(0x42C80380UL))
#define bFM4_ETHERNET_MAC0_VTR_VL1             *((volatile unsigned char*)(0x42C80384UL))
#define bFM4_ETHERNET_MAC0_VTR_VL2             *((volatile unsigned char*)(0x42C80388UL))
#define bFM4_ETHERNET_MAC0_VTR_VL3             *((volatile unsigned char*)(0x42C8038CUL))
#define bFM4_ETHERNET_MAC0_VTR_VL4             *((volatile unsigned char*)(0x42C80390UL))
#define bFM4_ETHERNET_MAC0_VTR_VL5             *((volatile unsigned char*)(0x42C80394UL))
#define bFM4_ETHERNET_MAC0_VTR_VL6             *((volatile unsigned char*)(0x42C80398UL))
#define bFM4_ETHERNET_MAC0_VTR_VL7             *((volatile unsigned char*)(0x42C8039CUL))
#define bFM4_ETHERNET_MAC0_VTR_VL8             *((volatile unsigned char*)(0x42C803A0UL))
#define bFM4_ETHERNET_MAC0_VTR_VL9             *((volatile unsigned char*)(0x42C803A4UL))
#define bFM4_ETHERNET_MAC0_VTR_VL10            *((volatile unsigned char*)(0x42C803A8UL))
#define bFM4_ETHERNET_MAC0_VTR_VL11            *((volatile unsigned char*)(0x42C803ACUL))
#define bFM4_ETHERNET_MAC0_VTR_VL12            *((volatile unsigned char*)(0x42C803B0UL))
#define bFM4_ETHERNET_MAC0_VTR_VL13            *((volatile unsigned char*)(0x42C803B4UL))
#define bFM4_ETHERNET_MAC0_VTR_VL14            *((volatile unsigned char*)(0x42C803B8UL))
#define bFM4_ETHERNET_MAC0_VTR_VL15            *((volatile unsigned char*)(0x42C803BCUL))
#define bFM4_ETHERNET_MAC0_VTR_ETV             *((volatile unsigned char*)(0x42C803C0UL))
#define bFM4_ETHERNET_MAC0_RWFFR_RWFFR0        *((volatile unsigned char*)(0x42C80500UL))
#define bFM4_ETHERNET_MAC0_RWFFR_RWFFR1        *((volatile unsigned char*)(0x42C80504UL))
#define bFM4_ETHERNET_MAC0_RWFFR_RWFFR2        *((volatile unsigned char*)(0x42C80508UL))
#define bFM4_ETHERNET_MAC0_RWFFR_RWFFR3        *((volatile unsigned char*)(0x42C8050CUL))
#define bFM4_ETHERNET_MAC0_RWFFR_RWFFR4        *((volatile unsigned char*)(0x42C80510UL))
#define bFM4_ETHERNET_MAC0_RWFFR_RWFFR5        *((volatile unsigned char*)(0x42C80514UL))
#define bFM4_ETHERNET_MAC0_RWFFR_RWFFR6        *((volatile unsigned char*)(0x42C80518UL))
#define bFM4_ETHERNET_MAC0_RWFFR_RWFFR7        *((volatile unsigned char*)(0x42C8051CUL))
#define bFM4_ETHERNET_MAC0_RWFFR_RWFFR8        *((volatile unsigned char*)(0x42C80520UL))
#define bFM4_ETHERNET_MAC0_RWFFR_RWFFR9        *((volatile unsigned char*)(0x42C80524UL))
#define bFM4_ETHERNET_MAC0_RWFFR_RWFFR10       *((volatile unsigned char*)(0x42C80528UL))
#define bFM4_ETHERNET_MAC0_RWFFR_RWFFR11       *((volatile unsigned char*)(0x42C8052CUL))
#define bFM4_ETHERNET_MAC0_RWFFR_RWFFR12       *((volatile unsigned char*)(0x42C80530UL))
#define bFM4_ETHERNET_MAC0_RWFFR_RWFFR13       *((volatile unsigned char*)(0x42C80534UL))
#define bFM4_ETHERNET_MAC0_RWFFR_RWFFR14       *((volatile unsigned char*)(0x42C80538UL))
#define bFM4_ETHERNET_MAC0_RWFFR_RWFFR15       *((volatile unsigned char*)(0x42C8053CUL))
#define bFM4_ETHERNET_MAC0_RWFFR_RWFFR16       *((volatile unsigned char*)(0x42C80540UL))
#define bFM4_ETHERNET_MAC0_RWFFR_RWFFR17       *((volatile unsigned char*)(0x42C80544UL))
#define bFM4_ETHERNET_MAC0_RWFFR_RWFFR18       *((volatile unsigned char*)(0x42C80548UL))
#define bFM4_ETHERNET_MAC0_RWFFR_RWFFR19       *((volatile unsigned char*)(0x42C8054CUL))
#define bFM4_ETHERNET_MAC0_RWFFR_RWFFR20       *((volatile unsigned char*)(0x42C80550UL))
#define bFM4_ETHERNET_MAC0_RWFFR_RWFFR21       *((volatile unsigned char*)(0x42C80554UL))
#define bFM4_ETHERNET_MAC0_RWFFR_RWFFR22       *((volatile unsigned char*)(0x42C80558UL))
#define bFM4_ETHERNET_MAC0_RWFFR_RWFFR23       *((volatile unsigned char*)(0x42C8055CUL))
#define bFM4_ETHERNET_MAC0_RWFFR_RWFFR24       *((volatile unsigned char*)(0x42C80560UL))
#define bFM4_ETHERNET_MAC0_RWFFR_RWFFR25       *((volatile unsigned char*)(0x42C80564UL))
#define bFM4_ETHERNET_MAC0_RWFFR_RWFFR26       *((volatile unsigned char*)(0x42C80568UL))
#define bFM4_ETHERNET_MAC0_RWFFR_RWFFR27       *((volatile unsigned char*)(0x42C8056CUL))
#define bFM4_ETHERNET_MAC0_RWFFR_RWFFR28       *((volatile unsigned char*)(0x42C80570UL))
#define bFM4_ETHERNET_MAC0_RWFFR_RWFFR29       *((volatile unsigned char*)(0x42C80574UL))
#define bFM4_ETHERNET_MAC0_RWFFR_RWFFR30       *((volatile unsigned char*)(0x42C80578UL))
#define bFM4_ETHERNET_MAC0_RWFFR_RWFFR31       *((volatile unsigned char*)(0x42C8057CUL))
#define bFM4_ETHERNET_MAC0_PMTR_PD             *((volatile unsigned char*)(0x42C80580UL))
#define bFM4_ETHERNET_MAC0_PMTR_MPE            *((volatile unsigned char*)(0x42C80584UL))
#define bFM4_ETHERNET_MAC0_PMTR_WFE            *((volatile unsigned char*)(0x42C80588UL))
#define bFM4_ETHERNET_MAC0_PMTR_MPR            *((volatile unsigned char*)(0x42C80594UL))
#define bFM4_ETHERNET_MAC0_PMTR_WPR            *((volatile unsigned char*)(0x42C80598UL))
#define bFM4_ETHERNET_MAC0_PMTR_GU             *((volatile unsigned char*)(0x42C805A4UL))
#define bFM4_ETHERNET_MAC0_PMTR_RWFFRPR        *((volatile unsigned char*)(0x42C805FCUL))
#define bFM4_ETHERNET_MAC0_LPICSR_TLPIEN       *((volatile unsigned char*)(0x42C80600UL))
#define bFM4_ETHERNET_MAC0_LPICSR_TLPIEX       *((volatile unsigned char*)(0x42C80604UL))
#define bFM4_ETHERNET_MAC0_LPICSR_RLPIEN       *((volatile unsigned char*)(0x42C80608UL))
#define bFM4_ETHERNET_MAC0_LPICSR_RLPIEX       *((volatile unsigned char*)(0x42C8060CUL))
#define bFM4_ETHERNET_MAC0_LPICSR_TLPIST       *((volatile unsigned char*)(0x42C80620UL))
#define bFM4_ETHERNET_MAC0_LPICSR_RLPIST       *((volatile unsigned char*)(0x42C80624UL))
#define bFM4_ETHERNET_MAC0_LPICSR_LPIEN        *((volatile unsigned char*)(0x42C80640UL))
#define bFM4_ETHERNET_MAC0_LPICSR_PLS          *((volatile unsigned char*)(0x42C80644UL))
#define bFM4_ETHERNET_MAC0_LPICSR_PLSEN        *((volatile unsigned char*)(0x42C80648UL))
#define bFM4_ETHERNET_MAC0_LPICSR_LPITXA       *((volatile unsigned char*)(0x42C8064CUL))
#define bFM4_ETHERNET_MAC0_LPITCR_TWT0         *((volatile unsigned char*)(0x42C80680UL))
#define bFM4_ETHERNET_MAC0_LPITCR_TWT1         *((volatile unsigned char*)(0x42C80684UL))
#define bFM4_ETHERNET_MAC0_LPITCR_TWT2         *((volatile unsigned char*)(0x42C80688UL))
#define bFM4_ETHERNET_MAC0_LPITCR_TWT3         *((volatile unsigned char*)(0x42C8068CUL))
#define bFM4_ETHERNET_MAC0_LPITCR_TWT4         *((volatile unsigned char*)(0x42C80690UL))
#define bFM4_ETHERNET_MAC0_LPITCR_TWT5         *((volatile unsigned char*)(0x42C80694UL))
#define bFM4_ETHERNET_MAC0_LPITCR_TWT6         *((volatile unsigned char*)(0x42C80698UL))
#define bFM4_ETHERNET_MAC0_LPITCR_TWT7         *((volatile unsigned char*)(0x42C8069CUL))
#define bFM4_ETHERNET_MAC0_LPITCR_TWT8         *((volatile unsigned char*)(0x42C806A0UL))
#define bFM4_ETHERNET_MAC0_LPITCR_TWT9         *((volatile unsigned char*)(0x42C806A4UL))
#define bFM4_ETHERNET_MAC0_LPITCR_TWT10        *((volatile unsigned char*)(0x42C806A8UL))
#define bFM4_ETHERNET_MAC0_LPITCR_TWT11        *((volatile unsigned char*)(0x42C806ACUL))
#define bFM4_ETHERNET_MAC0_LPITCR_TWT12        *((volatile unsigned char*)(0x42C806B0UL))
#define bFM4_ETHERNET_MAC0_LPITCR_TWT13        *((volatile unsigned char*)(0x42C806B4UL))
#define bFM4_ETHERNET_MAC0_LPITCR_TWT14        *((volatile unsigned char*)(0x42C806B8UL))
#define bFM4_ETHERNET_MAC0_LPITCR_TWT15        *((volatile unsigned char*)(0x42C806BCUL))
#define bFM4_ETHERNET_MAC0_LPITCR_LIT0         *((volatile unsigned char*)(0x42C806C0UL))
#define bFM4_ETHERNET_MAC0_LPITCR_LIT1         *((volatile unsigned char*)(0x42C806C4UL))
#define bFM4_ETHERNET_MAC0_LPITCR_LIT2         *((volatile unsigned char*)(0x42C806C8UL))
#define bFM4_ETHERNET_MAC0_LPITCR_LIT3         *((volatile unsigned char*)(0x42C806CCUL))
#define bFM4_ETHERNET_MAC0_LPITCR_LIT4         *((volatile unsigned char*)(0x42C806D0UL))
#define bFM4_ETHERNET_MAC0_LPITCR_LIT5         *((volatile unsigned char*)(0x42C806D4UL))
#define bFM4_ETHERNET_MAC0_LPITCR_LIT6         *((volatile unsigned char*)(0x42C806D8UL))
#define bFM4_ETHERNET_MAC0_LPITCR_LIT7         *((volatile unsigned char*)(0x42C806DCUL))
#define bFM4_ETHERNET_MAC0_LPITCR_LIT8         *((volatile unsigned char*)(0x42C806E0UL))
#define bFM4_ETHERNET_MAC0_LPITCR_LIT9         *((volatile unsigned char*)(0x42C806E4UL))
#define bFM4_ETHERNET_MAC0_ISR_RGIS            *((volatile unsigned char*)(0x42C80700UL))
#define bFM4_ETHERNET_MAC0_ISR_PIS             *((volatile unsigned char*)(0x42C8070CUL))
#define bFM4_ETHERNET_MAC0_ISR_MIS             *((volatile unsigned char*)(0x42C80710UL))
#define bFM4_ETHERNET_MAC0_ISR_RIS             *((volatile unsigned char*)(0x42C80714UL))
#define bFM4_ETHERNET_MAC0_ISR_TIS             *((volatile unsigned char*)(0x42C80718UL))
#define bFM4_ETHERNET_MAC0_ISR_COIS            *((volatile unsigned char*)(0x42C8071CUL))
#define bFM4_ETHERNET_MAC0_ISR_TSIS            *((volatile unsigned char*)(0x42C80724UL))
#define bFM4_ETHERNET_MAC0_ISR_LPIIS           *((volatile unsigned char*)(0x42C80728UL))
#define bFM4_ETHERNET_MAC0_IMR_RGIM            *((volatile unsigned char*)(0x42C80780UL))
#define bFM4_ETHERNET_MAC0_IMR_PIM             *((volatile unsigned char*)(0x42C8078CUL))
#define bFM4_ETHERNET_MAC0_IMR_TSIM            *((volatile unsigned char*)(0x42C807A4UL))
#define bFM4_ETHERNET_MAC0_IMR_LPIIM           *((volatile unsigned char*)(0x42C807A8UL))
#define bFM4_ETHERNET_MAC0_MAR0H_MO            *((volatile unsigned char*)(0x42C8087CUL))
#define bFM4_ETHERNET_MAC0_MAR1H_MBC0          *((volatile unsigned char*)(0x42C80960UL))
#define bFM4_ETHERNET_MAC0_MAR1H_MBC1          *((volatile unsigned char*)(0x42C80964UL))
#define bFM4_ETHERNET_MAC0_MAR1H_MBC2          *((volatile unsigned char*)(0x42C80968UL))
