sol4ik/audio-steganography/try/fm4/s6e2cc_i2s_sk-fm4-176l-s6se2cc-v10/common/s6e2cc.h
#define bFM4_ETHERNET_MAC0_MAR1H_MBC3          *((volatile unsigned char*)(0x42C8096CUL))
#define bFM4_ETHERNET_MAC0_MAR1H_MBC4          *((volatile unsigned char*)(0x42C80970UL))
#define bFM4_ETHERNET_MAC0_MAR1H_MBC5          *((volatile unsigned char*)(0x42C80974UL))
#define bFM4_ETHERNET_MAC0_MAR1H_SA            *((volatile unsigned char*)(0x42C80978UL))
#define bFM4_ETHERNET_MAC0_MAR2H_MBC0          *((volatile unsigned char*)(0x42C80A60UL))
#define bFM4_ETHERNET_MAC0_MAR2H_MBC1          *((volatile unsigned char*)(0x42C80A64UL))
#define bFM4_ETHERNET_MAC0_MAR2H_MBC2          *((volatile unsigned char*)(0x42C80A68UL))
#define bFM4_ETHERNET_MAC0_MAR2H_MBC3          *((volatile unsigned char*)(0x42C80A6CUL))
#define bFM4_ETHERNET_MAC0_MAR2H_MBC4          *((volatile unsigned char*)(0x42C80A70UL))
#define bFM4_ETHERNET_MAC0_MAR2H_MBC5          *((volatile unsigned char*)(0x42C80A74UL))
#define bFM4_ETHERNET_MAC0_MAR2H_SA            *((volatile unsigned char*)(0x42C80A78UL))
#define bFM4_ETHERNET_MAC0_MAR3H_MBC0          *((volatile unsigned char*)(0x42C80B60UL))
#define bFM4_ETHERNET_MAC0_MAR3H_MBC1          *((volatile unsigned char*)(0x42C80B64UL))
#define bFM4_ETHERNET_MAC0_MAR3H_MBC2          *((volatile unsigned char*)(0x42C80B68UL))
#define bFM4_ETHERNET_MAC0_MAR3H_MBC3          *((volatile unsigned char*)(0x42C80B6CUL))
#define bFM4_ETHERNET_MAC0_MAR3H_MBC4          *((volatile unsigned char*)(0x42C80B70UL))
#define bFM4_ETHERNET_MAC0_MAR3H_MBC5          *((volatile unsigned char*)(0x42C80B74UL))
#define bFM4_ETHERNET_MAC0_MAR3H_SA            *((volatile unsigned char*)(0x42C80B78UL))
#define bFM4_ETHERNET_MAC0_MAR4H_MBC0          *((volatile unsigned char*)(0x42C80C60UL))
#define bFM4_ETHERNET_MAC0_MAR4H_MBC1          *((volatile unsigned char*)(0x42C80C64UL))
#define bFM4_ETHERNET_MAC0_MAR4H_MBC2          *((volatile unsigned char*)(0x42C80C68UL))
#define bFM4_ETHERNET_MAC0_MAR4H_MBC3          *((volatile unsigned char*)(0x42C80C6CUL))
#define bFM4_ETHERNET_MAC0_MAR4H_MBC4          *((volatile unsigned char*)(0x42C80C70UL))
#define bFM4_ETHERNET_MAC0_MAR4H_MBC5          *((volatile unsigned char*)(0x42C80C74UL))
#define bFM4_ETHERNET_MAC0_MAR4H_SA            *((volatile unsigned char*)(0x42C80C78UL))
#define bFM4_ETHERNET_MAC0_MAR5H_MBC0          *((volatile unsigned char*)(0x42C80D60UL))
#define bFM4_ETHERNET_MAC0_MAR5H_MBC1          *((volatile unsigned char*)(0x42C80D64UL))
#define bFM4_ETHERNET_MAC0_MAR5H_MBC2          *((volatile unsigned char*)(0x42C80D68UL))
#define bFM4_ETHERNET_MAC0_MAR5H_MBC3          *((volatile unsigned char*)(0x42C80D6CUL))
#define bFM4_ETHERNET_MAC0_MAR5H_MBC4          *((volatile unsigned char*)(0x42C80D70UL))
#define bFM4_ETHERNET_MAC0_MAR5H_MBC5          *((volatile unsigned char*)(0x42C80D74UL))
#define bFM4_ETHERNET_MAC0_MAR5H_SA            *((volatile unsigned char*)(0x42C80D78UL))
#define bFM4_ETHERNET_MAC0_MAR6H_MBC0          *((volatile unsigned char*)(0x42C80E60UL))
#define bFM4_ETHERNET_MAC0_MAR6H_MBC1          *((volatile unsigned char*)(0x42C80E64UL))
#define bFM4_ETHERNET_MAC0_MAR6H_MBC2          *((volatile unsigned char*)(0x42C80E68UL))
#define bFM4_ETHERNET_MAC0_MAR6H_MBC3          *((volatile unsigned char*)(0x42C80E6CUL))
#define bFM4_ETHERNET_MAC0_MAR6H_MBC4          *((volatile unsigned char*)(0x42C80E70UL))
#define bFM4_ETHERNET_MAC0_MAR6H_MBC5          *((volatile unsigned char*)(0x42C80E74UL))
#define bFM4_ETHERNET_MAC0_MAR6H_SA            *((volatile unsigned char*)(0x42C80E78UL))
#define bFM4_ETHERNET_MAC0_MAR7H_MBC0          *((volatile unsigned char*)(0x42C80F60UL))
#define bFM4_ETHERNET_MAC0_MAR7H_MBC1          *((volatile unsigned char*)(0x42C80F64UL))
#define bFM4_ETHERNET_MAC0_MAR7H_MBC2          *((volatile unsigned char*)(0x42C80F68UL))
#define bFM4_ETHERNET_MAC0_MAR7H_MBC3          *((volatile unsigned char*)(0x42C80F6CUL))
#define bFM4_ETHERNET_MAC0_MAR7H_MBC4          *((volatile unsigned char*)(0x42C80F70UL))
#define bFM4_ETHERNET_MAC0_MAR7H_MBC5          *((volatile unsigned char*)(0x42C80F74UL))
#define bFM4_ETHERNET_MAC0_MAR7H_SA            *((volatile unsigned char*)(0x42C80F78UL))
#define bFM4_ETHERNET_MAC0_MAR8H_MBC0          *((volatile unsigned char*)(0x42C81060UL))
#define bFM4_ETHERNET_MAC0_MAR8H_MBC1          *((volatile unsigned char*)(0x42C81064UL))
#define bFM4_ETHERNET_MAC0_MAR8H_MBC2          *((volatile unsigned char*)(0x42C81068UL))
#define bFM4_ETHERNET_MAC0_MAR8H_MBC3          *((volatile unsigned char*)(0x42C8106CUL))
#define bFM4_ETHERNET_MAC0_MAR8H_MBC4          *((volatile unsigned char*)(0x42C81070UL))
#define bFM4_ETHERNET_MAC0_MAR8H_MBC5          *((volatile unsigned char*)(0x42C81074UL))
#define bFM4_ETHERNET_MAC0_MAR8H_SA            *((volatile unsigned char*)(0x42C81078UL))
#define bFM4_ETHERNET_MAC0_MAR9H_MBC0          *((volatile unsigned char*)(0x42C81160UL))
#define bFM4_ETHERNET_MAC0_MAR9H_MBC1          *((volatile unsigned char*)(0x42C81164UL))
#define bFM4_ETHERNET_MAC0_MAR9H_MBC2          *((volatile unsigned char*)(0x42C81168UL))
#define bFM4_ETHERNET_MAC0_MAR9H_MBC3          *((volatile unsigned char*)(0x42C8116CUL))
#define bFM4_ETHERNET_MAC0_MAR9H_MBC4          *((volatile unsigned char*)(0x42C81170UL))
#define bFM4_ETHERNET_MAC0_MAR9H_MBC5          *((volatile unsigned char*)(0x42C81174UL))
#define bFM4_ETHERNET_MAC0_MAR9H_SA            *((volatile unsigned char*)(0x42C81178UL))
#define bFM4_ETHERNET_MAC0_MAR10H_MBC0         *((volatile unsigned char*)(0x42C81260UL))
#define bFM4_ETHERNET_MAC0_MAR10H_MBC1         *((volatile unsigned char*)(0x42C81264UL))
#define bFM4_ETHERNET_MAC0_MAR10H_MBC2         *((volatile unsigned char*)(0x42C81268UL))
#define bFM4_ETHERNET_MAC0_MAR10H_MBC3         *((volatile unsigned char*)(0x42C8126CUL))
#define bFM4_ETHERNET_MAC0_MAR10H_MBC4         *((volatile unsigned char*)(0x42C81270UL))
#define bFM4_ETHERNET_MAC0_MAR10H_MBC5         *((volatile unsigned char*)(0x42C81274UL))
#define bFM4_ETHERNET_MAC0_MAR10H_SA           *((volatile unsigned char*)(0x42C81278UL))
#define bFM4_ETHERNET_MAC0_MAR11H_MBC0         *((volatile unsigned char*)(0x42C81360UL))
#define bFM4_ETHERNET_MAC0_MAR11H_MBC1         *((volatile unsigned char*)(0x42C81364UL))
#define bFM4_ETHERNET_MAC0_MAR11H_MBC2         *((volatile unsigned char*)(0x42C81368UL))
#define bFM4_ETHERNET_MAC0_MAR11H_MBC3         *((volatile unsigned char*)(0x42C8136CUL))
#define bFM4_ETHERNET_MAC0_MAR11H_MBC4         *((volatile unsigned char*)(0x42C81370UL))
#define bFM4_ETHERNET_MAC0_MAR11H_MBC5         *((volatile unsigned char*)(0x42C81374UL))
#define bFM4_ETHERNET_MAC0_MAR11H_SA           *((volatile unsigned char*)(0x42C81378UL))
#define bFM4_ETHERNET_MAC0_MAR12H_MBC0         *((volatile unsigned char*)(0x42C81460UL))
#define bFM4_ETHERNET_MAC0_MAR12H_MBC1         *((volatile unsigned char*)(0x42C81464UL))
#define bFM4_ETHERNET_MAC0_MAR12H_MBC2         *((volatile unsigned char*)(0x42C81468UL))
#define bFM4_ETHERNET_MAC0_MAR12H_MBC3         *((volatile unsigned char*)(0x42C8146CUL))
#define bFM4_ETHERNET_MAC0_MAR12H_MBC4         *((volatile unsigned char*)(0x42C81470UL))
#define bFM4_ETHERNET_MAC0_MAR12H_MBC5         *((volatile unsigned char*)(0x42C81474UL))
#define bFM4_ETHERNET_MAC0_MAR12H_SA           *((volatile unsigned char*)(0x42C81478UL))
#define bFM4_ETHERNET_MAC0_MAR13H_MBC0         *((volatile unsigned char*)(0x42C81560UL))
#define bFM4_ETHERNET_MAC0_MAR13H_MBC1         *((volatile unsigned char*)(0x42C81564UL))
#define bFM4_ETHERNET_MAC0_MAR13H_MBC2         *((volatile unsigned char*)(0x42C81568UL))
#define bFM4_ETHERNET_MAC0_MAR13H_MBC3         *((volatile unsigned char*)(0x42C8156CUL))
#define bFM4_ETHERNET_MAC0_MAR13H_MBC4         *((volatile unsigned char*)(0x42C81570UL))
#define bFM4_ETHERNET_MAC0_MAR13H_MBC5         *((volatile unsigned char*)(0x42C81574UL))
#define bFM4_ETHERNET_MAC0_MAR13H_SA           *((volatile unsigned char*)(0x42C81578UL))
#define bFM4_ETHERNET_MAC0_MAR14H_MBC0         *((volatile unsigned char*)(0x42C81660UL))
#define bFM4_ETHERNET_MAC0_MAR14H_MBC1         *((volatile unsigned char*)(0x42C81664UL))
#define bFM4_ETHERNET_MAC0_MAR14H_MBC2         *((volatile unsigned char*)(0x42C81668UL))
#define bFM4_ETHERNET_MAC0_MAR14H_MBC3         *((volatile unsigned char*)(0x42C8166CUL))
#define bFM4_ETHERNET_MAC0_MAR14H_MBC4         *((volatile unsigned char*)(0x42C81670UL))
#define bFM4_ETHERNET_MAC0_MAR14H_MBC5         *((volatile unsigned char*)(0x42C81674UL))
#define bFM4_ETHERNET_MAC0_MAR14H_SA           *((volatile unsigned char*)(0x42C81678UL))
#define bFM4_ETHERNET_MAC0_MAR15H_MBC0         *((volatile unsigned char*)(0x42C81760UL))
#define bFM4_ETHERNET_MAC0_MAR15H_MBC1         *((volatile unsigned char*)(0x42C81764UL))
#define bFM4_ETHERNET_MAC0_MAR15H_MBC2         *((volatile unsigned char*)(0x42C81768UL))
#define bFM4_ETHERNET_MAC0_MAR15H_MBC3         *((volatile unsigned char*)(0x42C8176CUL))
#define bFM4_ETHERNET_MAC0_MAR15H_MBC4         *((volatile unsigned char*)(0x42C81770UL))
#define bFM4_ETHERNET_MAC0_MAR15H_MBC5         *((volatile unsigned char*)(0x42C81774UL))
#define bFM4_ETHERNET_MAC0_MAR15H_SA           *((volatile unsigned char*)(0x42C81778UL))
#define bFM4_ETHERNET_MAC0_RGSR_LM             *((volatile unsigned char*)(0x42C81B00UL))
#define bFM4_ETHERNET_MAC0_RGSR_LSP0           *((volatile unsigned char*)(0x42C81B04UL))
#define bFM4_ETHERNET_MAC0_RGSR_LSP1           *((volatile unsigned char*)(0x42C81B08UL))
#define bFM4_ETHERNET_MAC0_RGSR_LS             *((volatile unsigned char*)(0x42C81B0CUL))
#define bFM4_ETHERNET_MAC0_TSCR_TSE            *((volatile unsigned char*)(0x42C8E000UL))
#define bFM4_ETHERNET_MAC0_TSCR_TFCU           *((volatile unsigned char*)(0x42C8E004UL))
#define bFM4_ETHERNET_MAC0_TSCR_TSI            *((volatile unsigned char*)(0x42C8E008UL))
#define bFM4_ETHERNET_MAC0_TSCR_TSU            *((volatile unsigned char*)(0x42C8E00CUL))
#define bFM4_ETHERNET_MAC0_TSCR_TITE           *((volatile unsigned char*)(0x42C8E010UL))
#define bFM4_ETHERNET_MAC0_TSCR_TARU           *((volatile unsigned char*)(0x42C8E014UL))
#define bFM4_ETHERNET_MAC0_TSCR_TSEA           *((volatile unsigned char*)(0x42C8E020UL))
#define bFM4_ETHERNET_MAC0_TSCR_TSDB           *((volatile unsigned char*)(0x42C8E024UL))
#define bFM4_ETHERNET_MAC0_TSCR_TSV2E          *((volatile unsigned char*)(0x42C8E028UL))
#define bFM4_ETHERNET_MAC0_TSCR_TETSP          *((volatile unsigned char*)(0x42C8E02CUL))
#define bFM4_ETHERNET_MAC0_TSCR_TSIP6E         *((volatile unsigned char*)(0x42C8E030UL))
#define bFM4_ETHERNET_MAC0_TSCR_TSIP4E         *((volatile unsigned char*)(0x42C8E034UL))
#define bFM4_ETHERNET_MAC0_TSCR_TETSEM         *((volatile unsigned char*)(0x42C8E038UL))
#define bFM4_ETHERNET_MAC0_TSCR_TSMRM          *((volatile unsigned char*)(0x42C8E03CUL))
#define bFM4_ETHERNET_MAC0_TSCR_TSPS0          *((volatile unsigned char*)(0x42C8E040UL))
#define bFM4_ETHERNET_MAC0_TSCR_TSPS1          *((volatile unsigned char*)(0x42C8E044UL))
#define bFM4_ETHERNET_MAC0_TSCR_TSENMF         *((volatile unsigned char*)(0x42C8E048UL))
#define bFM4_ETHERNET_MAC0_TSCR_ATSFC          *((volatile unsigned char*)(0x42C8E060UL))
#define bFM4_ETHERNET_MAC0_SSIR_SSINC0         *((volatile unsigned char*)(0x42C8E080UL))
#define bFM4_ETHERNET_MAC0_SSIR_SSINC1         *((volatile unsigned char*)(0x42C8E084UL))
#define bFM4_ETHERNET_MAC0_SSIR_SSINC2         *((volatile unsigned char*)(0x42C8E088UL))
#define bFM4_ETHERNET_MAC0_SSIR_SSINC3         *((volatile unsigned char*)(0x42C8E08CUL))
#define bFM4_ETHERNET_MAC0_SSIR_SSINC4         *((volatile unsigned char*)(0x42C8E090UL))
#define bFM4_ETHERNET_MAC0_SSIR_SSINC5         *((volatile unsigned char*)(0x42C8E094UL))
#define bFM4_ETHERNET_MAC0_SSIR_SSINC6         *((volatile unsigned char*)(0x42C8E098UL))
#define bFM4_ETHERNET_MAC0_SSIR_SSINC7         *((volatile unsigned char*)(0x42C8E09CUL))
#define bFM4_ETHERNET_MAC0_STSR_TSS0           *((volatile unsigned char*)(0x42C8E100UL))
#define bFM4_ETHERNET_MAC0_STSR_TSS1           *((volatile unsigned char*)(0x42C8E104UL))
#define bFM4_ETHERNET_MAC0_STSR_TSS2           *((volatile unsigned char*)(0x42C8E108UL))
#define bFM4_ETHERNET_MAC0_STSR_TSS3           *((volatile unsigned char*)(0x42C8E10CUL))
#define bFM4_ETHERNET_MAC0_STSR_TSS4           *((volatile unsigned char*)(0x42C8E110UL))
#define bFM4_ETHERNET_MAC0_STSR_TSS5           *((volatile unsigned char*)(0x42C8E114UL))
#define bFM4_ETHERNET_MAC0_STSR_TSS6           *((volatile unsigned char*)(0x42C8E118UL))
#define bFM4_ETHERNET_MAC0_STSR_TSS7           *((volatile unsigned char*)(0x42C8E11CUL))
#define bFM4_ETHERNET_MAC0_STSR_TSS8           *((volatile unsigned char*)(0x42C8E120UL))
#define bFM4_ETHERNET_MAC0_STSR_TSS9           *((volatile unsigned char*)(0x42C8E124UL))
#define bFM4_ETHERNET_MAC0_STSR_TSS10          *((volatile unsigned char*)(0x42C8E128UL))
#define bFM4_ETHERNET_MAC0_STSR_TSS11          *((volatile unsigned char*)(0x42C8E12CUL))
#define bFM4_ETHERNET_MAC0_STSR_TSS12          *((volatile unsigned char*)(0x42C8E130UL))
#define bFM4_ETHERNET_MAC0_STSR_TSS13          *((volatile unsigned char*)(0x42C8E134UL))
#define bFM4_ETHERNET_MAC0_STSR_TSS14          *((volatile unsigned char*)(0x42C8E138UL))
#define bFM4_ETHERNET_MAC0_STSR_TSS15          *((volatile unsigned char*)(0x42C8E13CUL))
#define bFM4_ETHERNET_MAC0_STSR_TSS16          *((volatile unsigned char*)(0x42C8E140UL))
#define bFM4_ETHERNET_MAC0_STSR_TSS17          *((volatile unsigned char*)(0x42C8E144UL))
#define bFM4_ETHERNET_MAC0_STSR_TSS18          *((volatile unsigned char*)(0x42C8E148UL))
#define bFM4_ETHERNET_MAC0_STSR_TSS19          *((volatile unsigned char*)(0x42C8E14CUL))
#define bFM4_ETHERNET_MAC0_STSR_TSS20          *((volatile unsigned char*)(0x42C8E150UL))
#define bFM4_ETHERNET_MAC0_STSR_TSS21          *((volatile unsigned char*)(0x42C8E154UL))
#define bFM4_ETHERNET_MAC0_STSR_TSS22          *((volatile unsigned char*)(0x42C8E158UL))
#define bFM4_ETHERNET_MAC0_STSR_TSS23          *((volatile unsigned char*)(0x42C8E15CUL))
#define bFM4_ETHERNET_MAC0_STSR_TSS24          *((volatile unsigned char*)(0x42C8E160UL))
#define bFM4_ETHERNET_MAC0_STSR_TSS25          *((volatile unsigned char*)(0x42C8E164UL))
#define bFM4_ETHERNET_MAC0_STSR_TSS26          *((volatile unsigned char*)(0x42C8E168UL))
#define bFM4_ETHERNET_MAC0_STSR_TSS27          *((volatile unsigned char*)(0x42C8E16CUL))
#define bFM4_ETHERNET_MAC0_STSR_TSS28          *((volatile unsigned char*)(0x42C8E170UL))
#define bFM4_ETHERNET_MAC0_STSR_TSS29          *((volatile unsigned char*)(0x42C8E174UL))
#define bFM4_ETHERNET_MAC0_STSR_TSS30          *((volatile unsigned char*)(0x42C8E178UL))
#define bFM4_ETHERNET_MAC0_STSR_TSS31          *((volatile unsigned char*)(0x42C8E17CUL))
#define bFM4_ETHERNET_MAC0_STNR_TSSS0          *((volatile unsigned char*)(0x42C8E180UL))
#define bFM4_ETHERNET_MAC0_STNR_TSSS1          *((volatile unsigned char*)(0x42C8E184UL))
#define bFM4_ETHERNET_MAC0_STNR_TSSS2          *((volatile unsigned char*)(0x42C8E188UL))
#define bFM4_ETHERNET_MAC0_STNR_TSSS3          *((volatile unsigned char*)(0x42C8E18CUL))
#define bFM4_ETHERNET_MAC0_STNR_TSSS4          *((volatile unsigned char*)(0x42C8E190UL))
#define bFM4_ETHERNET_MAC0_STNR_TSSS5          *((volatile unsigned char*)(0x42C8E194UL))
#define bFM4_ETHERNET_MAC0_STNR_TSSS6          *((volatile unsigned char*)(0x42C8E198UL))
#define bFM4_ETHERNET_MAC0_STNR_TSSS7          *((volatile unsigned char*)(0x42C8E19CUL))
#define bFM4_ETHERNET_MAC0_STNR_TSSS8          *((volatile unsigned char*)(0x42C8E1A0UL))
#define bFM4_ETHERNET_MAC0_STNR_TSSS9          *((volatile unsigned char*)(0x42C8E1A4UL))
#define bFM4_ETHERNET_MAC0_STNR_TSSS10         *((volatile unsigned char*)(0x42C8E1A8UL))
#define bFM4_ETHERNET_MAC0_STNR_TSSS11         *((volatile unsigned char*)(0x42C8E1ACUL))
#define bFM4_ETHERNET_MAC0_STNR_TSSS12         *((volatile unsigned char*)(0x42C8E1B0UL))
#define bFM4_ETHERNET_MAC0_STNR_TSSS13         *((volatile unsigned char*)(0x42C8E1B4UL))
#define bFM4_ETHERNET_MAC0_STNR_TSSS14         *((volatile unsigned char*)(0x42C8E1B8UL))
#define bFM4_ETHERNET_MAC0_STNR_TSSS15         *((volatile unsigned char*)(0x42C8E1BCUL))
#define bFM4_ETHERNET_MAC0_STNR_TSSS16         *((volatile unsigned char*)(0x42C8E1C0UL))
#define bFM4_ETHERNET_MAC0_STNR_TSSS17         *((volatile unsigned char*)(0x42C8E1C4UL))
#define bFM4_ETHERNET_MAC0_STNR_TSSS18         *((volatile unsigned char*)(0x42C8E1C8UL))
#define bFM4_ETHERNET_MAC0_STNR_TSSS19         *((volatile unsigned char*)(0x42C8E1CCUL))
#define bFM4_ETHERNET_MAC0_STNR_TSSS20         *((volatile unsigned char*)(0x42C8E1D0UL))
#define bFM4_ETHERNET_MAC0_STNR_TSSS21         *((volatile unsigned char*)(0x42C8E1D4UL))
#define bFM4_ETHERNET_MAC0_STNR_TSSS22         *((volatile unsigned char*)(0x42C8E1D8UL))
#define bFM4_ETHERNET_MAC0_STNR_TSSS23         *((volatile unsigned char*)(0x42C8E1DCUL))
#define bFM4_ETHERNET_MAC0_STNR_TSSS24         *((volatile unsigned char*)(0x42C8E1E0UL))
#define bFM4_ETHERNET_MAC0_STNR_TSSS25         *((volatile unsigned char*)(0x42C8E1E4UL))
#define bFM4_ETHERNET_MAC0_STNR_TSSS26         *((volatile unsigned char*)(0x42C8E1E8UL))
#define bFM4_ETHERNET_MAC0_STNR_TSSS27         *((volatile unsigned char*)(0x42C8E1ECUL))
#define bFM4_ETHERNET_MAC0_STNR_TSSS28         *((volatile unsigned char*)(0x42C8E1F0UL))
#define bFM4_ETHERNET_MAC0_STNR_TSSS29         *((volatile unsigned char*)(0x42C8E1F4UL))
#define bFM4_ETHERNET_MAC0_STNR_TSSS30         *((volatile unsigned char*)(0x42C8E1F8UL))
#define bFM4_ETHERNET_MAC0_STSUR_TSS0          *((volatile unsigned char*)(0x42C8E200UL))
#define bFM4_ETHERNET_MAC0_STSUR_TSS1          *((volatile unsigned char*)(0x42C8E204UL))
#define bFM4_ETHERNET_MAC0_STSUR_TSS2          *((volatile unsigned char*)(0x42C8E208UL))
#define bFM4_ETHERNET_MAC0_STSUR_TSS3          *((volatile unsigned char*)(0x42C8E20CUL))
#define bFM4_ETHERNET_MAC0_STSUR_TSS4          *((volatile unsigned char*)(0x42C8E210UL))
#define bFM4_ETHERNET_MAC0_STSUR_TSS5          *((volatile unsigned char*)(0x42C8E214UL))
#define bFM4_ETHERNET_MAC0_STSUR_TSS6          *((volatile unsigned char*)(0x42C8E218UL))
#define bFM4_ETHERNET_MAC0_STSUR_TSS7          *((volatile unsigned char*)(0x42C8E21CUL))
#define bFM4_ETHERNET_MAC0_STSUR_TSS8          *((volatile unsigned char*)(0x42C8E220UL))
#define bFM4_ETHERNET_MAC0_STSUR_TSS9          *((volatile unsigned char*)(0x42C8E224UL))
#define bFM4_ETHERNET_MAC0_STSUR_TSS10         *((volatile unsigned char*)(0x42C8E228UL))
#define bFM4_ETHERNET_MAC0_STSUR_TSS11         *((volatile unsigned char*)(0x42C8E22CUL))
#define bFM4_ETHERNET_MAC0_STSUR_TSS12         *((volatile unsigned char*)(0x42C8E230UL))
#define bFM4_ETHERNET_MAC0_STSUR_TSS13         *((volatile unsigned char*)(0x42C8E234UL))
#define bFM4_ETHERNET_MAC0_STSUR_TSS14         *((volatile unsigned char*)(0x42C8E238UL))
#define bFM4_ETHERNET_MAC0_STSUR_TSS15         *((volatile unsigned char*)(0x42C8E23CUL))
#define bFM4_ETHERNET_MAC0_STSUR_TSS16         *((volatile unsigned char*)(0x42C8E240UL))
#define bFM4_ETHERNET_MAC0_STSUR_TSS17         *((volatile unsigned char*)(0x42C8E244UL))
#define bFM4_ETHERNET_MAC0_STSUR_TSS18         *((volatile unsigned char*)(0x42C8E248UL))
#define bFM4_ETHERNET_MAC0_STSUR_TSS19         *((volatile unsigned char*)(0x42C8E24CUL))
#define bFM4_ETHERNET_MAC0_STSUR_TSS20         *((volatile unsigned char*)(0x42C8E250UL))
#define bFM4_ETHERNET_MAC0_STSUR_TSS21         *((volatile unsigned char*)(0x42C8E254UL))
#define bFM4_ETHERNET_MAC0_STSUR_TSS22         *((volatile unsigned char*)(0x42C8E258UL))
#define bFM4_ETHERNET_MAC0_STSUR_TSS23         *((volatile unsigned char*)(0x42C8E25CUL))
#define bFM4_ETHERNET_MAC0_STSUR_TSS24         *((volatile unsigned char*)(0x42C8E260UL))
#define bFM4_ETHERNET_MAC0_STSUR_TSS25         *((volatile unsigned char*)(0x42C8E264UL))
#define bFM4_ETHERNET_MAC0_STSUR_TSS26         *((volatile unsigned char*)(0x42C8E268UL))
#define bFM4_ETHERNET_MAC0_STSUR_TSS27         *((volatile unsigned char*)(0x42C8E26CUL))
#define bFM4_ETHERNET_MAC0_STSUR_TSS28         *((volatile unsigned char*)(0x42C8E270UL))
#define bFM4_ETHERNET_MAC0_STSUR_TSS29         *((volatile unsigned char*)(0x42C8E274UL))
#define bFM4_ETHERNET_MAC0_STSUR_TSS30         *((volatile unsigned char*)(0x42C8E278UL))
#define bFM4_ETHERNET_MAC0_STSUR_TSS31         *((volatile unsigned char*)(0x42C8E27CUL))
#define bFM4_ETHERNET_MAC0_STNUR_TSSS0         *((volatile unsigned char*)(0x42C8E280UL))
#define bFM4_ETHERNET_MAC0_STNUR_TSSS1         *((volatile unsigned char*)(0x42C8E284UL))
#define bFM4_ETHERNET_MAC0_STNUR_TSSS2         *((volatile unsigned char*)(0x42C8E288UL))
#define bFM4_ETHERNET_MAC0_STNUR_TSSS3         *((volatile unsigned char*)(0x42C8E28CUL))
#define bFM4_ETHERNET_MAC0_STNUR_TSSS4         *((volatile unsigned char*)(0x42C8E290UL))
#define bFM4_ETHERNET_MAC0_STNUR_TSSS5         *((volatile unsigned char*)(0x42C8E294UL))
#define bFM4_ETHERNET_MAC0_STNUR_TSSS6         *((volatile unsigned char*)(0x42C8E298UL))
#define bFM4_ETHERNET_MAC0_STNUR_TSSS7         *((volatile unsigned char*)(0x42C8E29CUL))
#define bFM4_ETHERNET_MAC0_STNUR_TSSS8         *((volatile unsigned char*)(0x42C8E2A0UL))
#define bFM4_ETHERNET_MAC0_STNUR_TSSS9         *((volatile unsigned char*)(0x42C8E2A4UL))
#define bFM4_ETHERNET_MAC0_STNUR_TSSS10        *((volatile unsigned char*)(0x42C8E2A8UL))
#define bFM4_ETHERNET_MAC0_STNUR_TSSS11        *((volatile unsigned char*)(0x42C8E2ACUL))
#define bFM4_ETHERNET_MAC0_STNUR_TSSS12        *((volatile unsigned char*)(0x42C8E2B0UL))
#define bFM4_ETHERNET_MAC0_STNUR_TSSS13        *((volatile unsigned char*)(0x42C8E2B4UL))
#define bFM4_ETHERNET_MAC0_STNUR_TSSS14        *((volatile unsigned char*)(0x42C8E2B8UL))
#define bFM4_ETHERNET_MAC0_STNUR_TSSS15        *((volatile unsigned char*)(0x42C8E2BCUL))
#define bFM4_ETHERNET_MAC0_STNUR_TSSS16        *((volatile unsigned char*)(0x42C8E2C0UL))
#define bFM4_ETHERNET_MAC0_STNUR_TSSS17        *((volatile unsigned char*)(0x42C8E2C4UL))
#define bFM4_ETHERNET_MAC0_STNUR_TSSS18        *((volatile unsigned char*)(0x42C8E2C8UL))
#define bFM4_ETHERNET_MAC0_STNUR_TSSS19        *((volatile unsigned char*)(0x42C8E2CCUL))
#define bFM4_ETHERNET_MAC0_STNUR_TSSS20        *((volatile unsigned char*)(0x42C8E2D0UL))
#define bFM4_ETHERNET_MAC0_STNUR_TSSS21        *((volatile unsigned char*)(0x42C8E2D4UL))
#define bFM4_ETHERNET_MAC0_STNUR_TSSS22        *((volatile unsigned char*)(0x42C8E2D8UL))
#define bFM4_ETHERNET_MAC0_STNUR_TSSS23        *((volatile unsigned char*)(0x42C8E2DCUL))
#define bFM4_ETHERNET_MAC0_STNUR_TSSS24        *((volatile unsigned char*)(0x42C8E2E0UL))
#define bFM4_ETHERNET_MAC0_STNUR_TSSS25        *((volatile unsigned char*)(0x42C8E2E4UL))
#define bFM4_ETHERNET_MAC0_STNUR_TSSS26        *((volatile unsigned char*)(0x42C8E2E8UL))
#define bFM4_ETHERNET_MAC0_STNUR_TSSS27        *((volatile unsigned char*)(0x42C8E2ECUL))
#define bFM4_ETHERNET_MAC0_STNUR_TSSS28        *((volatile unsigned char*)(0x42C8E2F0UL))
#define bFM4_ETHERNET_MAC0_STNUR_TSSS29        *((volatile unsigned char*)(0x42C8E2F4UL))
#define bFM4_ETHERNET_MAC0_STNUR_TSSS30        *((volatile unsigned char*)(0x42C8E2F8UL))
#define bFM4_ETHERNET_MAC0_STNUR_ADDSUB        *((volatile unsigned char*)(0x42C8E2FCUL))
#define bFM4_ETHERNET_MAC0_TSAR_TSAR0          *((volatile unsigned char*)(0x42C8E300UL))
#define bFM4_ETHERNET_MAC0_TSAR_TSAR1          *((volatile unsigned char*)(0x42C8E304UL))
#define bFM4_ETHERNET_MAC0_TSAR_TSAR2          *((volatile unsigned char*)(0x42C8E308UL))
#define bFM4_ETHERNET_MAC0_TSAR_TSAR3          *((volatile unsigned char*)(0x42C8E30CUL))
