sol4ik/audio-steganography/try/fm4/s6e2cc_i2s_sk-fm4-176l-s6se2cc-v10/common/s6e2cc.h
#define bFM4_ETHERNET_MAC0_MAR27H_MBC4         *((volatile unsigned char*)(0x42C90B70UL))
#define bFM4_ETHERNET_MAC0_MAR27H_MBC5         *((volatile unsigned char*)(0x42C90B74UL))
#define bFM4_ETHERNET_MAC0_MAR27H_SA           *((volatile unsigned char*)(0x42C90B78UL))
#define bFM4_ETHERNET_MAC0_MAR28H_MBC0         *((volatile unsigned char*)(0x42C90C60UL))
#define bFM4_ETHERNET_MAC0_MAR28H_MBC1         *((volatile unsigned char*)(0x42C90C64UL))
#define bFM4_ETHERNET_MAC0_MAR28H_MBC2         *((volatile unsigned char*)(0x42C90C68UL))
#define bFM4_ETHERNET_MAC0_MAR28H_MBC3         *((volatile unsigned char*)(0x42C90C6CUL))
#define bFM4_ETHERNET_MAC0_MAR28H_MBC4         *((volatile unsigned char*)(0x42C90C70UL))
#define bFM4_ETHERNET_MAC0_MAR28H_MBC5         *((volatile unsigned char*)(0x42C90C74UL))
#define bFM4_ETHERNET_MAC0_MAR28H_SA           *((volatile unsigned char*)(0x42C90C78UL))
#define bFM4_ETHERNET_MAC0_MAR29H_MBC0         *((volatile unsigned char*)(0x42C90D60UL))
#define bFM4_ETHERNET_MAC0_MAR29H_MBC1         *((volatile unsigned char*)(0x42C90D64UL))
#define bFM4_ETHERNET_MAC0_MAR29H_MBC2         *((volatile unsigned char*)(0x42C90D68UL))
#define bFM4_ETHERNET_MAC0_MAR29H_MBC3         *((volatile unsigned char*)(0x42C90D6CUL))
#define bFM4_ETHERNET_MAC0_MAR29H_MBC4         *((volatile unsigned char*)(0x42C90D70UL))
#define bFM4_ETHERNET_MAC0_MAR29H_MBC5         *((volatile unsigned char*)(0x42C90D74UL))
#define bFM4_ETHERNET_MAC0_MAR29H_SA           *((volatile unsigned char*)(0x42C90D78UL))
#define bFM4_ETHERNET_MAC0_MAR30H_MBC0         *((volatile unsigned char*)(0x42C90E60UL))
#define bFM4_ETHERNET_MAC0_MAR30H_MBC1         *((volatile unsigned char*)(0x42C90E64UL))
#define bFM4_ETHERNET_MAC0_MAR30H_MBC2         *((volatile unsigned char*)(0x42C90E68UL))
#define bFM4_ETHERNET_MAC0_MAR30H_MBC3         *((volatile unsigned char*)(0x42C90E6CUL))
#define bFM4_ETHERNET_MAC0_MAR30H_MBC4         *((volatile unsigned char*)(0x42C90E70UL))
#define bFM4_ETHERNET_MAC0_MAR30H_MBC5         *((volatile unsigned char*)(0x42C90E74UL))
#define bFM4_ETHERNET_MAC0_MAR30H_SA           *((volatile unsigned char*)(0x42C90E78UL))
#define bFM4_ETHERNET_MAC0_MAR31H_MBC0         *((volatile unsigned char*)(0x42C90F60UL))
#define bFM4_ETHERNET_MAC0_MAR31H_MBC1         *((volatile unsigned char*)(0x42C90F64UL))
#define bFM4_ETHERNET_MAC0_MAR31H_MBC2         *((volatile unsigned char*)(0x42C90F68UL))
#define bFM4_ETHERNET_MAC0_MAR31H_MBC3         *((volatile unsigned char*)(0x42C90F6CUL))
#define bFM4_ETHERNET_MAC0_MAR31H_MBC4         *((volatile unsigned char*)(0x42C90F70UL))
#define bFM4_ETHERNET_MAC0_MAR31H_MBC5         *((volatile unsigned char*)(0x42C90F74UL))
#define bFM4_ETHERNET_MAC0_MAR31H_SA           *((volatile unsigned char*)(0x42C90F78UL))
#define bFM4_ETHERNET_MAC0_BMR_SWR             *((volatile unsigned char*)(0x42CA0000UL))
#define bFM4_ETHERNET_MAC0_BMR_DA              *((volatile unsigned char*)(0x42CA0004UL))
#define bFM4_ETHERNET_MAC0_BMR_DSL0            *((volatile unsigned char*)(0x42CA0008UL))
#define bFM4_ETHERNET_MAC0_BMR_DSL1            *((volatile unsigned char*)(0x42CA000CUL))
#define bFM4_ETHERNET_MAC0_BMR_DSL2            *((volatile unsigned char*)(0x42CA0010UL))
#define bFM4_ETHERNET_MAC0_BMR_DSL3            *((volatile unsigned char*)(0x42CA0014UL))
#define bFM4_ETHERNET_MAC0_BMR_DSL4            *((volatile unsigned char*)(0x42CA0018UL))
#define bFM4_ETHERNET_MAC0_BMR_ATDS            *((volatile unsigned char*)(0x42CA001CUL))
#define bFM4_ETHERNET_MAC0_BMR_PBL0            *((volatile unsigned char*)(0x42CA0020UL))
#define bFM4_ETHERNET_MAC0_BMR_PBL1            *((volatile unsigned char*)(0x42CA0024UL))
#define bFM4_ETHERNET_MAC0_BMR_PBL2            *((volatile unsigned char*)(0x42CA0028UL))
#define bFM4_ETHERNET_MAC0_BMR_PBL3            *((volatile unsigned char*)(0x42CA002CUL))
#define bFM4_ETHERNET_MAC0_BMR_PBL4            *((volatile unsigned char*)(0x42CA0030UL))
#define bFM4_ETHERNET_MAC0_BMR_PBL5            *((volatile unsigned char*)(0x42CA0034UL))
#define bFM4_ETHERNET_MAC0_BMR_PR0             *((volatile unsigned char*)(0x42CA0038UL))
#define bFM4_ETHERNET_MAC0_BMR_PR1             *((volatile unsigned char*)(0x42CA003CUL))
#define bFM4_ETHERNET_MAC0_BMR_FB              *((volatile unsigned char*)(0x42CA0040UL))
#define bFM4_ETHERNET_MAC0_BMR_RPBL0           *((volatile unsigned char*)(0x42CA0044UL))
#define bFM4_ETHERNET_MAC0_BMR_RPBL1           *((volatile unsigned char*)(0x42CA0048UL))
#define bFM4_ETHERNET_MAC0_BMR_RPBL2           *((volatile unsigned char*)(0x42CA004CUL))
#define bFM4_ETHERNET_MAC0_BMR_RPBL3           *((volatile unsigned char*)(0x42CA0050UL))
#define bFM4_ETHERNET_MAC0_BMR_RPBL4           *((volatile unsigned char*)(0x42CA0054UL))
#define bFM4_ETHERNET_MAC0_BMR_RPBL5           *((volatile unsigned char*)(0x42CA0058UL))
#define bFM4_ETHERNET_MAC0_BMR_USP             *((volatile unsigned char*)(0x42CA005CUL))
#define bFM4_ETHERNET_MAC0_BMR_8XPBL           *((volatile unsigned char*)(0x42CA0060UL))
#define bFM4_ETHERNET_MAC0_BMR_AAL             *((volatile unsigned char*)(0x42CA0064UL))
#define bFM4_ETHERNET_MAC0_BMR_MB              *((volatile unsigned char*)(0x42CA0068UL))
#define bFM4_ETHERNET_MAC0_BMR_TXPR            *((volatile unsigned char*)(0x42CA006CUL))
#define bFM4_ETHERNET_MAC0_TPDR_TPD0           *((volatile unsigned char*)(0x42CA0080UL))
#define bFM4_ETHERNET_MAC0_TPDR_TPD1           *((volatile unsigned char*)(0x42CA0084UL))
#define bFM4_ETHERNET_MAC0_TPDR_TPD2           *((volatile unsigned char*)(0x42CA0088UL))
#define bFM4_ETHERNET_MAC0_TPDR_TPD3           *((volatile unsigned char*)(0x42CA008CUL))
#define bFM4_ETHERNET_MAC0_TPDR_TPD4           *((volatile unsigned char*)(0x42CA0090UL))
#define bFM4_ETHERNET_MAC0_TPDR_TPD5           *((volatile unsigned char*)(0x42CA0094UL))
#define bFM4_ETHERNET_MAC0_TPDR_TPD6           *((volatile unsigned char*)(0x42CA0098UL))
#define bFM4_ETHERNET_MAC0_TPDR_TPD7           *((volatile unsigned char*)(0x42CA009CUL))
#define bFM4_ETHERNET_MAC0_TPDR_TPD8           *((volatile unsigned char*)(0x42CA00A0UL))
#define bFM4_ETHERNET_MAC0_TPDR_TPD9           *((volatile unsigned char*)(0x42CA00A4UL))
#define bFM4_ETHERNET_MAC0_TPDR_TPD10          *((volatile unsigned char*)(0x42CA00A8UL))
#define bFM4_ETHERNET_MAC0_TPDR_TPD11          *((volatile unsigned char*)(0x42CA00ACUL))
#define bFM4_ETHERNET_MAC0_TPDR_TPD12          *((volatile unsigned char*)(0x42CA00B0UL))
#define bFM4_ETHERNET_MAC0_TPDR_TPD13          *((volatile unsigned char*)(0x42CA00B4UL))
#define bFM4_ETHERNET_MAC0_TPDR_TPD14          *((volatile unsigned char*)(0x42CA00B8UL))
#define bFM4_ETHERNET_MAC0_TPDR_TPD15          *((volatile unsigned char*)(0x42CA00BCUL))
#define bFM4_ETHERNET_MAC0_TPDR_TPD16          *((volatile unsigned char*)(0x42CA00C0UL))
#define bFM4_ETHERNET_MAC0_TPDR_TPD17          *((volatile unsigned char*)(0x42CA00C4UL))
#define bFM4_ETHERNET_MAC0_TPDR_TPD18          *((volatile unsigned char*)(0x42CA00C8UL))
#define bFM4_ETHERNET_MAC0_TPDR_TPD19          *((volatile unsigned char*)(0x42CA00CCUL))
#define bFM4_ETHERNET_MAC0_TPDR_TPD20          *((volatile unsigned char*)(0x42CA00D0UL))
#define bFM4_ETHERNET_MAC0_TPDR_TPD21          *((volatile unsigned char*)(0x42CA00D4UL))
#define bFM4_ETHERNET_MAC0_TPDR_TPD22          *((volatile unsigned char*)(0x42CA00D8UL))
#define bFM4_ETHERNET_MAC0_TPDR_TPD23          *((volatile unsigned char*)(0x42CA00DCUL))
#define bFM4_ETHERNET_MAC0_TPDR_TPD24          *((volatile unsigned char*)(0x42CA00E0UL))
#define bFM4_ETHERNET_MAC0_TPDR_TPD25          *((volatile unsigned char*)(0x42CA00E4UL))
#define bFM4_ETHERNET_MAC0_TPDR_TPD26          *((volatile unsigned char*)(0x42CA00E8UL))
#define bFM4_ETHERNET_MAC0_TPDR_TPD27          *((volatile unsigned char*)(0x42CA00ECUL))
#define bFM4_ETHERNET_MAC0_TPDR_TPD28          *((volatile unsigned char*)(0x42CA00F0UL))
#define bFM4_ETHERNET_MAC0_TPDR_TPD29          *((volatile unsigned char*)(0x42CA00F4UL))
#define bFM4_ETHERNET_MAC0_TPDR_TPD30          *((volatile unsigned char*)(0x42CA00F8UL))
#define bFM4_ETHERNET_MAC0_TPDR_TPD31          *((volatile unsigned char*)(0x42CA00FCUL))
#define bFM4_ETHERNET_MAC0_RPDR_RPD0           *((volatile unsigned char*)(0x42CA0100UL))
#define bFM4_ETHERNET_MAC0_RPDR_RPD1           *((volatile unsigned char*)(0x42CA0104UL))
#define bFM4_ETHERNET_MAC0_RPDR_RPD2           *((volatile unsigned char*)(0x42CA0108UL))
#define bFM4_ETHERNET_MAC0_RPDR_RPD3           *((volatile unsigned char*)(0x42CA010CUL))
#define bFM4_ETHERNET_MAC0_RPDR_RPD4           *((volatile unsigned char*)(0x42CA0110UL))
#define bFM4_ETHERNET_MAC0_RPDR_RPD5           *((volatile unsigned char*)(0x42CA0114UL))
#define bFM4_ETHERNET_MAC0_RPDR_RPD6           *((volatile unsigned char*)(0x42CA0118UL))
#define bFM4_ETHERNET_MAC0_RPDR_RPD7           *((volatile unsigned char*)(0x42CA011CUL))
#define bFM4_ETHERNET_MAC0_RPDR_RPD8           *((volatile unsigned char*)(0x42CA0120UL))
#define bFM4_ETHERNET_MAC0_RPDR_RPD9           *((volatile unsigned char*)(0x42CA0124UL))
#define bFM4_ETHERNET_MAC0_RPDR_RPD10          *((volatile unsigned char*)(0x42CA0128UL))
#define bFM4_ETHERNET_MAC0_RPDR_RPD11          *((volatile unsigned char*)(0x42CA012CUL))
#define bFM4_ETHERNET_MAC0_RPDR_RPD12          *((volatile unsigned char*)(0x42CA0130UL))
#define bFM4_ETHERNET_MAC0_RPDR_RPD13          *((volatile unsigned char*)(0x42CA0134UL))
#define bFM4_ETHERNET_MAC0_RPDR_RPD14          *((volatile unsigned char*)(0x42CA0138UL))
#define bFM4_ETHERNET_MAC0_RPDR_RPD15          *((volatile unsigned char*)(0x42CA013CUL))
#define bFM4_ETHERNET_MAC0_RPDR_RPD16          *((volatile unsigned char*)(0x42CA0140UL))
#define bFM4_ETHERNET_MAC0_RPDR_RPD17          *((volatile unsigned char*)(0x42CA0144UL))
#define bFM4_ETHERNET_MAC0_RPDR_RPD18          *((volatile unsigned char*)(0x42CA0148UL))
#define bFM4_ETHERNET_MAC0_RPDR_RPD19          *((volatile unsigned char*)(0x42CA014CUL))
#define bFM4_ETHERNET_MAC0_RPDR_RPD20          *((volatile unsigned char*)(0x42CA0150UL))
#define bFM4_ETHERNET_MAC0_RPDR_RPD21          *((volatile unsigned char*)(0x42CA0154UL))
#define bFM4_ETHERNET_MAC0_RPDR_RPD22          *((volatile unsigned char*)(0x42CA0158UL))
#define bFM4_ETHERNET_MAC0_RPDR_RPD23          *((volatile unsigned char*)(0x42CA015CUL))
#define bFM4_ETHERNET_MAC0_RPDR_RPD24          *((volatile unsigned char*)(0x42CA0160UL))
#define bFM4_ETHERNET_MAC0_RPDR_RPD25          *((volatile unsigned char*)(0x42CA0164UL))
#define bFM4_ETHERNET_MAC0_RPDR_RPD26          *((volatile unsigned char*)(0x42CA0168UL))
#define bFM4_ETHERNET_MAC0_RPDR_RPD27          *((volatile unsigned char*)(0x42CA016CUL))
#define bFM4_ETHERNET_MAC0_RPDR_RPD28          *((volatile unsigned char*)(0x42CA0170UL))
#define bFM4_ETHERNET_MAC0_RPDR_RPD29          *((volatile unsigned char*)(0x42CA0174UL))
#define bFM4_ETHERNET_MAC0_RPDR_RPD30          *((volatile unsigned char*)(0x42CA0178UL))
#define bFM4_ETHERNET_MAC0_RPDR_RPD31          *((volatile unsigned char*)(0x42CA017CUL))
#define bFM4_ETHERNET_MAC0_SR_TI               *((volatile unsigned char*)(0x42CA0280UL))
#define bFM4_ETHERNET_MAC0_SR_TPS              *((volatile unsigned char*)(0x42CA0284UL))
#define bFM4_ETHERNET_MAC0_SR_TU               *((volatile unsigned char*)(0x42CA0288UL))
#define bFM4_ETHERNET_MAC0_SR_TJT              *((volatile unsigned char*)(0x42CA028CUL))
#define bFM4_ETHERNET_MAC0_SR_OVF              *((volatile unsigned char*)(0x42CA0290UL))
#define bFM4_ETHERNET_MAC0_SR_UNF              *((volatile unsigned char*)(0x42CA0294UL))
#define bFM4_ETHERNET_MAC0_SR_RI               *((volatile unsigned char*)(0x42CA0298UL))
#define bFM4_ETHERNET_MAC0_SR_RU               *((volatile unsigned char*)(0x42CA029CUL))
#define bFM4_ETHERNET_MAC0_SR_RPS              *((volatile unsigned char*)(0x42CA02A0UL))
#define bFM4_ETHERNET_MAC0_SR_RWT              *((volatile unsigned char*)(0x42CA02A4UL))
#define bFM4_ETHERNET_MAC0_SR_ETI              *((volatile unsigned char*)(0x42CA02A8UL))
#define bFM4_ETHERNET_MAC0_SR_FBI              *((volatile unsigned char*)(0x42CA02B4UL))
#define bFM4_ETHERNET_MAC0_SR_ERI              *((volatile unsigned char*)(0x42CA02B8UL))
#define bFM4_ETHERNET_MAC0_SR_AIS              *((volatile unsigned char*)(0x42CA02BCUL))
#define bFM4_ETHERNET_MAC0_SR_NIS              *((volatile unsigned char*)(0x42CA02C0UL))
#define bFM4_ETHERNET_MAC0_SR_RS0              *((volatile unsigned char*)(0x42CA02C4UL))
#define bFM4_ETHERNET_MAC0_SR_RS1              *((volatile unsigned char*)(0x42CA02C8UL))
#define bFM4_ETHERNET_MAC0_SR_RS2              *((volatile unsigned char*)(0x42CA02CCUL))
#define bFM4_ETHERNET_MAC0_SR_TS0              *((volatile unsigned char*)(0x42CA02D0UL))
#define bFM4_ETHERNET_MAC0_SR_TS1              *((volatile unsigned char*)(0x42CA02D4UL))
#define bFM4_ETHERNET_MAC0_SR_TS2              *((volatile unsigned char*)(0x42CA02D8UL))
#define bFM4_ETHERNET_MAC0_SR_EB0              *((volatile unsigned char*)(0x42CA02DCUL))
#define bFM4_ETHERNET_MAC0_SR_EB1              *((volatile unsigned char*)(0x42CA02E0UL))
#define bFM4_ETHERNET_MAC0_SR_EB2              *((volatile unsigned char*)(0x42CA02E4UL))
#define bFM4_ETHERNET_MAC0_SR_GLI              *((volatile unsigned char*)(0x42CA02E8UL))
#define bFM4_ETHERNET_MAC0_SR_GMI              *((volatile unsigned char*)(0x42CA02ECUL))
#define bFM4_ETHERNET_MAC0_SR_GPI              *((volatile unsigned char*)(0x42CA02F0UL))
#define bFM4_ETHERNET_MAC0_SR_TTI              *((volatile unsigned char*)(0x42CA02F4UL))
#define bFM4_ETHERNET_MAC0_SR_GLPII            *((volatile unsigned char*)(0x42CA02F8UL))
#define bFM4_ETHERNET_MAC0_OMR_SR              *((volatile unsigned char*)(0x42CA0304UL))
#define bFM4_ETHERNET_MAC0_OMR_OSF             *((volatile unsigned char*)(0x42CA0308UL))
#define bFM4_ETHERNET_MAC0_OMR_RTC0            *((volatile unsigned char*)(0x42CA030CUL))
#define bFM4_ETHERNET_MAC0_OMR_RTC1            *((volatile unsigned char*)(0x42CA0310UL))
#define bFM4_ETHERNET_MAC0_OMR_FUF             *((volatile unsigned char*)(0x42CA0318UL))
#define bFM4_ETHERNET_MAC0_OMR_FEF             *((volatile unsigned char*)(0x42CA031CUL))
#define bFM4_ETHERNET_MAC0_OMR_ST              *((volatile unsigned char*)(0x42CA0334UL))
#define bFM4_ETHERNET_MAC0_OMR_TTC0            *((volatile unsigned char*)(0x42CA0338UL))
#define bFM4_ETHERNET_MAC0_OMR_TTC1            *((volatile unsigned char*)(0x42CA033CUL))
#define bFM4_ETHERNET_MAC0_OMR_TTC2            *((volatile unsigned char*)(0x42CA0340UL))
#define bFM4_ETHERNET_MAC0_OMR_FTF             *((volatile unsigned char*)(0x42CA0350UL))
#define bFM4_ETHERNET_MAC0_OMR_TSF             *((volatile unsigned char*)(0x42CA0354UL))
#define bFM4_ETHERNET_MAC0_OMR_DFF             *((volatile unsigned char*)(0x42CA0360UL))
#define bFM4_ETHERNET_MAC0_OMR_RSF             *((volatile unsigned char*)(0x42CA0364UL))
#define bFM4_ETHERNET_MAC0_OMR_DT              *((volatile unsigned char*)(0x42CA0368UL))
#define bFM4_ETHERNET_MAC0_IER_TIE             *((volatile unsigned char*)(0x42CA0380UL))
#define bFM4_ETHERNET_MAC0_IER_TSE             *((volatile unsigned char*)(0x42CA0384UL))
#define bFM4_ETHERNET_MAC0_IER_TUE             *((volatile unsigned char*)(0x42CA0388UL))
#define bFM4_ETHERNET_MAC0_IER_TJE             *((volatile unsigned char*)(0x42CA038CUL))
#define bFM4_ETHERNET_MAC0_IER_OVE             *((volatile unsigned char*)(0x42CA0390UL))
#define bFM4_ETHERNET_MAC0_IER_UNE             *((volatile unsigned char*)(0x42CA0394UL))
#define bFM4_ETHERNET_MAC0_IER_RIE             *((volatile unsigned char*)(0x42CA0398UL))
#define bFM4_ETHERNET_MAC0_IER_RUE             *((volatile unsigned char*)(0x42CA039CUL))
#define bFM4_ETHERNET_MAC0_IER_RSE             *((volatile unsigned char*)(0x42CA03A0UL))
#define bFM4_ETHERNET_MAC0_IER_RWE             *((volatile unsigned char*)(0x42CA03A4UL))
#define bFM4_ETHERNET_MAC0_IER_ETE             *((volatile unsigned char*)(0x42CA03A8UL))
#define bFM4_ETHERNET_MAC0_IER_FBE             *((volatile unsigned char*)(0x42CA03B4UL))
#define bFM4_ETHERNET_MAC0_IER_ERE             *((volatile unsigned char*)(0x42CA03B8UL))
#define bFM4_ETHERNET_MAC0_IER_AIE             *((volatile unsigned char*)(0x42CA03BCUL))
#define bFM4_ETHERNET_MAC0_IER_NIE             *((volatile unsigned char*)(0x42CA03C0UL))
#define bFM4_ETHERNET_MAC0_MFBOCR_NMFH0        *((volatile unsigned char*)(0x42CA0400UL))
#define bFM4_ETHERNET_MAC0_MFBOCR_NMFH1        *((volatile unsigned char*)(0x42CA0404UL))
#define bFM4_ETHERNET_MAC0_MFBOCR_NMFH2        *((volatile unsigned char*)(0x42CA0408UL))
#define bFM4_ETHERNET_MAC0_MFBOCR_NMFH3        *((volatile unsigned char*)(0x42CA040CUL))
#define bFM4_ETHERNET_MAC0_MFBOCR_NMFH4        *((volatile unsigned char*)(0x42CA0410UL))
#define bFM4_ETHERNET_MAC0_MFBOCR_NMFH5        *((volatile unsigned char*)(0x42CA0414UL))
#define bFM4_ETHERNET_MAC0_MFBOCR_NMFH6        *((volatile unsigned char*)(0x42CA0418UL))
#define bFM4_ETHERNET_MAC0_MFBOCR_NMFH7        *((volatile unsigned char*)(0x42CA041CUL))
#define bFM4_ETHERNET_MAC0_MFBOCR_NMFH8        *((volatile unsigned char*)(0x42CA0420UL))
#define bFM4_ETHERNET_MAC0_MFBOCR_NMFH9        *((volatile unsigned char*)(0x42CA0424UL))
#define bFM4_ETHERNET_MAC0_MFBOCR_NMFH10       *((volatile unsigned char*)(0x42CA0428UL))
#define bFM4_ETHERNET_MAC0_MFBOCR_NMFH11       *((volatile unsigned char*)(0x42CA042CUL))
#define bFM4_ETHERNET_MAC0_MFBOCR_NMFH12       *((volatile unsigned char*)(0x42CA0430UL))
#define bFM4_ETHERNET_MAC0_MFBOCR_NMFH13       *((volatile unsigned char*)(0x42CA0434UL))
#define bFM4_ETHERNET_MAC0_MFBOCR_NMFH14       *((volatile unsigned char*)(0x42CA0438UL))
#define bFM4_ETHERNET_MAC0_MFBOCR_NMFH15       *((volatile unsigned char*)(0x42CA043CUL))
#define bFM4_ETHERNET_MAC0_MFBOCR_ONMFH        *((volatile unsigned char*)(0x42CA0440UL))
#define bFM4_ETHERNET_MAC0_MFBOCR_NMFF0        *((volatile unsigned char*)(0x42CA0444UL))
#define bFM4_ETHERNET_MAC0_MFBOCR_NMFF1        *((volatile unsigned char*)(0x42CA0448UL))
#define bFM4_ETHERNET_MAC0_MFBOCR_NMFF2        *((volatile unsigned char*)(0x42CA044CUL))
#define bFM4_ETHERNET_MAC0_MFBOCR_NMFF3        *((volatile unsigned char*)(0x42CA0450UL))
#define bFM4_ETHERNET_MAC0_MFBOCR_NMFF4        *((volatile unsigned char*)(0x42CA0454UL))
#define bFM4_ETHERNET_MAC0_MFBOCR_NMFF5        *((volatile unsigned char*)(0x42CA0458UL))
#define bFM4_ETHERNET_MAC0_MFBOCR_NMFF6        *((volatile unsigned char*)(0x42CA045CUL))
#define bFM4_ETHERNET_MAC0_MFBOCR_NMFF7        *((volatile unsigned char*)(0x42CA0460UL))
#define bFM4_ETHERNET_MAC0_MFBOCR_NMFF8        *((volatile unsigned char*)(0x42CA0464UL))
#define bFM4_ETHERNET_MAC0_MFBOCR_NMFF9        *((volatile unsigned char*)(0x42CA0468UL))
#define bFM4_ETHERNET_MAC0_MFBOCR_NMFF10       *((volatile unsigned char*)(0x42CA046CUL))
#define bFM4_ETHERNET_MAC0_MFBOCR_ONMFF        *((volatile unsigned char*)(0x42CA0470UL))
#define bFM4_ETHERNET_MAC0_RIWTR_RIWT0         *((volatile unsigned char*)(0x42CA0480UL))
#define bFM4_ETHERNET_MAC0_RIWTR_RIWT1         *((volatile unsigned char*)(0x42CA0484UL))
#define bFM4_ETHERNET_MAC0_RIWTR_RIWT2         *((volatile unsigned char*)(0x42CA0488UL))
#define bFM4_ETHERNET_MAC0_RIWTR_RIWT3         *((volatile unsigned char*)(0x42CA048CUL))
#define bFM4_ETHERNET_MAC0_RIWTR_RIWT4         *((volatile unsigned char*)(0x42CA0490UL))
#define bFM4_ETHERNET_MAC0_RIWTR_RIWT5         *((volatile unsigned char*)(0x42CA0494UL))
#define bFM4_ETHERNET_MAC0_RIWTR_RIWT6         *((volatile unsigned char*)(0x42CA0498UL))
#define bFM4_ETHERNET_MAC0_RIWTR_RIWT7         *((volatile unsigned char*)(0x42CA049CUL))
#define bFM4_ETHERNET_MAC0_AHBSR_AHBS          *((volatile unsigned char*)(0x42CA0580UL))
#define bFM4_ETHERNET_MAC0_CHTDR_HTDAP0        *((volatile unsigned char*)(0x42CA0900UL))
#define bFM4_ETHERNET_MAC0_CHTDR_HTDAP1        *((volatile unsigned char*)(0x42CA0904UL))
#define bFM4_ETHERNET_MAC0_CHTDR_HTDAP2        *((volatile unsigned char*)(0x42CA0908UL))
#define bFM4_ETHERNET_MAC0_CHTDR_HTDAP3        *((volatile unsigned char*)(0x42CA090CUL))
#define bFM4_ETHERNET_MAC0_CHTDR_HTDAP4        *((volatile unsigned char*)(0x42CA0910UL))
#define bFM4_ETHERNET_MAC0_CHTDR_HTDAP5        *((volatile unsigned char*)(0x42CA0914UL))
#define bFM4_ETHERNET_MAC0_CHTDR_HTDAP6        *((volatile unsigned char*)(0x42CA0918UL))
#define bFM4_ETHERNET_MAC0_CHTDR_HTDAP7        *((volatile unsigned char*)(0x42CA091CUL))
#define bFM4_ETHERNET_MAC0_CHTDR_HTDAP8        *((volatile unsigned char*)(0x42CA0920UL))
#define bFM4_ETHERNET_MAC0_CHTDR_HTDAP9        *((volatile unsigned char*)(0x42CA0924UL))
#define bFM4_ETHERNET_MAC0_CHTDR_HTDAP10       *((volatile unsigned char*)(0x42CA0928UL))
#define bFM4_ETHERNET_MAC0_CHTDR_HTDAP11       *((volatile unsigned char*)(0x42CA092CUL))
#define bFM4_ETHERNET_MAC0_CHTDR_HTDAP12       *((volatile unsigned char*)(0x42CA0930UL))
#define bFM4_ETHERNET_MAC0_CHTDR_HTDAP13       *((volatile unsigned char*)(0x42CA0934UL))
#define bFM4_ETHERNET_MAC0_CHTDR_HTDAP14       *((volatile unsigned char*)(0x42CA0938UL))
#define bFM4_ETHERNET_MAC0_CHTDR_HTDAP15       *((volatile unsigned char*)(0x42CA093CUL))
#define bFM4_ETHERNET_MAC0_CHTDR_HTDAP16       *((volatile unsigned char*)(0x42CA0940UL))
#define bFM4_ETHERNET_MAC0_CHTDR_HTDAP17       *((volatile unsigned char*)(0x42CA0944UL))
#define bFM4_ETHERNET_MAC0_CHTDR_HTDAP18       *((volatile unsigned char*)(0x42CA0948UL))
#define bFM4_ETHERNET_MAC0_CHTDR_HTDAP19       *((volatile unsigned char*)(0x42CA094CUL))
#define bFM4_ETHERNET_MAC0_CHTDR_HTDAP20       *((volatile unsigned char*)(0x42CA0950UL))
#define bFM4_ETHERNET_MAC0_CHTDR_HTDAP21       *((volatile unsigned char*)(0x42CA0954UL))
#define bFM4_ETHERNET_MAC0_CHTDR_HTDAP22       *((volatile unsigned char*)(0x42CA0958UL))
#define bFM4_ETHERNET_MAC0_CHTDR_HTDAP23       *((volatile unsigned char*)(0x42CA095CUL))
#define bFM4_ETHERNET_MAC0_CHTDR_HTDAP24       *((volatile unsigned char*)(0x42CA0960UL))
#define bFM4_ETHERNET_MAC0_CHTDR_HTDAP25       *((volatile unsigned char*)(0x42CA0964UL))
#define bFM4_ETHERNET_MAC0_CHTDR_HTDAP26       *((volatile unsigned char*)(0x42CA0968UL))
#define bFM4_ETHERNET_MAC0_CHTDR_HTDAP27       *((volatile unsigned char*)(0x42CA096CUL))
#define bFM4_ETHERNET_MAC0_CHTDR_HTDAP28       *((volatile unsigned char*)(0x42CA0970UL))
#define bFM4_ETHERNET_MAC0_CHTDR_HTDAP29       *((volatile unsigned char*)(0x42CA0974UL))
#define bFM4_ETHERNET_MAC0_CHTDR_HTDAP30       *((volatile unsigned char*)(0x42CA0978UL))
#define bFM4_ETHERNET_MAC0_CHTDR_HTDAP31       *((volatile unsigned char*)(0x42CA097CUL))
#define bFM4_ETHERNET_MAC0_CHRDR_HRDAP0        *((volatile unsigned char*)(0x42CA0980UL))
#define bFM4_ETHERNET_MAC0_CHRDR_HRDAP1        *((volatile unsigned char*)(0x42CA0984UL))
#define bFM4_ETHERNET_MAC0_CHRDR_HRDAP2        *((volatile unsigned char*)(0x42CA0988UL))
#define bFM4_ETHERNET_MAC0_CHRDR_HRDAP3        *((volatile unsigned char*)(0x42CA098CUL))
#define bFM4_ETHERNET_MAC0_CHRDR_HRDAP4        *((volatile unsigned char*)(0x42CA0990UL))
#define bFM4_ETHERNET_MAC0_CHRDR_HRDAP5        *((volatile unsigned char*)(0x42CA0994UL))
#define bFM4_ETHERNET_MAC0_CHRDR_HRDAP6        *((volatile unsigned char*)(0x42CA0998UL))
#define bFM4_ETHERNET_MAC0_CHRDR_HRDAP7        *((volatile unsigned char*)(0x42CA099CUL))
#define bFM4_ETHERNET_MAC0_CHRDR_HRDAP8        *((volatile unsigned char*)(0x42CA09A0UL))
#define bFM4_ETHERNET_MAC0_CHRDR_HRDAP9        *((volatile unsigned char*)(0x42CA09A4UL))
#define bFM4_ETHERNET_MAC0_CHRDR_HRDAP10       *((volatile unsigned char*)(0x42CA09A8UL))
