sol4ik/audio-steganography/try/fm4/s6e2cc_i2s_sk-fm4-176l-s6se2cc-v10/common/s6e2cc.h
/* CAN FD registers */
#define bFM4_CANFD_CREL_DAY0                   *((volatile unsigned char*)(0x42E00000UL))
#define bFM4_CANFD_CREL_DAY1                   *((volatile unsigned char*)(0x42E00004UL))
#define bFM4_CANFD_CREL_DAY2                   *((volatile unsigned char*)(0x42E00008UL))
#define bFM4_CANFD_CREL_DAY3                   *((volatile unsigned char*)(0x42E0000CUL))
#define bFM4_CANFD_CREL_DAY4                   *((volatile unsigned char*)(0x42E00010UL))
#define bFM4_CANFD_CREL_DAY5                   *((volatile unsigned char*)(0x42E00014UL))
#define bFM4_CANFD_CREL_DAY6                   *((volatile unsigned char*)(0x42E00018UL))
#define bFM4_CANFD_CREL_DAY7                   *((volatile unsigned char*)(0x42E0001CUL))
#define bFM4_CANFD_CREL_MON0                   *((volatile unsigned char*)(0x42E00020UL))
#define bFM4_CANFD_CREL_MON1                   *((volatile unsigned char*)(0x42E00024UL))
#define bFM4_CANFD_CREL_MON2                   *((volatile unsigned char*)(0x42E00028UL))
#define bFM4_CANFD_CREL_MON3                   *((volatile unsigned char*)(0x42E0002CUL))
#define bFM4_CANFD_CREL_MON4                   *((volatile unsigned char*)(0x42E00030UL))
#define bFM4_CANFD_CREL_MON5                   *((volatile unsigned char*)(0x42E00034UL))
#define bFM4_CANFD_CREL_MON6                   *((volatile unsigned char*)(0x42E00038UL))
#define bFM4_CANFD_CREL_MON7                   *((volatile unsigned char*)(0x42E0003CUL))
#define bFM4_CANFD_CREL_YEAR0                  *((volatile unsigned char*)(0x42E00040UL))
#define bFM4_CANFD_CREL_YEAR1                  *((volatile unsigned char*)(0x42E00044UL))
#define bFM4_CANFD_CREL_YEAR2                  *((volatile unsigned char*)(0x42E00048UL))
#define bFM4_CANFD_CREL_YEAR3                  *((volatile unsigned char*)(0x42E0004CUL))
#define bFM4_CANFD_CREL_SUBSTEP0               *((volatile unsigned char*)(0x42E00050UL))
#define bFM4_CANFD_CREL_SUBSTEP1               *((volatile unsigned char*)(0x42E00054UL))
#define bFM4_CANFD_CREL_SUBSTEP2               *((volatile unsigned char*)(0x42E00058UL))
#define bFM4_CANFD_CREL_SUBSTEP3               *((volatile unsigned char*)(0x42E0005CUL))
#define bFM4_CANFD_CREL_STEP0                  *((volatile unsigned char*)(0x42E00060UL))
#define bFM4_CANFD_CREL_STEP1                  *((volatile unsigned char*)(0x42E00064UL))
#define bFM4_CANFD_CREL_STEP2                  *((volatile unsigned char*)(0x42E00068UL))
#define bFM4_CANFD_CREL_STEP3                  *((volatile unsigned char*)(0x42E0006CUL))
#define bFM4_CANFD_CREL_REL0                   *((volatile unsigned char*)(0x42E00070UL))
#define bFM4_CANFD_CREL_REL1                   *((volatile unsigned char*)(0x42E00074UL))
#define bFM4_CANFD_CREL_REL2                   *((volatile unsigned char*)(0x42E00078UL))
#define bFM4_CANFD_CREL_REL3                   *((volatile unsigned char*)(0x42E0007CUL))
#define bFM4_CANFD_ENDN_ETV0                   *((volatile unsigned char*)(0x42E00080UL))
#define bFM4_CANFD_ENDN_ETV1                   *((volatile unsigned char*)(0x42E00084UL))
#define bFM4_CANFD_ENDN_ETV2                   *((volatile unsigned char*)(0x42E00088UL))
#define bFM4_CANFD_ENDN_ETV3                   *((volatile unsigned char*)(0x42E0008CUL))
#define bFM4_CANFD_ENDN_ETV4                   *((volatile unsigned char*)(0x42E00090UL))
#define bFM4_CANFD_ENDN_ETV5                   *((volatile unsigned char*)(0x42E00094UL))
#define bFM4_CANFD_ENDN_ETV6                   *((volatile unsigned char*)(0x42E00098UL))
#define bFM4_CANFD_ENDN_ETV7                   *((volatile unsigned char*)(0x42E0009CUL))
#define bFM4_CANFD_ENDN_ETV8                   *((volatile unsigned char*)(0x42E000A0UL))
#define bFM4_CANFD_ENDN_ETV9                   *((volatile unsigned char*)(0x42E000A4UL))
#define bFM4_CANFD_ENDN_ETV10                  *((volatile unsigned char*)(0x42E000A8UL))
#define bFM4_CANFD_ENDN_ETV11                  *((volatile unsigned char*)(0x42E000ACUL))
#define bFM4_CANFD_ENDN_ETV12                  *((volatile unsigned char*)(0x42E000B0UL))
#define bFM4_CANFD_ENDN_ETV13                  *((volatile unsigned char*)(0x42E000B4UL))
#define bFM4_CANFD_ENDN_ETV14                  *((volatile unsigned char*)(0x42E000B8UL))
#define bFM4_CANFD_ENDN_ETV15                  *((volatile unsigned char*)(0x42E000BCUL))
#define bFM4_CANFD_ENDN_ETV16                  *((volatile unsigned char*)(0x42E000C0UL))
#define bFM4_CANFD_ENDN_ETV17                  *((volatile unsigned char*)(0x42E000C4UL))
#define bFM4_CANFD_ENDN_ETV18                  *((volatile unsigned char*)(0x42E000C8UL))
#define bFM4_CANFD_ENDN_ETV19                  *((volatile unsigned char*)(0x42E000CCUL))
#define bFM4_CANFD_ENDN_ETV20                  *((volatile unsigned char*)(0x42E000D0UL))
#define bFM4_CANFD_ENDN_ETV21                  *((volatile unsigned char*)(0x42E000D4UL))
#define bFM4_CANFD_ENDN_ETV22                  *((volatile unsigned char*)(0x42E000D8UL))
#define bFM4_CANFD_ENDN_ETV23                  *((volatile unsigned char*)(0x42E000DCUL))
#define bFM4_CANFD_ENDN_ETV24                  *((volatile unsigned char*)(0x42E000E0UL))
#define bFM4_CANFD_ENDN_ETV25                  *((volatile unsigned char*)(0x42E000E4UL))
#define bFM4_CANFD_ENDN_ETV26                  *((volatile unsigned char*)(0x42E000E8UL))
#define bFM4_CANFD_ENDN_ETV27                  *((volatile unsigned char*)(0x42E000ECUL))
#define bFM4_CANFD_ENDN_ETV28                  *((volatile unsigned char*)(0x42E000F0UL))
#define bFM4_CANFD_ENDN_ETV29                  *((volatile unsigned char*)(0x42E000F4UL))
#define bFM4_CANFD_ENDN_ETV30                  *((volatile unsigned char*)(0x42E000F8UL))
#define bFM4_CANFD_ENDN_ETV31                  *((volatile unsigned char*)(0x42E000FCUL))
#define bFM4_CANFD_FBTP_FSJW0                  *((volatile unsigned char*)(0x42E00180UL))
#define bFM4_CANFD_FBTP_FSJW1                  *((volatile unsigned char*)(0x42E00184UL))
#define bFM4_CANFD_FBTP_FTSEG20                *((volatile unsigned char*)(0x42E00190UL))
#define bFM4_CANFD_FBTP_FTSEG21                *((volatile unsigned char*)(0x42E00194UL))
#define bFM4_CANFD_FBTP_FTSEG22                *((volatile unsigned char*)(0x42E00198UL))
#define bFM4_CANFD_FBTP_FTSEG10                *((volatile unsigned char*)(0x42E001A0UL))
#define bFM4_CANFD_FBTP_FTSEG11                *((volatile unsigned char*)(0x42E001A4UL))
#define bFM4_CANFD_FBTP_FTSEG12                *((volatile unsigned char*)(0x42E001A8UL))
#define bFM4_CANFD_FBTP_FTSEG13                *((volatile unsigned char*)(0x42E001ACUL))
#define bFM4_CANFD_FBTP_FBRP0                  *((volatile unsigned char*)(0x42E001C0UL))
#define bFM4_CANFD_FBTP_FBRP1                  *((volatile unsigned char*)(0x42E001C4UL))
#define bFM4_CANFD_FBTP_FBRP2                  *((volatile unsigned char*)(0x42E001C8UL))
#define bFM4_CANFD_FBTP_FBRP3                  *((volatile unsigned char*)(0x42E001CCUL))
#define bFM4_CANFD_FBTP_FBRP4                  *((volatile unsigned char*)(0x42E001D0UL))
#define bFM4_CANFD_FBTP_TDC                    *((volatile unsigned char*)(0x42E001DCUL))
#define bFM4_CANFD_FBTP_TDCO0                  *((volatile unsigned char*)(0x42E001E0UL))
#define bFM4_CANFD_FBTP_TDCO1                  *((volatile unsigned char*)(0x42E001E4UL))
#define bFM4_CANFD_FBTP_TDCO2                  *((volatile unsigned char*)(0x42E001E8UL))
#define bFM4_CANFD_FBTP_TDCO3                  *((volatile unsigned char*)(0x42E001ECUL))
#define bFM4_CANFD_FBTP_TDCO4                  *((volatile unsigned char*)(0x42E001F0UL))
#define bFM4_CANFD_TEST_LBCK                   *((volatile unsigned char*)(0x42E00210UL))
#define bFM4_CANFD_TEST_TX0                    *((volatile unsigned char*)(0x42E00214UL))
#define bFM4_CANFD_TEST_TX1                    *((volatile unsigned char*)(0x42E00218UL))
#define bFM4_CANFD_TEST_RX                     *((volatile unsigned char*)(0x42E0021CUL))
#define bFM4_CANFD_TEST_TDCV0                  *((volatile unsigned char*)(0x42E00220UL))
#define bFM4_CANFD_TEST_TDCV1                  *((volatile unsigned char*)(0x42E00224UL))
#define bFM4_CANFD_TEST_TDCV2                  *((volatile unsigned char*)(0x42E00228UL))
#define bFM4_CANFD_TEST_TDCV3                  *((volatile unsigned char*)(0x42E0022CUL))
#define bFM4_CANFD_TEST_TDCV4                  *((volatile unsigned char*)(0x42E00230UL))
#define bFM4_CANFD_TEST_TDCV5                  *((volatile unsigned char*)(0x42E00234UL))
#define bFM4_CANFD_RWD_WDC0                    *((volatile unsigned char*)(0x42E00280UL))
#define bFM4_CANFD_RWD_WDC1                    *((volatile unsigned char*)(0x42E00284UL))
#define bFM4_CANFD_RWD_WDC2                    *((volatile unsigned char*)(0x42E00288UL))
#define bFM4_CANFD_RWD_WDC3                    *((volatile unsigned char*)(0x42E0028CUL))
#define bFM4_CANFD_RWD_WDC4                    *((volatile unsigned char*)(0x42E00290UL))
#define bFM4_CANFD_RWD_WDC5                    *((volatile unsigned char*)(0x42E00294UL))
#define bFM4_CANFD_RWD_WDC6                    *((volatile unsigned char*)(0x42E00298UL))
#define bFM4_CANFD_RWD_WDC7                    *((volatile unsigned char*)(0x42E0029CUL))
#define bFM4_CANFD_RWD_WDV0                    *((volatile unsigned char*)(0x42E002A0UL))
#define bFM4_CANFD_RWD_WDV1                    *((volatile unsigned char*)(0x42E002A4UL))
#define bFM4_CANFD_RWD_WDV2                    *((volatile unsigned char*)(0x42E002A8UL))
#define bFM4_CANFD_RWD_WDV3                    *((volatile unsigned char*)(0x42E002ACUL))
#define bFM4_CANFD_RWD_WDV4                    *((volatile unsigned char*)(0x42E002B0UL))
#define bFM4_CANFD_RWD_WDV5                    *((volatile unsigned char*)(0x42E002B4UL))
#define bFM4_CANFD_RWD_WDV6                    *((volatile unsigned char*)(0x42E002B8UL))
#define bFM4_CANFD_RWD_WDV7                    *((volatile unsigned char*)(0x42E002BCUL))
#define bFM4_CANFD_CCCR_INIT                   *((volatile unsigned char*)(0x42E00300UL))
#define bFM4_CANFD_CCCR_CCE                    *((volatile unsigned char*)(0x42E00304UL))
#define bFM4_CANFD_CCCR_ASM                    *((volatile unsigned char*)(0x42E00308UL))
#define bFM4_CANFD_CCCR_CSA                    *((volatile unsigned char*)(0x42E0030CUL))
#define bFM4_CANFD_CCCR_CSR                    *((volatile unsigned char*)(0x42E00310UL))
#define bFM4_CANFD_CCCR_MON                    *((volatile unsigned char*)(0x42E00314UL))
#define bFM4_CANFD_CCCR_DAR                    *((volatile unsigned char*)(0x42E00318UL))
#define bFM4_CANFD_CCCR_TEST                   *((volatile unsigned char*)(0x42E0031CUL))
#define bFM4_CANFD_CCCR_CME0                   *((volatile unsigned char*)(0x42E00320UL))
#define bFM4_CANFD_CCCR_CME1                   *((volatile unsigned char*)(0x42E00324UL))
#define bFM4_CANFD_CCCR_CMR0                   *((volatile unsigned char*)(0x42E00328UL))
#define bFM4_CANFD_CCCR_CMR1                   *((volatile unsigned char*)(0x42E0032CUL))
#define bFM4_CANFD_CCCR_FDO                    *((volatile unsigned char*)(0x42E00330UL))
#define bFM4_CANFD_CCCR_FDBS                   *((volatile unsigned char*)(0x42E00334UL))
#define bFM4_CANFD_CCCR_TXP                    *((volatile unsigned char*)(0x42E00338UL))
#define bFM4_CANFD_BTP_SJW0                    *((volatile unsigned char*)(0x42E00380UL))
#define bFM4_CANFD_BTP_SJW1                    *((volatile unsigned char*)(0x42E00384UL))
#define bFM4_CANFD_BTP_SJW2                    *((volatile unsigned char*)(0x42E00388UL))
#define bFM4_CANFD_BTP_SJW3                    *((volatile unsigned char*)(0x42E0038CUL))
#define bFM4_CANFD_BTP_TSEG20                  *((volatile unsigned char*)(0x42E00390UL))
#define bFM4_CANFD_BTP_TSEG21                  *((volatile unsigned char*)(0x42E00394UL))
#define bFM4_CANFD_BTP_TSEG22                  *((volatile unsigned char*)(0x42E00398UL))
#define bFM4_CANFD_BTP_TSEG23                  *((volatile unsigned char*)(0x42E0039CUL))
#define bFM4_CANFD_BTP_TSEG10                  *((volatile unsigned char*)(0x42E003A0UL))
#define bFM4_CANFD_BTP_TSEG11                  *((volatile unsigned char*)(0x42E003A4UL))
#define bFM4_CANFD_BTP_TSEG12                  *((volatile unsigned char*)(0x42E003A8UL))
#define bFM4_CANFD_BTP_TSEG13                  *((volatile unsigned char*)(0x42E003ACUL))
#define bFM4_CANFD_BTP_TSEG14                  *((volatile unsigned char*)(0x42E003B0UL))
#define bFM4_CANFD_BTP_TSEG15                  *((volatile unsigned char*)(0x42E003B4UL))
#define bFM4_CANFD_BTP_BRP0                    *((volatile unsigned char*)(0x42E003C0UL))
#define bFM4_CANFD_BTP_BRP1                    *((volatile unsigned char*)(0x42E003C4UL))
#define bFM4_CANFD_BTP_BRP2                    *((volatile unsigned char*)(0x42E003C8UL))
#define bFM4_CANFD_BTP_BRP3                    *((volatile unsigned char*)(0x42E003CCUL))
#define bFM4_CANFD_BTP_BRP4                    *((volatile unsigned char*)(0x42E003D0UL))
#define bFM4_CANFD_BTP_BRP5                    *((volatile unsigned char*)(0x42E003D4UL))
#define bFM4_CANFD_BTP_BRP6                    *((volatile unsigned char*)(0x42E003D8UL))
#define bFM4_CANFD_BTP_BRP7                    *((volatile unsigned char*)(0x42E003DCUL))
#define bFM4_CANFD_BTP_BRP8                    *((volatile unsigned char*)(0x42E003E0UL))
#define bFM4_CANFD_BTP_BRP9                    *((volatile unsigned char*)(0x42E003E4UL))
#define bFM4_CANFD_TSCC_TSS0                   *((volatile unsigned char*)(0x42E00400UL))
#define bFM4_CANFD_TSCC_TSS1                   *((volatile unsigned char*)(0x42E00404UL))
#define bFM4_CANFD_TSCC_TCP0                   *((volatile unsigned char*)(0x42E00440UL))
#define bFM4_CANFD_TSCC_TCP1                   *((volatile unsigned char*)(0x42E00444UL))
#define bFM4_CANFD_TSCC_TCP2                   *((volatile unsigned char*)(0x42E00448UL))
#define bFM4_CANFD_TSCC_TCP3                   *((volatile unsigned char*)(0x42E0044CUL))
#define bFM4_CANFD_TSCV_TSC0                   *((volatile unsigned char*)(0x42E00480UL))
#define bFM4_CANFD_TSCV_TSC1                   *((volatile unsigned char*)(0x42E00484UL))
#define bFM4_CANFD_TSCV_TSC2                   *((volatile unsigned char*)(0x42E00488UL))
#define bFM4_CANFD_TSCV_TSC3                   *((volatile unsigned char*)(0x42E0048CUL))
#define bFM4_CANFD_TSCV_TSC4                   *((volatile unsigned char*)(0x42E00490UL))
#define bFM4_CANFD_TSCV_TSC5                   *((volatile unsigned char*)(0x42E00494UL))
#define bFM4_CANFD_TSCV_TSC6                   *((volatile unsigned char*)(0x42E00498UL))
#define bFM4_CANFD_TSCV_TSC7                   *((volatile unsigned char*)(0x42E0049CUL))
#define bFM4_CANFD_TSCV_TSC8                   *((volatile unsigned char*)(0x42E004A0UL))
#define bFM4_CANFD_TSCV_TSC9                   *((volatile unsigned char*)(0x42E004A4UL))
#define bFM4_CANFD_TSCV_TSC10                  *((volatile unsigned char*)(0x42E004A8UL))
#define bFM4_CANFD_TSCV_TSC11                  *((volatile unsigned char*)(0x42E004ACUL))
#define bFM4_CANFD_TSCV_TSC12                  *((volatile unsigned char*)(0x42E004B0UL))
#define bFM4_CANFD_TSCV_TSC13                  *((volatile unsigned char*)(0x42E004B4UL))
#define bFM4_CANFD_TSCV_TSC14                  *((volatile unsigned char*)(0x42E004B8UL))
#define bFM4_CANFD_TSCV_TSC15                  *((volatile unsigned char*)(0x42E004BCUL))
#define bFM4_CANFD_TOCC_ETOC                   *((volatile unsigned char*)(0x42E00500UL))
#define bFM4_CANFD_TOCC_TOS0                   *((volatile unsigned char*)(0x42E00504UL))
#define bFM4_CANFD_TOCC_TOS1                   *((volatile unsigned char*)(0x42E00508UL))
#define bFM4_CANFD_TOCC_TOP0                   *((volatile unsigned char*)(0x42E00540UL))
#define bFM4_CANFD_TOCC_TOP1                   *((volatile unsigned char*)(0x42E00544UL))
#define bFM4_CANFD_TOCC_TOP2                   *((volatile unsigned char*)(0x42E00548UL))
#define bFM4_CANFD_TOCC_TOP3                   *((volatile unsigned char*)(0x42E0054CUL))
#define bFM4_CANFD_TOCC_TOP4                   *((volatile unsigned char*)(0x42E00550UL))
#define bFM4_CANFD_TOCC_TOP5                   *((volatile unsigned char*)(0x42E00554UL))
#define bFM4_CANFD_TOCC_TOP6                   *((volatile unsigned char*)(0x42E00558UL))
#define bFM4_CANFD_TOCC_TOP7                   *((volatile unsigned char*)(0x42E0055CUL))
#define bFM4_CANFD_TOCC_TOP8                   *((volatile unsigned char*)(0x42E00560UL))
#define bFM4_CANFD_TOCC_TOP9                   *((volatile unsigned char*)(0x42E00564UL))
#define bFM4_CANFD_TOCC_TOP10                  *((volatile unsigned char*)(0x42E00568UL))
#define bFM4_CANFD_TOCC_TOP11                  *((volatile unsigned char*)(0x42E0056CUL))
#define bFM4_CANFD_TOCC_TOP12                  *((volatile unsigned char*)(0x42E00570UL))
#define bFM4_CANFD_TOCC_TOP13                  *((volatile unsigned char*)(0x42E00574UL))
#define bFM4_CANFD_TOCC_TOP14                  *((volatile unsigned char*)(0x42E00578UL))
#define bFM4_CANFD_TOCC_TOP15                  *((volatile unsigned char*)(0x42E0057CUL))
#define bFM4_CANFD_TOCV_TOC0                   *((volatile unsigned char*)(0x42E00580UL))
#define bFM4_CANFD_TOCV_TOC1                   *((volatile unsigned char*)(0x42E00584UL))
#define bFM4_CANFD_TOCV_TOC2                   *((volatile unsigned char*)(0x42E00588UL))
#define bFM4_CANFD_TOCV_TOC3                   *((volatile unsigned char*)(0x42E0058CUL))
#define bFM4_CANFD_TOCV_TOC4                   *((volatile unsigned char*)(0x42E00590UL))
#define bFM4_CANFD_TOCV_TOC5                   *((volatile unsigned char*)(0x42E00594UL))
#define bFM4_CANFD_TOCV_TOC6                   *((volatile unsigned char*)(0x42E00598UL))
#define bFM4_CANFD_TOCV_TOC7                   *((volatile unsigned char*)(0x42E0059CUL))
#define bFM4_CANFD_TOCV_TOC8                   *((volatile unsigned char*)(0x42E005A0UL))
#define bFM4_CANFD_TOCV_TOC9                   *((volatile unsigned char*)(0x42E005A4UL))
#define bFM4_CANFD_TOCV_TOC10                  *((volatile unsigned char*)(0x42E005A8UL))
#define bFM4_CANFD_TOCV_TOC11                  *((volatile unsigned char*)(0x42E005ACUL))
#define bFM4_CANFD_TOCV_TOC12                  *((volatile unsigned char*)(0x42E005B0UL))
#define bFM4_CANFD_TOCV_TOC13                  *((volatile unsigned char*)(0x42E005B4UL))
#define bFM4_CANFD_TOCV_TOC14                  *((volatile unsigned char*)(0x42E005B8UL))
#define bFM4_CANFD_TOCV_TOC15                  *((volatile unsigned char*)(0x42E005BCUL))
#define bFM4_CANFD_ECR_TEC0                    *((volatile unsigned char*)(0x42E00800UL))
#define bFM4_CANFD_ECR_TEC1                    *((volatile unsigned char*)(0x42E00804UL))
#define bFM4_CANFD_ECR_TEC2                    *((volatile unsigned char*)(0x42E00808UL))
#define bFM4_CANFD_ECR_TEC3                    *((volatile unsigned char*)(0x42E0080CUL))
#define bFM4_CANFD_ECR_TEC4                    *((volatile unsigned char*)(0x42E00810UL))
#define bFM4_CANFD_ECR_TEC5                    *((volatile unsigned char*)(0x42E00814UL))
#define bFM4_CANFD_ECR_TEC6                    *((volatile unsigned char*)(0x42E00818UL))
#define bFM4_CANFD_ECR_TEC7                    *((volatile unsigned char*)(0x42E0081CUL))
#define bFM4_CANFD_ECR_REC0                    *((volatile unsigned char*)(0x42E00820UL))
#define bFM4_CANFD_ECR_REC1                    *((volatile unsigned char*)(0x42E00824UL))
#define bFM4_CANFD_ECR_REC2                    *((volatile unsigned char*)(0x42E00828UL))
#define bFM4_CANFD_ECR_REC3                    *((volatile unsigned char*)(0x42E0082CUL))
#define bFM4_CANFD_ECR_REC4                    *((volatile unsigned char*)(0x42E00830UL))
#define bFM4_CANFD_ECR_REC5                    *((volatile unsigned char*)(0x42E00834UL))
#define bFM4_CANFD_ECR_REC6                    *((volatile unsigned char*)(0x42E00838UL))
#define bFM4_CANFD_ECR_RP                      *((volatile unsigned char*)(0x42E0083CUL))
#define bFM4_CANFD_ECR_CEL0                    *((volatile unsigned char*)(0x42E00840UL))
#define bFM4_CANFD_ECR_CEL1                    *((volatile unsigned char*)(0x42E00844UL))
#define bFM4_CANFD_ECR_CEL2                    *((volatile unsigned char*)(0x42E00848UL))
#define bFM4_CANFD_ECR_CEL3                    *((volatile unsigned char*)(0x42E0084CUL))
#define bFM4_CANFD_ECR_CEL4                    *((volatile unsigned char*)(0x42E00850UL))
#define bFM4_CANFD_ECR_CEL5                    *((volatile unsigned char*)(0x42E00854UL))
#define bFM4_CANFD_ECR_CEL6                    *((volatile unsigned char*)(0x42E00858UL))
#define bFM4_CANFD_ECR_CEL7                    *((volatile unsigned char*)(0x42E0085CUL))
#define bFM4_CANFD_PSR_LEC0                    *((volatile unsigned char*)(0x42E00880UL))
#define bFM4_CANFD_PSR_LEC1                    *((volatile unsigned char*)(0x42E00884UL))
#define bFM4_CANFD_PSR_LEC2                    *((volatile unsigned char*)(0x42E00888UL))
#define bFM4_CANFD_PSR_ACT0                    *((volatile unsigned char*)(0x42E0088CUL))
#define bFM4_CANFD_PSR_ACT1                    *((volatile unsigned char*)(0x42E00890UL))
#define bFM4_CANFD_PSR_EP                      *((volatile unsigned char*)(0x42E00894UL))
#define bFM4_CANFD_PSR_EW                      *((volatile unsigned char*)(0x42E00898UL))
#define bFM4_CANFD_PSR_BO                      *((volatile unsigned char*)(0x42E0089CUL))
#define bFM4_CANFD_PSR_FLEC0                   *((volatile unsigned char*)(0x42E008A0UL))
#define bFM4_CANFD_PSR_FLEC1                   *((volatile unsigned char*)(0x42E008A4UL))
#define bFM4_CANFD_PSR_FLEC2                   *((volatile unsigned char*)(0x42E008A8UL))
#define bFM4_CANFD_PSR_RESI                    *((volatile unsigned char*)(0x42E008ACUL))
#define bFM4_CANFD_PSR_RBRS                    *((volatile unsigned char*)(0x42E008B0UL))
#define bFM4_CANFD_PSR_REDL                    *((volatile unsigned char*)(0x42E008B4UL))
#define bFM4_CANFD_IR_RF0N                     *((volatile unsigned char*)(0x42E00A00UL))
#define bFM4_CANFD_IR_RF0W                     *((volatile unsigned char*)(0x42E00A04UL))
#define bFM4_CANFD_IR_RF0F                     *((volatile unsigned char*)(0x42E00A08UL))
#define bFM4_CANFD_IR_RF0L                     *((volatile unsigned char*)(0x42E00A0CUL))
#define bFM4_CANFD_IR_RF1N                     *((volatile unsigned char*)(0x42E00A10UL))
#define bFM4_CANFD_IR_RF1W                     *((volatile unsigned char*)(0x42E00A14UL))
#define bFM4_CANFD_IR_RF1F                     *((volatile unsigned char*)(0x42E00A18UL))
#define bFM4_CANFD_IR_RF1L                     *((volatile unsigned char*)(0x42E00A1CUL))
#define bFM4_CANFD_IR_HPM                      *((volatile unsigned char*)(0x42E00A20UL))
#define bFM4_CANFD_IR_TC                       *((volatile unsigned char*)(0x42E00A24UL))
#define bFM4_CANFD_IR_TCF                      *((volatile unsigned char*)(0x42E00A28UL))
#define bFM4_CANFD_IR_TFE                      *((volatile unsigned char*)(0x42E00A2CUL))
#define bFM4_CANFD_IR_TEFN                     *((volatile unsigned char*)(0x42E00A30UL))
#define bFM4_CANFD_IR_TEFW                     *((volatile unsigned char*)(0x42E00A34UL))
#define bFM4_CANFD_IR_TEFF                     *((volatile unsigned char*)(0x42E00A38UL))
#define bFM4_CANFD_IR_TEFL                     *((volatile unsigned char*)(0x42E00A3CUL))
#define bFM4_CANFD_IR_TSW                      *((volatile unsigned char*)(0x42E00A40UL))
#define bFM4_CANFD_IR_MRAF                     *((volatile unsigned char*)(0x42E00A44UL))
#define bFM4_CANFD_IR_TOO                      *((volatile unsigned char*)(0x42E00A48UL))
