sol4ik/audio-steganography/try/fm4/s6e2cc_i2s_sk-fm4-176l-s6se2cc-v10/common/s6e2cc.h
#define bFM4_CANFD_IR_DRX                      *((volatile unsigned char*)(0x42E00A4CUL))
#define bFM4_CANFD_IR_BEC                      *((volatile unsigned char*)(0x42E00A50UL))
#define bFM4_CANFD_IR_BEU                      *((volatile unsigned char*)(0x42E00A54UL))
#define bFM4_CANFD_IR_ELO                      *((volatile unsigned char*)(0x42E00A58UL))
#define bFM4_CANFD_IR_EP                       *((volatile unsigned char*)(0x42E00A5CUL))
#define bFM4_CANFD_IR_EW                       *((volatile unsigned char*)(0x42E00A60UL))
#define bFM4_CANFD_IR_BO                       *((volatile unsigned char*)(0x42E00A64UL))
#define bFM4_CANFD_IR_WDI                      *((volatile unsigned char*)(0x42E00A68UL))
#define bFM4_CANFD_IR_CRCE                     *((volatile unsigned char*)(0x42E00A6CUL))
#define bFM4_CANFD_IR_BE                       *((volatile unsigned char*)(0x42E00A70UL))
#define bFM4_CANFD_IR_ACKE                     *((volatile unsigned char*)(0x42E00A74UL))
#define bFM4_CANFD_IR_FOE                      *((volatile unsigned char*)(0x42E00A78UL))
#define bFM4_CANFD_IR_STE                      *((volatile unsigned char*)(0x42E00A7CUL))
#define bFM4_CANFD_IE_RF0NE                    *((volatile unsigned char*)(0x42E00A80UL))
#define bFM4_CANFD_IE_RF0WE                    *((volatile unsigned char*)(0x42E00A84UL))
#define bFM4_CANFD_IE_RF0FE                    *((volatile unsigned char*)(0x42E00A88UL))
#define bFM4_CANFD_IE_RF0LE                    *((volatile unsigned char*)(0x42E00A8CUL))
#define bFM4_CANFD_IE_RF1NE                    *((volatile unsigned char*)(0x42E00A90UL))
#define bFM4_CANFD_IE_RF1WE                    *((volatile unsigned char*)(0x42E00A94UL))
#define bFM4_CANFD_IE_RF1FE                    *((volatile unsigned char*)(0x42E00A98UL))
#define bFM4_CANFD_IE_RF1LE                    *((volatile unsigned char*)(0x42E00A9CUL))
#define bFM4_CANFD_IE_HPME                     *((volatile unsigned char*)(0x42E00AA0UL))
#define bFM4_CANFD_IE_TCE                      *((volatile unsigned char*)(0x42E00AA4UL))
#define bFM4_CANFD_IE_TCFE                     *((volatile unsigned char*)(0x42E00AA8UL))
#define bFM4_CANFD_IE_TFEE                     *((volatile unsigned char*)(0x42E00AACUL))
#define bFM4_CANFD_IE_TEFNE                    *((volatile unsigned char*)(0x42E00AB0UL))
#define bFM4_CANFD_IE_TEFWE                    *((volatile unsigned char*)(0x42E00AB4UL))
#define bFM4_CANFD_IE_TEFFE                    *((volatile unsigned char*)(0x42E00AB8UL))
#define bFM4_CANFD_IE_TEFLE                    *((volatile unsigned char*)(0x42E00ABCUL))
#define bFM4_CANFD_IE_TSWE                     *((volatile unsigned char*)(0x42E00AC0UL))
#define bFM4_CANFD_IE_MRAFE                    *((volatile unsigned char*)(0x42E00AC4UL))
#define bFM4_CANFD_IE_TOOE                     *((volatile unsigned char*)(0x42E00AC8UL))
#define bFM4_CANFD_IE_DRXE                     *((volatile unsigned char*)(0x42E00ACCUL))
#define bFM4_CANFD_IE_BECE                     *((volatile unsigned char*)(0x42E00AD0UL))
#define bFM4_CANFD_IE_BEUE                     *((volatile unsigned char*)(0x42E00AD4UL))
#define bFM4_CANFD_IE_ELOE                     *((volatile unsigned char*)(0x42E00AD8UL))
#define bFM4_CANFD_IE_EPE                      *((volatile unsigned char*)(0x42E00ADCUL))
#define bFM4_CANFD_IE_EWE                      *((volatile unsigned char*)(0x42E00AE0UL))
#define bFM4_CANFD_IE_BOE                      *((volatile unsigned char*)(0x42E00AE4UL))
#define bFM4_CANFD_IE_WDIE                     *((volatile unsigned char*)(0x42E00AE8UL))
#define bFM4_CANFD_IE_CRCEE                    *((volatile unsigned char*)(0x42E00AECUL))
#define bFM4_CANFD_IE_BEE                      *((volatile unsigned char*)(0x42E00AF0UL))
#define bFM4_CANFD_IE_ACKEE                    *((volatile unsigned char*)(0x42E00AF4UL))
#define bFM4_CANFD_IE_FOEE                     *((volatile unsigned char*)(0x42E00AF8UL))
#define bFM4_CANFD_IE_STEE                     *((volatile unsigned char*)(0x42E00AFCUL))
#define bFM4_CANFD_ILS_RF0NL                   *((volatile unsigned char*)(0x42E00B00UL))
#define bFM4_CANFD_ILS_RF0WL                   *((volatile unsigned char*)(0x42E00B04UL))
#define bFM4_CANFD_ILS_RF0FL                   *((volatile unsigned char*)(0x42E00B08UL))
#define bFM4_CANFD_ILS_RF0LL                   *((volatile unsigned char*)(0x42E00B0CUL))
#define bFM4_CANFD_ILS_RF1NL                   *((volatile unsigned char*)(0x42E00B10UL))
#define bFM4_CANFD_ILS_RF1WL                   *((volatile unsigned char*)(0x42E00B14UL))
#define bFM4_CANFD_ILS_RF1FL                   *((volatile unsigned char*)(0x42E00B18UL))
#define bFM4_CANFD_ILS_RF1LL                   *((volatile unsigned char*)(0x42E00B1CUL))
#define bFM4_CANFD_ILS_HPML                    *((volatile unsigned char*)(0x42E00B20UL))
#define bFM4_CANFD_ILS_TCL                     *((volatile unsigned char*)(0x42E00B24UL))
#define bFM4_CANFD_ILS_TCFL                    *((volatile unsigned char*)(0x42E00B28UL))
#define bFM4_CANFD_ILS_TFEL                    *((volatile unsigned char*)(0x42E00B2CUL))
#define bFM4_CANFD_ILS_TEFNL                   *((volatile unsigned char*)(0x42E00B30UL))
#define bFM4_CANFD_ILS_TEFWL                   *((volatile unsigned char*)(0x42E00B34UL))
#define bFM4_CANFD_ILS_TEFFL                   *((volatile unsigned char*)(0x42E00B38UL))
#define bFM4_CANFD_ILS_TEFLL                   *((volatile unsigned char*)(0x42E00B3CUL))
#define bFM4_CANFD_ILS_TSWL                    *((volatile unsigned char*)(0x42E00B40UL))
#define bFM4_CANFD_ILS_MRAFL                   *((volatile unsigned char*)(0x42E00B44UL))
#define bFM4_CANFD_ILS_TOOL                    *((volatile unsigned char*)(0x42E00B48UL))
#define bFM4_CANFD_ILS_DRXL                    *((volatile unsigned char*)(0x42E00B4CUL))
#define bFM4_CANFD_ILS_BECL                    *((volatile unsigned char*)(0x42E00B50UL))
#define bFM4_CANFD_ILS_BEUL                    *((volatile unsigned char*)(0x42E00B54UL))
#define bFM4_CANFD_ILS_ELOL                    *((volatile unsigned char*)(0x42E00B58UL))
#define bFM4_CANFD_ILS_EPL                     *((volatile unsigned char*)(0x42E00B5CUL))
#define bFM4_CANFD_ILS_EWL                     *((volatile unsigned char*)(0x42E00B60UL))
#define bFM4_CANFD_ILS_BOL                     *((volatile unsigned char*)(0x42E00B64UL))
#define bFM4_CANFD_ILS_WDIL                    *((volatile unsigned char*)(0x42E00B68UL))
#define bFM4_CANFD_ILS_CRCEL                   *((volatile unsigned char*)(0x42E00B6CUL))
#define bFM4_CANFD_ILS_BEL                     *((volatile unsigned char*)(0x42E00B70UL))
#define bFM4_CANFD_ILS_ACKEL                   *((volatile unsigned char*)(0x42E00B74UL))
#define bFM4_CANFD_ILS_FOEL                    *((volatile unsigned char*)(0x42E00B78UL))
#define bFM4_CANFD_ILS_STEL                    *((volatile unsigned char*)(0x42E00B7CUL))
#define bFM4_CANFD_ILE_EINT0                   *((volatile unsigned char*)(0x42E00B80UL))
#define bFM4_CANFD_ILE_EINT1                   *((volatile unsigned char*)(0x42E00B84UL))
#define bFM4_CANFD_GFC_RRFE                    *((volatile unsigned char*)(0x42E01000UL))
#define bFM4_CANFD_GFC_RRFS                    *((volatile unsigned char*)(0x42E01004UL))
#define bFM4_CANFD_GFC_ANFE0                   *((volatile unsigned char*)(0x42E01008UL))
#define bFM4_CANFD_GFC_ANFE1                   *((volatile unsigned char*)(0x42E0100CUL))
#define bFM4_CANFD_GFC_ANFS0                   *((volatile unsigned char*)(0x42E01010UL))
#define bFM4_CANFD_GFC_ANFS1                   *((volatile unsigned char*)(0x42E01014UL))
#define bFM4_CANFD_SIDFC_FLSSA0                *((volatile unsigned char*)(0x42E01088UL))
#define bFM4_CANFD_SIDFC_FLSSA1                *((volatile unsigned char*)(0x42E0108CUL))
#define bFM4_CANFD_SIDFC_FLSSA2                *((volatile unsigned char*)(0x42E01090UL))
#define bFM4_CANFD_SIDFC_FLSSA3                *((volatile unsigned char*)(0x42E01094UL))
#define bFM4_CANFD_SIDFC_FLSSA4                *((volatile unsigned char*)(0x42E01098UL))
#define bFM4_CANFD_SIDFC_FLSSA5                *((volatile unsigned char*)(0x42E0109CUL))
#define bFM4_CANFD_SIDFC_FLSSA6                *((volatile unsigned char*)(0x42E010A0UL))
#define bFM4_CANFD_SIDFC_FLSSA7                *((volatile unsigned char*)(0x42E010A4UL))
#define bFM4_CANFD_SIDFC_FLSSA8                *((volatile unsigned char*)(0x42E010A8UL))
#define bFM4_CANFD_SIDFC_FLSSA9                *((volatile unsigned char*)(0x42E010ACUL))
#define bFM4_CANFD_SIDFC_FLSSA10               *((volatile unsigned char*)(0x42E010B0UL))
#define bFM4_CANFD_SIDFC_FLSSA11               *((volatile unsigned char*)(0x42E010B4UL))
#define bFM4_CANFD_SIDFC_FLSSA12               *((volatile unsigned char*)(0x42E010B8UL))
#define bFM4_CANFD_SIDFC_FLSSA13               *((volatile unsigned char*)(0x42E010BCUL))
#define bFM4_CANFD_SIDFC_LSS0                  *((volatile unsigned char*)(0x42E010C0UL))
#define bFM4_CANFD_SIDFC_LSS1                  *((volatile unsigned char*)(0x42E010C4UL))
#define bFM4_CANFD_SIDFC_LSS2                  *((volatile unsigned char*)(0x42E010C8UL))
#define bFM4_CANFD_SIDFC_LSS3                  *((volatile unsigned char*)(0x42E010CCUL))
#define bFM4_CANFD_SIDFC_LSS4                  *((volatile unsigned char*)(0x42E010D0UL))
#define bFM4_CANFD_SIDFC_LSS5                  *((volatile unsigned char*)(0x42E010D4UL))
#define bFM4_CANFD_SIDFC_LSS6                  *((volatile unsigned char*)(0x42E010D8UL))
#define bFM4_CANFD_SIDFC_LSS7                  *((volatile unsigned char*)(0x42E010DCUL))
#define bFM4_CANFD_XIDFC_FLESA0                *((volatile unsigned char*)(0x42E01108UL))
#define bFM4_CANFD_XIDFC_FLESA1                *((volatile unsigned char*)(0x42E0110CUL))
#define bFM4_CANFD_XIDFC_FLESA2                *((volatile unsigned char*)(0x42E01110UL))
#define bFM4_CANFD_XIDFC_FLESA3                *((volatile unsigned char*)(0x42E01114UL))
#define bFM4_CANFD_XIDFC_FLESA4                *((volatile unsigned char*)(0x42E01118UL))
#define bFM4_CANFD_XIDFC_FLESA5                *((volatile unsigned char*)(0x42E0111CUL))
#define bFM4_CANFD_XIDFC_FLESA6                *((volatile unsigned char*)(0x42E01120UL))
#define bFM4_CANFD_XIDFC_FLESA7                *((volatile unsigned char*)(0x42E01124UL))
#define bFM4_CANFD_XIDFC_FLESA8                *((volatile unsigned char*)(0x42E01128UL))
#define bFM4_CANFD_XIDFC_FLESA9                *((volatile unsigned char*)(0x42E0112CUL))
#define bFM4_CANFD_XIDFC_FLESA10               *((volatile unsigned char*)(0x42E01130UL))
#define bFM4_CANFD_XIDFC_FLESA11               *((volatile unsigned char*)(0x42E01134UL))
#define bFM4_CANFD_XIDFC_FLESA12               *((volatile unsigned char*)(0x42E01138UL))
#define bFM4_CANFD_XIDFC_FLESA13               *((volatile unsigned char*)(0x42E0113CUL))
#define bFM4_CANFD_XIDFC_LSE0                  *((volatile unsigned char*)(0x42E01140UL))
#define bFM4_CANFD_XIDFC_LSE1                  *((volatile unsigned char*)(0x42E01144UL))
#define bFM4_CANFD_XIDFC_LSE2                  *((volatile unsigned char*)(0x42E01148UL))
#define bFM4_CANFD_XIDFC_LSE3                  *((volatile unsigned char*)(0x42E0114CUL))
#define bFM4_CANFD_XIDFC_LSE4                  *((volatile unsigned char*)(0x42E01150UL))
#define bFM4_CANFD_XIDFC_LSE5                  *((volatile unsigned char*)(0x42E01154UL))
#define bFM4_CANFD_XIDFC_LSE6                  *((volatile unsigned char*)(0x42E01158UL))
#define bFM4_CANFD_XIDAM_EIDM0                 *((volatile unsigned char*)(0x42E01200UL))
#define bFM4_CANFD_XIDAM_EIDM1                 *((volatile unsigned char*)(0x42E01204UL))
#define bFM4_CANFD_XIDAM_EIDM2                 *((volatile unsigned char*)(0x42E01208UL))
#define bFM4_CANFD_XIDAM_EIDM3                 *((volatile unsigned char*)(0x42E0120CUL))
#define bFM4_CANFD_XIDAM_EIDM4                 *((volatile unsigned char*)(0x42E01210UL))
#define bFM4_CANFD_XIDAM_EIDM5                 *((volatile unsigned char*)(0x42E01214UL))
#define bFM4_CANFD_XIDAM_EIDM6                 *((volatile unsigned char*)(0x42E01218UL))
#define bFM4_CANFD_XIDAM_EIDM7                 *((volatile unsigned char*)(0x42E0121CUL))
#define bFM4_CANFD_XIDAM_EIDM8                 *((volatile unsigned char*)(0x42E01220UL))
#define bFM4_CANFD_XIDAM_EIDM9                 *((volatile unsigned char*)(0x42E01224UL))
#define bFM4_CANFD_XIDAM_EIDM10                *((volatile unsigned char*)(0x42E01228UL))
#define bFM4_CANFD_XIDAM_EIDM11                *((volatile unsigned char*)(0x42E0122CUL))
#define bFM4_CANFD_XIDAM_EIDM12                *((volatile unsigned char*)(0x42E01230UL))
#define bFM4_CANFD_XIDAM_EIDM13                *((volatile unsigned char*)(0x42E01234UL))
#define bFM4_CANFD_XIDAM_EIDM14                *((volatile unsigned char*)(0x42E01238UL))
#define bFM4_CANFD_XIDAM_EIDM15                *((volatile unsigned char*)(0x42E0123CUL))
#define bFM4_CANFD_XIDAM_EIDM16                *((volatile unsigned char*)(0x42E01240UL))
#define bFM4_CANFD_XIDAM_EIDM17                *((volatile unsigned char*)(0x42E01244UL))
#define bFM4_CANFD_XIDAM_EIDM18                *((volatile unsigned char*)(0x42E01248UL))
#define bFM4_CANFD_XIDAM_EIDM19                *((volatile unsigned char*)(0x42E0124CUL))
#define bFM4_CANFD_XIDAM_EIDM20                *((volatile unsigned char*)(0x42E01250UL))
#define bFM4_CANFD_XIDAM_EIDM21                *((volatile unsigned char*)(0x42E01254UL))
#define bFM4_CANFD_XIDAM_EIDM22                *((volatile unsigned char*)(0x42E01258UL))
#define bFM4_CANFD_XIDAM_EIDM23                *((volatile unsigned char*)(0x42E0125CUL))
#define bFM4_CANFD_XIDAM_EIDM24                *((volatile unsigned char*)(0x42E01260UL))
#define bFM4_CANFD_XIDAM_EIDM25                *((volatile unsigned char*)(0x42E01264UL))
#define bFM4_CANFD_XIDAM_EIDM26                *((volatile unsigned char*)(0x42E01268UL))
#define bFM4_CANFD_XIDAM_EIDM27                *((volatile unsigned char*)(0x42E0126CUL))
#define bFM4_CANFD_XIDAM_EIDM28                *((volatile unsigned char*)(0x42E01270UL))
#define bFM4_CANFD_HPMS_BIDX0                  *((volatile unsigned char*)(0x42E01280UL))
#define bFM4_CANFD_HPMS_BIDX1                  *((volatile unsigned char*)(0x42E01284UL))
#define bFM4_CANFD_HPMS_BIDX2                  *((volatile unsigned char*)(0x42E01288UL))
#define bFM4_CANFD_HPMS_BIDX3                  *((volatile unsigned char*)(0x42E0128CUL))
#define bFM4_CANFD_HPMS_BIDX4                  *((volatile unsigned char*)(0x42E01290UL))
#define bFM4_CANFD_HPMS_BIDX5                  *((volatile unsigned char*)(0x42E01294UL))
#define bFM4_CANFD_HPMS_MSI0                   *((volatile unsigned char*)(0x42E01298UL))
#define bFM4_CANFD_HPMS_MSI1                   *((volatile unsigned char*)(0x42E0129CUL))
#define bFM4_CANFD_HPMS_FIDX0                  *((volatile unsigned char*)(0x42E012A0UL))
#define bFM4_CANFD_HPMS_FIDX1                  *((volatile unsigned char*)(0x42E012A4UL))
#define bFM4_CANFD_HPMS_FIDX2                  *((volatile unsigned char*)(0x42E012A8UL))
#define bFM4_CANFD_HPMS_FIDX3                  *((volatile unsigned char*)(0x42E012ACUL))
#define bFM4_CANFD_HPMS_FIDX4                  *((volatile unsigned char*)(0x42E012B0UL))
#define bFM4_CANFD_HPMS_FIDX5                  *((volatile unsigned char*)(0x42E012B4UL))
#define bFM4_CANFD_HPMS_FIDX6                  *((volatile unsigned char*)(0x42E012B8UL))
#define bFM4_CANFD_HPMS_FLST                   *((volatile unsigned char*)(0x42E012BCUL))
#define bFM4_CANFD_NDAT1_ND0                   *((volatile unsigned char*)(0x42E01300UL))
#define bFM4_CANFD_NDAT1_ND1                   *((volatile unsigned char*)(0x42E01304UL))
#define bFM4_CANFD_NDAT1_ND2                   *((volatile unsigned char*)(0x42E01308UL))
#define bFM4_CANFD_NDAT1_ND3                   *((volatile unsigned char*)(0x42E0130CUL))
#define bFM4_CANFD_NDAT1_ND4                   *((volatile unsigned char*)(0x42E01310UL))
#define bFM4_CANFD_NDAT1_ND5                   *((volatile unsigned char*)(0x42E01314UL))
#define bFM4_CANFD_NDAT1_ND6                   *((volatile unsigned char*)(0x42E01318UL))
#define bFM4_CANFD_NDAT1_ND7                   *((volatile unsigned char*)(0x42E0131CUL))
#define bFM4_CANFD_NDAT1_ND8                   *((volatile unsigned char*)(0x42E01320UL))
#define bFM4_CANFD_NDAT1_ND9                   *((volatile unsigned char*)(0x42E01324UL))
#define bFM4_CANFD_NDAT1_ND10                  *((volatile unsigned char*)(0x42E01328UL))
#define bFM4_CANFD_NDAT1_ND11                  *((volatile unsigned char*)(0x42E0132CUL))
#define bFM4_CANFD_NDAT1_ND12                  *((volatile unsigned char*)(0x42E01330UL))
#define bFM4_CANFD_NDAT1_ND13                  *((volatile unsigned char*)(0x42E01334UL))
#define bFM4_CANFD_NDAT1_ND14                  *((volatile unsigned char*)(0x42E01338UL))
#define bFM4_CANFD_NDAT1_ND15                  *((volatile unsigned char*)(0x42E0133CUL))
#define bFM4_CANFD_NDAT1_ND16                  *((volatile unsigned char*)(0x42E01340UL))
#define bFM4_CANFD_NDAT1_ND17                  *((volatile unsigned char*)(0x42E01344UL))
#define bFM4_CANFD_NDAT1_ND18                  *((volatile unsigned char*)(0x42E01348UL))
#define bFM4_CANFD_NDAT1_ND19                  *((volatile unsigned char*)(0x42E0134CUL))
#define bFM4_CANFD_NDAT1_ND20                  *((volatile unsigned char*)(0x42E01350UL))
#define bFM4_CANFD_NDAT1_ND21                  *((volatile unsigned char*)(0x42E01354UL))
#define bFM4_CANFD_NDAT1_ND22                  *((volatile unsigned char*)(0x42E01358UL))
#define bFM4_CANFD_NDAT1_ND23                  *((volatile unsigned char*)(0x42E0135CUL))
#define bFM4_CANFD_NDAT1_ND24                  *((volatile unsigned char*)(0x42E01360UL))
#define bFM4_CANFD_NDAT1_ND25                  *((volatile unsigned char*)(0x42E01364UL))
#define bFM4_CANFD_NDAT1_ND26                  *((volatile unsigned char*)(0x42E01368UL))
#define bFM4_CANFD_NDAT1_ND27                  *((volatile unsigned char*)(0x42E0136CUL))
#define bFM4_CANFD_NDAT1_ND28                  *((volatile unsigned char*)(0x42E01370UL))
#define bFM4_CANFD_NDAT1_ND29                  *((volatile unsigned char*)(0x42E01374UL))
#define bFM4_CANFD_NDAT1_ND30                  *((volatile unsigned char*)(0x42E01378UL))
#define bFM4_CANFD_NDAT1_ND31                  *((volatile unsigned char*)(0x42E0137CUL))
#define bFM4_CANFD_NDAT2_ND32                  *((volatile unsigned char*)(0x42E01380UL))
#define bFM4_CANFD_NDAT2_ND33                  *((volatile unsigned char*)(0x42E01384UL))
#define bFM4_CANFD_NDAT2_ND34                  *((volatile unsigned char*)(0x42E01388UL))
#define bFM4_CANFD_NDAT2_ND35                  *((volatile unsigned char*)(0x42E0138CUL))
#define bFM4_CANFD_NDAT2_ND36                  *((volatile unsigned char*)(0x42E01390UL))
#define bFM4_CANFD_NDAT2_ND37                  *((volatile unsigned char*)(0x42E01394UL))
#define bFM4_CANFD_NDAT2_ND38                  *((volatile unsigned char*)(0x42E01398UL))
#define bFM4_CANFD_NDAT2_ND39                  *((volatile unsigned char*)(0x42E0139CUL))
#define bFM4_CANFD_NDAT2_ND40                  *((volatile unsigned char*)(0x42E013A0UL))
#define bFM4_CANFD_NDAT2_ND41                  *((volatile unsigned char*)(0x42E013A4UL))
#define bFM4_CANFD_NDAT2_ND42                  *((volatile unsigned char*)(0x42E013A8UL))
#define bFM4_CANFD_NDAT2_ND43                  *((volatile unsigned char*)(0x42E013ACUL))
#define bFM4_CANFD_NDAT2_ND44                  *((volatile unsigned char*)(0x42E013B0UL))
#define bFM4_CANFD_NDAT2_ND45                  *((volatile unsigned char*)(0x42E013B4UL))
#define bFM4_CANFD_NDAT2_ND46                  *((volatile unsigned char*)(0x42E013B8UL))
#define bFM4_CANFD_NDAT2_ND47                  *((volatile unsigned char*)(0x42E013BCUL))
#define bFM4_CANFD_NDAT2_ND48                  *((volatile unsigned char*)(0x42E013C0UL))
#define bFM4_CANFD_NDAT2_ND49                  *((volatile unsigned char*)(0x42E013C4UL))
#define bFM4_CANFD_NDAT2_ND50                  *((volatile unsigned char*)(0x42E013C8UL))
#define bFM4_CANFD_NDAT2_ND51                  *((volatile unsigned char*)(0x42E013CCUL))
#define bFM4_CANFD_NDAT2_ND52                  *((volatile unsigned char*)(0x42E013D0UL))
#define bFM4_CANFD_NDAT2_ND53                  *((volatile unsigned char*)(0x42E013D4UL))
#define bFM4_CANFD_NDAT2_ND54                  *((volatile unsigned char*)(0x42E013D8UL))
#define bFM4_CANFD_NDAT2_ND55                  *((volatile unsigned char*)(0x42E013DCUL))
#define bFM4_CANFD_NDAT2_ND56                  *((volatile unsigned char*)(0x42E013E0UL))
#define bFM4_CANFD_NDAT2_ND57                  *((volatile unsigned char*)(0x42E013E4UL))
#define bFM4_CANFD_NDAT2_ND58                  *((volatile unsigned char*)(0x42E013E8UL))
#define bFM4_CANFD_NDAT2_ND59                  *((volatile unsigned char*)(0x42E013ECUL))
#define bFM4_CANFD_NDAT2_ND60                  *((volatile unsigned char*)(0x42E013F0UL))
#define bFM4_CANFD_NDAT2_ND61                  *((volatile unsigned char*)(0x42E013F4UL))
#define bFM4_CANFD_NDAT2_ND62                  *((volatile unsigned char*)(0x42E013F8UL))
#define bFM4_CANFD_NDAT2_ND63                  *((volatile unsigned char*)(0x42E013FCUL))
#define bFM4_CANFD_RXF0C_F0SA0                 *((volatile unsigned char*)(0x42E01408UL))
#define bFM4_CANFD_RXF0C_F0SA1                 *((volatile unsigned char*)(0x42E0140CUL))
#define bFM4_CANFD_RXF0C_F0SA2                 *((volatile unsigned char*)(0x42E01410UL))
#define bFM4_CANFD_RXF0C_F0SA3                 *((volatile unsigned char*)(0x42E01414UL))
#define bFM4_CANFD_RXF0C_F0SA4                 *((volatile unsigned char*)(0x42E01418UL))
#define bFM4_CANFD_RXF0C_F0SA5                 *((volatile unsigned char*)(0x42E0141CUL))
#define bFM4_CANFD_RXF0C_F0SA6                 *((volatile unsigned char*)(0x42E01420UL))
#define bFM4_CANFD_RXF0C_F0SA7                 *((volatile unsigned char*)(0x42E01424UL))
#define bFM4_CANFD_RXF0C_F0SA8                 *((volatile unsigned char*)(0x42E01428UL))
#define bFM4_CANFD_RXF0C_F0SA9                 *((volatile unsigned char*)(0x42E0142CUL))
#define bFM4_CANFD_RXF0C_F0SA10                *((volatile unsigned char*)(0x42E01430UL))
#define bFM4_CANFD_RXF0C_F0SA11                *((volatile unsigned char*)(0x42E01434UL))
#define bFM4_CANFD_RXF0C_F0SA12                *((volatile unsigned char*)(0x42E01438UL))
#define bFM4_CANFD_RXF0C_F0SA13                *((volatile unsigned char*)(0x42E0143CUL))
#define bFM4_CANFD_RXF0C_F0S0                  *((volatile unsigned char*)(0x42E01440UL))
#define bFM4_CANFD_RXF0C_F0S1                  *((volatile unsigned char*)(0x42E01444UL))
#define bFM4_CANFD_RXF0C_F0S2                  *((volatile unsigned char*)(0x42E01448UL))
#define bFM4_CANFD_RXF0C_F0S3                  *((volatile unsigned char*)(0x42E0144CUL))
#define bFM4_CANFD_RXF0C_F0S4                  *((volatile unsigned char*)(0x42E01450UL))
#define bFM4_CANFD_RXF0C_F0S5                  *((volatile unsigned char*)(0x42E01454UL))
#define bFM4_CANFD_RXF0C_F0S6                  *((volatile unsigned char*)(0x42E01458UL))
#define bFM4_CANFD_RXF0C_F0WM0                 *((volatile unsigned char*)(0x42E01460UL))
#define bFM4_CANFD_RXF0C_F0WM1                 *((volatile unsigned char*)(0x42E01464UL))
#define bFM4_CANFD_RXF0C_F0WM2                 *((volatile unsigned char*)(0x42E01468UL))
#define bFM4_CANFD_RXF0C_F0WM3                 *((volatile unsigned char*)(0x42E0146CUL))
#define bFM4_CANFD_RXF0C_F0WM4                 *((volatile unsigned char*)(0x42E01470UL))
