sol4ik/audio-steganography/try/fm4/s6e2cc_i2s_sk-fm4-176l-s6se2cc-v10/common/s6e2cc.h
#define bFM4_HSSPI_WRCSDC3_TRP0                *((volatile unsigned char*)(0x1242001E44UL))
#define bFM4_HSSPI_WRCSDC3_TRP1                *((volatile unsigned char*)(0x1242001E48UL))
#define bFM4_HSSPI_WRCSDC3_CONT                *((volatile unsigned char*)(0x1242001E4CUL))
#define bFM4_HSSPI_WRCSDC4_DEC                 *((volatile unsigned char*)(0x1242001E80UL))
#define bFM4_HSSPI_WRCSDC4_TRP0                *((volatile unsigned char*)(0x1242001E84UL))
#define bFM4_HSSPI_WRCSDC4_TRP1                *((volatile unsigned char*)(0x1242001E88UL))
#define bFM4_HSSPI_WRCSDC4_CONT                *((volatile unsigned char*)(0x1242001E8CUL))
#define bFM4_HSSPI_WRCSDC5_DEC                 *((volatile unsigned char*)(0x1242001EC0UL))
#define bFM4_HSSPI_WRCSDC5_TRP0                *((volatile unsigned char*)(0x1242001EC4UL))
#define bFM4_HSSPI_WRCSDC5_TRP1                *((volatile unsigned char*)(0x1242001EC8UL))
#define bFM4_HSSPI_WRCSDC5_CONT                *((volatile unsigned char*)(0x1242001ECCUL))
#define bFM4_HSSPI_WRCSDC6_DEC                 *((volatile unsigned char*)(0x1242001F00UL))
#define bFM4_HSSPI_WRCSDC6_TRP0                *((volatile unsigned char*)(0x1242001F04UL))
#define bFM4_HSSPI_WRCSDC6_TRP1                *((volatile unsigned char*)(0x1242001F08UL))
#define bFM4_HSSPI_WRCSDC6_CONT                *((volatile unsigned char*)(0x1242001F0CUL))
#define bFM4_HSSPI_WRCSDC7_DEC                 *((volatile unsigned char*)(0x1242001F40UL))
#define bFM4_HSSPI_WRCSDC7_TRP0                *((volatile unsigned char*)(0x1242001F44UL))
#define bFM4_HSSPI_WRCSDC7_TRP1                *((volatile unsigned char*)(0x1242001F48UL))
#define bFM4_HSSPI_WRCSDC7_CONT                *((volatile unsigned char*)(0x1242001F4CUL))
#define bFM4_HSSPI_DBCNT_RXDBEN                *((volatile unsigned char*)(0x1242008080UL))
#define bFM4_HSSPI_DBCNT_TXDBEN                *((volatile unsigned char*)(0x1242008084UL))

#ifdef __cplusplus
}
#endif

#endif /* _S6E2CC_H_ */

